{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "I highly recommend this vegan spot. It's a local favorite. I  got a strawberry heaven smoothie and some items from the hot bar: a biscuit, fried gluten (similar to fried chicken), a chickpea cake, egg (tofu scramble), and some potatoes. The chickpea cake and fried gluten surprised me--it was really well-seasoned. The biscuit was also flaky.The strawberry heaven smoothie had a great balance of banana and strawberry. Almost tasted like drinking cake. Tip: Pizza is unavailable everyday BUT Sunday. Prepared food starts at 11. Bathroom was very clean.", "date": "Dec 3, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "The food is ten stars in my opinion. I never ever have an issue with the food, I gobble it down every time. Delicious authentic soul food that is vegan is like food for the gods.The service, however,  is so inconsistent and blah that it goes from ten stars to four. You feel like you are walking on eggshells and these people feel they are doing you a favor by doing the bare minimum.", "date": "Aug 31, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Chicago needs more than one of this place. The food is excellent and definitely authentic, and the staff is polite and friendly. I recommend Sundays when they have brunch in the morning and full-on soul food for dinner. But, they don't call it \"Slo Vegetarian\" for nothing; be prepared to watch Black Hebrew Israelite family members get served before you. Also, they often run out of certain dishes, so it's helpful to be flexible.This is one of the few places on the South Side that White people go out of their way to visit, so that should tell you something right there. Also, check out the deli next door and take home some of those delicious BBQ twists or some Carrot Supreme!", "date": "May 13, 2009Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "It has been almost 20 years since I last been to this location. It was great to see the recently totally revamped restaurant has not lost is ablitz it served great food.You can order off the hot bar. you pay by the weight. So you can get as much or as little of items on the bar as you wish. You can also order items  to be prepared of the menu.Carrot cake: 3.5/5  moist and fresh but the icing was  too sweet for meMacaroni and cheese: 5/5  no explanation neededCabbage: 4.5/5 crispy seasonedUnchicken patties: 4.5/Blackeyed peas: 3/5 no seasonings and kind of wateryOverall 4.5/5.0  Check them out", "date": "Aug 27, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "The #1 stop hands down the best Vegan/ Veggie food in the metro Chicago area. The mac and cheese and gravey burger are always on point. Protein tidbits are great and so is the  lasagna. Try it you'll be hooked!!FYI: The parking in the area is horrible but if you can find a spot check out this spot!!", "date": "Jan 11, 2016Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "I love Soul Vegetarian they on 75th and Indiana been going there for years. I'm a vegetarian so that's smart to go place. I very seldom go to any other place but there but they have change management and the young lady that's the manager there her attitude towards me is not good I'm never gonna stop going there because that's my favorite place and I love the food.", "date": "Feb 15, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Heard good things about this restaurant and decided to give them a try. I ordered through DoorDash. The food was great! It's hard to find a restaurant that makes good greens, let alone one without meat. And the cornbread was great as well! The Zesty Cauliflower Wingz and Battered Mushrooms were perfectly seasoned and very flavorful! Enjoyed every bite. Will definitely return!", "date": "Jan 31, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "We stumbled across this yummy vegan restaurant on our way home and were pleasantly surprised. I was asking employees about the business and they newly renovated and expanded. The inside is beautiful and captures black excellence. You can order from a menu or from the hot bar which is by the pound. There is also a cold case and all raw options. I got a variety of hot items to try some food and everything was great. I'll be back Chicago.", "date": "Dec 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "A Black-Owned vegan restaurant on the Southside of Chicago. They have delicious al a carte vegan and plant-based soul food items to choose from. They also have daily specials.", "date": "Jan 23, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "We came here Juneteenth weekend, and during one of my 'no red meat' phases. But even carnivores would find something here they'd like. I can't get used to the new name; it used to be 'Soul Vegetarian', which I like better frankly.Anyway, we came here for 'lunch' around 2 on Saturday. There are hot and cold bars, plus a cooler with desserts and pre-set meals. There is definitely less of a wait for the bars than ordering on demand. The portions are dished out by staff, it is not self serve.I got cabbage, 'rib meat', 'shrimp' stew, veggies, and cornbread. We also got sweet potato pie and soft serve peach for dessert. The front room for ordering was hot, with no air, but the dining area was cool, with a cooler of 'lemon water'. The food was fabulous, moist and maybe a little underseasoned! we were given salt and pepper. There should be labels on the food so you don't waste time asking what is what, but I realize the menu changes so that may not be feasible; there should also be a HEAT index! The shrimp stew was spicy; I can deal with spicy but it's good to know in advance. I may go next time just for the desserts; vegan is not the same as low-calorie, but it feels like it, ya know?", "date": "Jun 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Good is good , service is great at times & sometimes it's not all that. Sometimes the employees don't engage with customers, they give off \"get your food & keep it moving \".... The place is nice the tables are cool.", "date": "Jan 19, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "This place has gotten even better since I last stopped by 2.5 years ago. It has a variety of options, the menu even having expanded. Such healthy and delicious food. Also, everyone working is very friendly. The restaurant expanded so there's lots of seating and the ambience is a very crisp, fresh feel. A one-of-a-kind restaurant! Even if you aren't vegetarian or vegan, you will enjoy this place. Check it out!!!", "date": "Feb 7, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "In Chicago visiting and my cousin always tries to find new vegetarian spots for me, enter SVC. I told her I thought I'd been here before, but we stopped thru anyway.The lady working the hot bar was very helpful, offered samples, and explained a few things on the menu. The lady at the cashier not so much. I tried to get clarity on what was in one of the items and very nonchalantly said she didn't know. She then asked a girl who had just come from the kitchen what was in it, and she said she didn't know as well. Obviously, I went with something else....Lol Anyhoo, the falafel pita was pretty good, a little burnt, but I liked the crispness of it being burnt. Most people probably won't like that. Fries could have been cooked longer and seasoned a little better.Overall it's a nice environment, the food was good, and the prices were right. There were multiple things on the menu I wanted to try, so I'll definitely be back when in town.", "date": "Mar 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "I'm actually sitting outside the restaurant as I write this review. Unfortunately, for the second time I've ordered online, requested curbside, waited outside in front of the door and no one has brought my food. Also, The telephone number listed online does not work. And, I paid a tip. Did I just tip a business for providing a service that they did not provide ? Now, I have to walk in to this restaurant on a sore knee after waiting over an hour ? This is absolutely horrible. I use to come here at least weekly but I haven't been here in months due to their failure to provide promptly curbside. I can't say I'll be back. No parking lot and no curbside. Terrible.", "date": "Sep 13, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "This restaurant serves vegetarian dishes. I haven't eaten here, but my mom and uncle love the place. They say the food is quite tasty. It down the street from home. It's a very clean place. I can't comment on the service, but it may be worth trying because they keep going back!", "date": "Jan 18, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Food: 5/5, Service: 5/5 - Would definitely recommend *Black Owned Vegan Soul/Comfort Food*I came here on Easter Sunday for the 1st time and I was very impressed! For starters, the owner is truly EVERYTHING! She was so warm and welcoming and walked me through literally every item on the menu. She also allowed me to sample any and everything I wanted to. Because of her enthusiasm and personality, I basically tried the entire menu and everything was wonderful. All of the items were very flavorful and reminded me of traditional \"Black Sunday Dinner\". I would truly recommend giving this place a try!", "date": "Jun 26, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Wow! Haven't been by Soul Veg since before the update, so it definitely felt like a completely different restaurant when my friend and I visited.Rather than table service, they've got a self-service, fast casual vibe now. They have a hot bar and a cold bar to order from (though there are still menu items available), they dish it out, and you pay. You can opt to find a table to dine-in, or carry out. The dining room had a water dispenser which was also self-serviceWhile I preferred the self-service (I was seated and eating in minutes which never happened on previous visits) my friend said she missed the more formal dining option. That said all the food was great, and I enjoyed my bbq protein and cabbage immensely. My friend said her poboy was excellent. The blueberry pie got mixed reviews-- good sweetness but could use more crust. Overall, while I missed some aspects of the old restaurant (like the gentlemen always playing chess at the entrance) all things change and SVC's update is for the better and the food still slaps!", "date": "Mar 21, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Food, service, ambiance all great. Highly recommend & one of my favorite spots to grab food after a long day. Their vegan Mac & cheese makes me so happy too because it's so hard to perfect that. Always a good meal at Soul Veg City.", "date": "Jul 24, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "You must try the vegan pizza. The worst part of becoming vegan was giving up cheese. I've tried vegan pizza at many places and did not like any of them until trying the vegan pizza at Soul Veg City. They also sale it by the slice. My favorite slices are the veggie, the plain cheese and the jalapeño and olive.", "date": "Nov 6, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "I loved loved loved the food. The service was impeccable and it's a cute Food Truck with knowledgeable staff.", "date": "Oct 6, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "My daughter invited me to Soul Veg City. Some of the food was ok. The cake was good too but the food cost too much. The atmosphere was nice. I believe in second chances, so I'll try it one more time.", "date": "Dec 26, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Black owned business. They do a great job with the cook to order food. Mediocre for the wet bar", "date": "Sep 30, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "I was fresh out of college without a job and only $5 in my pocket. My friend insisted on going here to eat. They let me eat for her words,\"no big deal,\" I'm guessing that's not their norm. Maybe the waitress paid for me, I have no idea. I do know I was hungry, embarrassed and appreciative. This took place 20 years ago and their food is still delicious today! The food was aaaaaaamazing. I couldn't believe it was meatless! The seasoning was as kids today say, \"slapping\" , ha! The overall texture of everything was great too. I really liked it, but the human aspect of this place matters so much to me and 20 years have passed.", "date": "Dec 30, 2022Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "This is the best vegetarian - vegan restaurant in Chicago. I walked into this restaurant with a friend shortly after graduating from college in 2003. Completely broke as all new graduates were, but still very hungry, so I decided to sit with my friend while she ate. The staff was exceptionally kind and told me that it would be no big deal if I wanted to eat there. :) Imagine that.... (smiles) The food was extremely delicious and flavorful with the perfect amount of seasoning. This is soul food without the fat, sodium and other horrible things that people consume when eating what Americans call \"ethnic\" food. This restaurant is a great experience for people that enjoy meat as well. Meat lovers tend to enjoy the surprise of great tasting meat substitutes. The restaurant itself is a bit outdated and old fashioned and is not the place to take a date, but it's good enough for casual dining with friends. The waiters are extremely kind and very attentive.", "date": "Sep 20, 2012Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Service is a hit and miss. Ordering from the hot bar or the menu is always good. However, some items can be a bit bland but still good.", "date": "Nov 26, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "So glad they upgraded!! Food was great and employees were friendly. This is one of the best priced vegan places. So many places are over priced now", "date": "Dec 7, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "The Bang Bang Cauliflower is the best in the city! The food is flavorful. They have a very spacious and clean dining area. It can get very busy during lunchtime, so be patient and kind. Some items are cooked fresh, other items are cooked and ready to plate for takeout. Street parking is available, but depending on time of visit... you may have to park a little further down.", "date": "Feb 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Oh this is good!It's been around for over 40 years, but this was our first time here. The food exceeded our high expectations.We ordered a few things from the hot bar without even intending to. We were entranced by the pressed BBQ seitan, the Cajun blackened tofu and the cauliflower in spicy sauce. All three hit the spot and it was tough to pick a favorite: I was in a BBQ mood, but that Cajun tofu had some impressive seasoning and texture. Then again, that cauliflower...Anyway, we ordered two things off the menu: 1) seitan gyros with plain fries and 2) vegan fish and tartar with battered fries. The gyro is called Amazing, but it fell a little short of that. Still, it was very good and the vegan cucumber sauce very much tied the sandwich together. The pita bread had a wonderful softness and flavor to it as well. The second was unbelievably low-key awesome: great combination of flavors and textures in the soy fish and tartar. The bun was slightly too big, but it wasn't a detriment either. The battered fries have an outstanding texture and flavor as well, also low-key awesome.More food? Heck yeah! Vanilla walnut cake with a chocolate (and maybe hazelnut) frosting rounded out the meal. Actually, we ate this first while we were waiting for the menu items to be prepared, but don't tell anyone. In any case, it had a sweet flavor and rich texture overall, and it was very satisfying.We'll be back to try more.", "date": "Sep 20, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "Sometimes I go for the food bar, other times I order from the menu. Kale greens were pretty tasty. Good flavor. Potato salad is bomb. BBQ tidbits are good. Don't like their cakes; they tend to always be dry. Disappointing. I also disliked their battered steak. Their cabbage is delicious, purple or regular. Deep fried seasoned fries with BBQ sauce and their Fried Tofu Sandwich are amazing!  They recently remodeled and it's beautiful. Don't forget that they also have soft serve. The flavors rotate. It's so good!!  This continues to be a place that I frequent whenever I'm in town.", "date": "Feb 17, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Soul Veg City", "alias": "soul-veg-city-chicago", "text": "So the food is pretty good - and the restaurant is understandably quite popular. That said, the service is really, really, poor. I hate to say something negative about such a good place, but seriously, if you order off the menu, you need to plan to wait at least 30 minutes - we waited 60! They need to fix their kitchen issues and not push Grub Hub orders ahead of their in-store customers. Someone warned me about the exceptionally slow service and I should have believed him. Next time I will only go if I can use the buffet.", "date": "Oct 16, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Delicious spaghetti served as a side?  My mind was blown.  And the shrimp!! Perfectly battered and seasoned well.  This is a definite must try when you visit. It is carry out only, so it's best to call in your order and pick it up.  The service was quick, and the staff member was nice and accommodating. Add this place to your list and thank me later.", "date": "Jan 26, 2024", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Amazing jumbo shrimp with perfect seasonings. A to-go only restaurant. Black-Owned and always busy.", "date": "Jan 31, 2024", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Loved the Gulf Shrimps. I ordered the shrimp dinner with spaghetti and coleslaw. Delicious!  I highly recommend Haire'sOrdered takeout and my order was ready in approximately 15 minutes. These are Louisiana Gulf Shrimps y'all. Lightly seasoned and breaded so you actually taste the shrimp!Again, I recommend this restaurant.", "date": "Jan 23, 2024", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Let me start by saying I love black owned businesses! I've been living in the city my entire life and this my first time actually trying this place to my memory and it did not disappoint! Don't let my pictures fool you, those were taken in the middle of me eating and I knew then I had to leave a review! The spaghetti is tasty and the shrimp are really seasoned! The service is pretty quick and efficient, I liked it!  The ambiance is pretty chill, I enjoyed seeing all the articles about Mr. Haire and even the memorial area they have set up for him it was really touching! I will surely be back to eat again!!", "date": "Dec 13, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Freshly cooked to order courteous staff and very clean lobby; Accepts Apple Pay. We didn't try the sides this time but we will return for the LARGE bomb bag w/sides! Good choice", "date": "Jul 22, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Very excited to share this review. I never knew this place existed until hubby and I went to the Taste of Chicago on July 10, 2022. Their food truck was there. The line was so long! We stood in line but the line didn't seem to move much so we left and enjoyed other parts of the Taste. We really wanted the shrimp because we both love shrimp so we went back to the truck. The line was still long but not as long as prior. We stood there wondering if we'll actually get to taste their shrimp. Then the business did something which was a great idea - they had employees come past the line with shrimp portions offering it to people who had CASH ONLY. That really saved us - we had cash and got our shrimp, left the line and enjoyed. Boy was it good! Very well seasoned and nice sized shrimp. We wanted that experience again so we decided on 8/27/22 to visit their storefront and order the large shrimp dinner and chose fries as our side. It's really nice inside and plenty of room for indoor seating but there is only take out, no table/chairs to eat in. The portions are a nice size and I feel it's definitely worth the price!Young people working there and they were very friendly which is always a plus in my book. We will continue to patronize this establishment now that we know it exists. Thank you Haire shrimp, you are simply MARVELOUS!", "date": "Sep 28, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Don't get me wrong, I absolutely love the food here & I'm not for bringing down any Black Owned Businesses. However,  I felt totally disrespected by whoever the lady was who damn near refused to sell me 2 beverages. Upon getting my food, I was otp with my Mom, who decided she wanted a pop. I stood patiently and waited for someone to come back to the register. I asked the guy in the back what kind of pop he had. The lady in the back shouted there wasn't any. The guy said there was pineapple and Pepsi. Then told the lady I was at the window waiting to be rung up. She then started yelling about how it was \"over with\"....she then proceeded to fuss about \"her rule\" stating the next time a customer has paid, they're not allowed to purchase anything else. I was very upset & paid for the pops because my mother wanted it. Once I got inside my car I was fuming...I'm a paying customer! I wasn't someone begging for free items. I both paid & tipped for my food. Very disrespectful! I'd rather spend my money in my neighborhood with black business owners than to spend my money with 'the others'.....Next time my momma gon be drinking water. The food was excellent, the original cashier, very pleasant, the guy who did the hand off. Awesome. I was spoken to rudely DIRECTLY, but that lady could have waited until there were no customers in earshot to decide she didn't want to sell me beverages.", "date": "Oct 20, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Never had a bad bag !!!  You will know what i meant by this.The shrimps are lightly bartered to perfection If ever on the south side not far from the Dan Rhyn and 75th St. stop by and grab a bag.", "date": "Apr 2, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "The best shrimp at both the brick and mortar on 74th & Vincennes and at every event there was a Haire's Food Truck", "date": "Nov 17, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "If you're from the South side of Chicago and have never had Haire's you should be ashamed of yourself. Black owned/operated restaurant serving some of the tastiest fried shrimp the South Side has to offer. I miss seeing Mr. Haire sitting in his booth, glad the legacy continues. Go get some!", "date": "Dec 29, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "First time eating here today at the food truck event. These shrimp where the best meal at the entire venue!!", "date": "Jul 29, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "I've been looking for seafood done right and this is it! The shrimp are good and seasoned perfectly!! The customer service was top notch. The restaurant is clean and nice.", "date": "May 7, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Ordered a large bomb bag. Planned to order a large shrimp dinner but they were out if spaghetti and I didn't want fries. Best shrimp and cocktail sauce I've ever had in my life!", "date": "Aug 12, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Delicious shrimp and Turkey spaghetti I think the prices are little high but the food is really good", "date": "Nov 22, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Very tastyFast and polite Needs new carpet, booths and lighting The food is delicious but they need to improve the actual look of the inside to enhance their appearance", "date": "Feb 8, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Best shrimp in Chicago! The large bomb bag is a must! Always fresh, fast and friendly service when I come here!", "date": "Nov 4, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "OMG This place is awesome!! Customer service is fantastic and their prices are comparable and fair! The shrimp are deveined, and the spaghetti taste like Big Mamas!", "date": "Sep 10, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "I started eating Pop's shrimp (didn't have a name on the train so I called him Pops) back in the 90's when all he had were two train cars (caboose) on Stony Island @ 85th.  He was an awesome old man with a heart of gold. Very friendly and his customer service was well beyond what we get in today's world. One train car was use for storage & supplies; the other for preparing, frying and selling his shrimp. Mind you that's all that's sold...shrimp (delicious shrimp)! Oh, you can get fries and/or spaghetti. But the only seafood you gonna get are shrimp.  On Friday nights  my Bestie & I would come to the City to hang out. However, we had the consume food before drinks. She always wanted to go the JJ Fish. I could not understand why the parking lot was full of car but the JJ restaurant was empty. All I could see were two train cars in the back with a parking lot up front.One day I decided to walk back there to see what was going on. As I approached the stairs to this train car a gentleman was coming out with his bag of food. I asked him, 'what was this place' he replied 'a shrimp house'! I said on a train; are they any good? He then responded 'once you try the shrimp   here you aren't going to want to go any place else. That man did not lie. These are the best shrimp this side of the Mississippi River.Oh let me not forget the spaghetti. I don't eat spaghetti much especially outside of my family. I really enjoy the recipe that is used at Haire's Gulf Shrimp. RIP Pops, I'm going to miss seeing you in your favorite spot in the new location. But I see they have a life size statue of you in your spot!I pray that your family continue with your rich tradition and family recipe. I already noticed they changed the container that your food is served but the shrimp are still the same!If you are in the area and got a taste for fried shrimp stop in, I'm certain you will not be disappointed.", "date": "Oct 10, 2021Updated review", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "These are the best fried shrimp in the Chicagoland area. They only sale shrimp, fried & spaghetti. Even the spaghetti is delicious. I recommend this shrimp house to shrimp lovers everywhere. May not be the best looking place but coming from a caboose it's a giant step up. Haire's Gulf Shrimp has relocated to a larger location with dining available. I still recommend this shrimp house over many others. I was once a fan of Lawrence's Fish House but they don't clean there shrimp & there's too much breading on them. If you haven't tried Haire's please do, I promise you'll come back again & again. They are now located on 7448 S. Vincennes Ave in Chicago.", "date": "Jun 17, 2019Previous review", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "These are the best fried shrimp in the Chicagoland area. They only sale shrimp, fries & spaghetti. Even the spaghetti is delicious. I recommend this shrimp house to shrimp lovers everywhere. May not be the best looking place but coming from a caboose it's a giant step up.", "date": "Aug 14, 2015Previous review", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "The shrimps were very good, not heavily battered. Great customer service. Friendly staff", "date": "Nov 30, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "I would drive the distance to get these delicious shrimp! Yes, they are to live for. And don't forget to get the spaghetti on the side.", "date": "Apr 15, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "The food off the chain if you have a open family member is your family that can cook still that's what this tastes like it so good make you wanna slap your mama", "date": "Mar 7, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "These shrimp melt in your mouth . They are super delicious and keep you coming back for more .", "date": "Feb 12, 2023", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Absolutely the best shrimp in my opinion.  I usually get the shrimp dinner with the spaghetti.  The spaghetti is very very small but very very good.  It's one of those things you wanna complain because it is so small but you can't because it is so good.  The bomb bags are plentiful as well.  Haires is definetly a must try.", "date": "Nov 11, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Best fried shrimp on the Southside of Chicago. Order ahead of time and just be ready to pay and pick up your order once you arrive. The shrimp are hot and taste so delish! Take it from me I'm a seafood lover!", "date": "May 14, 2021", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "Its totally worth it and Im from Louisiana.1. They clean the shrimp2. Good amount for the price. 3. No sides come with the bags4. My friends swear the spaghetti is great 5. No one from any US southern STATE EATs crackers with shrimps. If you know someone that does - please contact me. 6. I promised the elder would be in the corner. Sadly, he was not AND IT'S MY ONLY COMPLAINT.7. why not 5 stars? Cuz i don't lile writing reviews for 1 visit. My next trip will tell me if its a fluke or standard. For now... Its what i recommend and i will definitely return. Hate my bogus people just getting me here. P.S. its a flour touch of cornmeal batter as it should be just as we do in Louisiana. Not that hard corn meal crap folks use 100% of the time or panko breadcrumbs. Tf.", "date": "Dec 8, 2019", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "I have heard great things about Haire's Gulf Shrimp for awhile and always forgot to stop by! I saw this place on Chicago's best and was sold. I was out running errands with my mom like two hours ago and thought about Haire's!!!  My mom lovesssssssss shrimp so I wanted stop by. I don't eat shrimp really anymore but was still excited to try em out....We pull up, the outside has a red awning and the front door says OPEN. I step on in. The place was empty except one older gentleman sitting eating shrimp and reading a newspaper! I speak to him he speaks back. I order two small shrimp dinners that comes with spaghetti or fries. I picked the spaghetti for both and I order two large cole slaws which are only 4oz a piece. (Your meal comes with 2oz of cole slaw which I didn't know) My total was $27 and some change. I continued to take pictures of the restaurant then I asked the older gentleman was he the owner, Mr. Haire's. He replied yes!!! So I introduced myself and shook his hand. I told him people have been raving about his shrimp and that has gotten great reviews on Yelp! He smiled and I told him I heard that he got his recipe from his mom. He said he did but he tweaked it . He told me that he hoped I enjoy it. By that time my food was ready! I took it to the car and gave my mom her order and took mine. We busted it open right there in the lot! You get a lot of shrimp for a small order!! The shrimp were cooked to perfection!!!! Nice golden brown breading,(no filter on my pictures) nicely seasoned and were a nice size. The breading to shrimp ratio was perfect. They weren't fishyyyyy tasting like some shrimp restaurants are. You know some shrimp places shrimp taste like they came out of Garfield Park's lagoon...this wasn't the case here! The spaghetti was a nice hood spaghetti. Hood spaghetti doesn't have ltalian sausage it has ground beef. It was very tasty. I am not a fan of cole slaw but it complimented everything so well. With you order you get 2oz of cole slaw, hot sauce and cocktail sauce. You also get crackers on the side. That must be a southern thing. If you haven't tried Haire's Gulf Shrimp I suggest you do so!!! You won't be disappointed!!!!!!!!!!!", "date": "Jan 6, 2020", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "If you're ever around, you MUST stop by Haire's Gulf Shrimp! The first thing I love about Haire's is the free samples! As soon as I tried it I HAD to get it. I've only been twice and have gotten the small bomb bag which comes with about 14 pieces of shrimp and two sauces. One is a cocktail sauce and the other is a spicy sauce. I personally LOVEE the cocktail one. It truly adds to the flavor of the crispy, delicious shrimp. I guess it is a good thing I live pretty far from Haire's because I'd definitely be there more often than I should!", "date": "May 31, 2022", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Haire's Gulf Shrimp", "alias": "haires-gulf-shrimp-chicago", "text": "There's something beautiful about a place that focuses on 1 thing and does it to perfection. The art of simplicity at its finest is what this place is all about. You have a choice of fried shrimp or more fried shrimp. That's all you have to worry about and if you're unsure, I'd opt for more fried shrimp. It's the definition of a hole in the wall with its divey vibes of decor dating back to the 90s, but don't let the looks or the bulletproof glass deter you from what just might be some of the best fried shrimp Chitown has to offer. The bulletproof enclosure makes sense, as I'd probably want to rob this place for some shrimp too if I couldn't get my fix. Made fresh to order each time, there's no secret to that. The shrimps are juicy, sweet, and served piping hot fresh, my advice is to eat it right away. The batter is light and seasoned just the right amount with a tiny bit of heat to get your blood flowing, if it's not enough, don't worry they give you a container of Louisiana style hot sauce to add a extra bite for you spicy lovers and some cocktail sauce for you traditionalist. It's what you would expect from a no frills place that only serves fried shrimp. Don't be too caught up in the ambiance, it's all about the money maker fried shrimp. The only thing you'll regret is getting more. Stay fat mother suckers", "date": "May 30, 2019", "is_closed": false, "address": "Chicago, IL 60620", "rating": 4.5}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Was one of the first cars in the lot on a Wednesday right before opening. If it wasn't for a worker waving me to get in line I would have ended up waiting for more than an hour. This is a grab and go establishment and you WILL most likely have to wait for your food. Decided to get the JBL special to try a mix and match of what the hype is about. The rib tips and chicken wings stood out to me in terms of flavor and meat quality. I can see how this is one of the better BBQ spots in the greater Chicago area but if you're looking for a place to compete with Texas or Kansas City BBQ you will probably be disappointed. I would recommend getting the sauce on the side otherwise the thickness and strength of the sauce will easily overpower the meats. Overall, I'd say this is one of the best BBQ places in the city if you are willing to wait at least 30 minutes and drive to the south side for a meal you will most likely have to eat back at home.", "date": "Jan 2, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I'm really disappointed. The community keeps this business thriving but they seem to only be interested in the cash.  It was cold yesterday, too cold to stand  outside waiting for BBQ.  Lem's didn't have any meat ready for approximately an hour.  The appropriate business decision should have been to announce temporary closure to public. This would alleviate folks standing outside in snowy weather for an hour plus.  Clearly the entity recognizes the weather as evidenced by the ineffective heat lamps surrounding the premises.  Not only did they not do this but a guy requested to take photos of folks standing in cold to post on social media.  Really?!?FYI, the tips were overcooked, edges literally burnt beyond consumption.  Also the food tasted of chemical, similar to lighter fluid or a related compound.  Extremely disappointing!!Just to be clear, they sold NOTHING while folks waited for the meat to cook.  The policy of only 5 inside doesn't allow them to sell anything if the 5 request ribs.", "date": "Jan 1, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Still taste good. But If them hot links get any smaller they're gonna have to change the name to hot weiners instead of hot links.", "date": "Feb 12, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Rain, sleet or snow...that line is out the door! Lem's is a community staple, and the food is always delicious. Some of the best eats on the Southside. It's an express spot for takeout, but it's always busy.", "date": "Feb 4, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Great food, but you wear something warm for it for going out so late. They should set up a number system when you get there so you don't have to dig into your spot so your car warms up and you're not forced there.", "date": "Feb 14, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I just left here I been coming here since the 60's when they were on 59th & State St. There was a woman in front of me from Texas who was looking at the menu the nasty ass lady on the register told her you should have looked at the menu outside. Which she didn't know that there were menus out there. So, I said to her there's a better way to talk to people. You all want our business but you want to treat us like sh*t. She said we don't need y'all to patronize us. If we didn't they wouldn't be in business.  She also said if y'all didn't  patronize us well still have a line wrapped around the building. They young man that works there said that that itchba is the owner!!!! SMDH #TreatPeopleTheWayYouWantToBeTreatedEveryone @everyone", "date": "Jan 27, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "The entire staff at this establishment is very unprofessional, rude and drunk. Most of the time we waited over an hour and a half to get inside of the place to place an order. Once inside there was no heat, and instead they have heaters around the outside of the building. The cashier was drunk and didn't give me a receipt until I asked for one, and then act like I had said something wrong to her. I ordered a bucket of tips and a order of hot links, and neither one of them had any sauce on it. Just a bad experience all the way around.conductor Union Pacific Railroad", "date": "Feb 17, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Been wanting to check this legendary south side bbq place out for a long time. It's carry out only and you can't phone in orders. There is a small parking lot with room for about 10 cars. If you want a spot, best to arrive at least 15 minutes before they open.We arrived on a Sunday in February about 11:50am and there was a short line, about 7-8 people ahead of us. By the time they opened at noon, the line went around the building. We ordered ribs, rib tips, chicken wings, hot link, shrimp, coleslaw and potato salad.The real star of this place are the ribs and rib tips. They did not disappoint! The ribs had a wonderfully deep, rich smoke flavor and were perfectly tender. They normally baste the meats in their sauce when serving; however, since we we taking it home, we opted for the sauce to come on the side. The sauce is vinegar-based and goes great with the ribs. Love it!The chicken wings were equally good; crispy and tender. The shrimp was solid. The hot link was a bit too coarse for my taste, but I'm sure others enjoy it. The potato salad was particularly good, fresh with a hint of mustard. The coleslaw was also decent. All around, it's an excellent place to get some awesome bbq. One of the best in Chicago.", "date": "Feb 5, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Incredibly disappointed and, from what I have heard, both the food and service were far superior beneath previous ownership.The ribs were far too tough and dependent upon the sauce for flavor. While I do want to leave a bite mark, I am not looking for fall-off-the-bone, the ribs were just straight tough. It made me wonder if they were pre-boiling the ribs and causing the connective tissue to seize up.Since being there, I have been told that the hot links are the way to go but, it being a BBQ joint I wanted ribs. I wanted to see how they treated a special cut of meat but they failed.Also, while I am fine waiting in a line, I do have issues seeing a staff treat customers in a rude manner which is precisely what I witnessed with the group ahead of me. It is clear to me that this is a business relying upon it's name and history. Seeing any customer treated like that is disturbing and soils the vibe of any establishment.I will not be back.", "date": "Jan 31, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "The last time I risked my life going here for some BBQ. The food was less than mediocre. Lems used to be . Now its just surviving off of the name and past reputation. I got a lg. rib tip & some hot links. The tips were tough and the links were dried out to be damned!! Normally the worst the neighborhood the better the BBQ but Going to that neighborhood to score some BBQ in this case isn't worth it. Its no more good old school BBQ places in Chicago anymore. 1/10", "date": "Aug 20, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I was disappointed the last time I ordered from Lem. I ordered a large rib tip, and it had no barbecue flavor. It tasted like it had been pre-boiled. This happened during the New Year holiday; maybe they were trying to cut corners for time's sake, but they were horrible. The delivery service was on time, but the food was cold.", "date": "Jan 23, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "It's tasty, consistent and worth it. Each time that I come home to Chicago from South Florida, I say that I'm buying additional food to package and travel back with a container. I finished off the order l yesterday for lunch. There is nothing like Lem's. Please don't tell me about Memphis barbecue. There's no comparison. I wish that they took UberEats orders , but standing in line is entertaining because there's always one person who livens things up. The Hot links are still everything. The sauce is unmatched. No one seems to understand the importance of rib tips so they stand alone. I'll be back for more soon.", "date": "Apr 18, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "5 stars for the service received. 5 stars for the parking lot option Stood in line during good weather and they played 80s r&b. 1 star for the hotlink. I couldn't get with it. 1 star for sauce all over everything and fries are at the bottom of the JBL special under all the meat with even more sauce. Next time I know to order sauce on the side. I don't even like my food to touch but hey it worked out. I can recommend and will tell you to get the special so you can sample it all.", "date": "Sep 19, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Lem's is unmatched! My order \"rib tips chopped fine and fries\" drenched in that sauce that must have tears from angels in Heaven mixed in!! Betta getchu some!!", "date": "Sep 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I'm not sure if the food was any better when it was under the original owner. I can only attest to my order from 1-30-23. I waited outside for 45 minutes for a Slab that was awful they don't have cooks who know how to barbeque over fire charcoal. Lem's method of cooking is burning thick char on the outside of the ribs and brisket and leaving the meat to smoke inside the pit yuck. The fries were cold in the bottom of the paper tray with the meat on top and the sauce was plain just a hickory bottled type.", "date": "Jan 1, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "There's a reason the line is around the block at 11:30am in the morning! Some of the best fried chicken I have ever tasted. Links and ribs are also very good. I had my sauce on the side so I could add as much or as little as I wanted. Coleslaw was too sweet for me. We got the JBL combo, half a chicken, coleslaw, and potato salad(a bit sweet too). Meals come with a side of fries which are put at the bottom of the container. This gives them the smoky taste from the ribs which is just out of this world! I also bought some of their seasoning to cook at home. Highly recommend!", "date": "Sep 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Not good too hard and burnThe meat is not tender and the wait for the service from the worker are rule n just out date. Management don't care nothing about nothing just the money they receiving.", "date": "Sep 2, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I was at Lem's a few nights ago, and there was no line, but there were five people on the inside. It was really cold, and I got a slab with coleslaw and extra white bread. It was delicious, as usual. They never, ever disappoint. The only thing I can say that might be bad is the last time I was there they cut my meat into individual bones and I don't like that. They can cut it in thirds, because I get a slab. I like to be able to cut it in however many bones I want to eat at a particular time.  That was something new, because they always cut it in thirds. You know, like a small in a center cut and a large end. Anyway, they are the bomb! I'll be going back soon, I'm sure.  If you haven't checked them out, shame on you!  Like I said, in my other review, you can use a credit card or pay cash. There's plenty of parking in the parking lot and street parking, so go get your ribs on.", "date": "Nov 29, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Was there again tonight getting another slab of ribs with coleslaw and extra bread. I got my slab dipped twice and I had already purchased a half gallon of the barbecue sauce, so I'm straight.", "date": "Nov 2, 2023Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "This BBQ is absolutely delicious! No ifs, ands or buts about it. In fact, everything they have is good. I've been going to Lem's for over 65 years, because their first location was at 59th and State Street, on the southside. Then, I believe in 1968 they opened another spot on 75th right near Calumet Av, also on the southside of Chicago.  The exact address is 311 E. 75th St. I was at Lem's the Sunday before Labor Day this year with a friend and we stood in line for 2 1/2 hours. I wasn't mad, either. It was hot as Hades, but we endured. The owner brought Water out to us twice and the bottles were nice and cold. Today I went back and I got a slab of their amazing ribs with extra bread and a 1/2 pint of Cole slaw. I had them dip the slab twice. For me, I have to have the bread soaked in the sauce and because I don't eat spicy food I always get it mild, but the seasoning is a little on the spicy side if you can't tolerate any spice, whatsoever. Therefore, I take a bite of rib and follow it with a little bit of coleslaw to cool it down. It is so good! I don't know what they're doing, but I will never, ever buy ribs anyplace else. It's not just the sauce or the meat, it's everything. It's no-frills, absolutely delicious, barbecue.  And, the slab came with bread, but I always get extra.  Do yourself a favor the next time you want barbecue ribs and check out Lem's. You'll thank me later. So good!  The hot links are good, too. PS. And, they accept credit cards. I know for a fact they accept Visa and MasterCard.  I didn't see a sign for American Express or Discover.", "date": "Sep 25, 2023Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "OhhhhhhhhhhweeeeeeeeeeeeTalk about I was sleeping on a hot spot!! Despite having to wait outside they Food delivers!!! Service could have been better as the older lady cooking fries and cashing out need to learn to be friendly or hire someone for counter or fried... IDKBeside her attitude this place is amazing Flavors and Portion size is great for the money you pay", "date": "May 24, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "I haven't had Lem's in years, but we took the 30-minute drive to stand in line for about 30 minutes to get some awesome rib tips and hot links! I will honestly say that I enjoyed my food last night. I've previously eaten from here many drunk nights and never remembered the food being good. TONIGHT THAT CHANGED! It was fresh and hot and not dried out. The sauce was on the side, and the meat was magically delicious!!!! It was so good, I'd like to go back today! Seriously, check them out.", "date": "May 8, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Back in Chicago my hometown and my brother and I had a munch and a taste for some bbq... We unanimously chose LEM's. We ordered shrimp, center cut ribs, chicken wings, and small ends. Simply put, they were hot, juicy, and the portions were very generous. Best ribs on the south side...put this place on your visit list when in Chicago, I do.", "date": "Jan 10, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Chicagos best rib tip and I mean it classic Chicago style aquarium bbq pit, friendly people and just all around good home cooking love them and the product", "date": "Nov 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Take out only, long line but so worth the wait. The rib tips are spectacular, their sauce as well. The wings were not my thing but they were decent. The best links my husband has had my mom had the ribs. Everything is served on a pile of fries (omg) and bread. Loved it. I would try off hours because seriously the line is long my husband waited 45 minutes to get to the window and his order was ready in less than 10 minutes.Someone told my husband while he was in line,  that in the summer the line is over a block long. We were able to park in their lot but I think we got very lucky. It's a no frills location, everyone was friendly and service focused.", "date": "May 7, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Being from KC, I was very ready to be critical of any barbecue that isn't from my hometown, but I have nothing but good to say about this BBQ joint. The only knock it's getting from me is the hour wait in line outside on a busy Sunday afternoon, as there's no place to sit down inside and there seems to be a max of five employees working. As far as the food is concerned, this is legit - the sauce is rich and tangy, with a subtle hint of sweetness. A lot of food is also provided. My husband and I ordered the rib tips and center cut ribs, and we couldn't finish our meals in one setting. The sides (fries accompany most dishes, and I also ordered potato salad) compliment the meats well. Be sure to carry small bills of cash if you want to purchase soda drinks, as they only have a vending machine to purchase them from.", "date": "Apr 18, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "The ribs are tough, I just go for the hot links, the lem family owners are nice sometime nasty other times very inconsistent, be prepared to wait outside, only 4-5 allowed inside at a time. The tips taste and tenderness depend on ....welll you just gotta take a chance, you just never know, but it is so hard to find good rib joints.", "date": "Jan 8, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Lem's is definitely worth standing the long line.The food is all always good, but the links the links is it for me", "date": "Jul 28, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "Yes, the one star reviews are correct... at least rib tips. The rib tips were in fact tough, dry, and over salty. I tried it back 2015ish. I don't know what's going on but the one star reviews are absolutely true for the rib tips at least.", "date": "Nov 1, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Lem's Bar-B-Q", "alias": "lems-bar-b-q-chicago-2", "text": "The food is good. The only problem I have with them is they refuse to open up another location.", "date": "Jan 13, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.7}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "So, here we are at the INCREDIBLE \"Oooh Wee! It is\" Soulfood restaurant on 83rd South side!!!!! We just got our apps. Fried Green Tomatoes and Pot roast Dip. I gotta tell you, the sheer FLAVORFUL DECADENCE is palpable! We are not done yet, folks, for this is just the appetizer portion of the meal. Stay tuned for the main course, y'all!So, as expected, the main courses were even better than imagined. If you wouldn't mind great food, atmosphere, and service, go ahead and step it on over to OOOH WEE! When I tell you it's worth it, I mean THAT! Bon Appétit", "date": "Jan 28, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "I was excited to check out Oooh Wee it is. The Hyde Park location is predominantly closed, so once I saw a site of 90 94, I gave it a shot. The interior is fun. There are little spots for photo ops and some nostalgia with a comic book theme for the kid breakfast area. The dining area is delicate as well. There is parking, but it is limited. I ended up parking down the block. We were seated right away, but the wait staff took quite a bit to get to us. For drinks, my sister tried the Obama, which was very tasty and sweet.I got the smothered baked chicken, mac and cheese, and yams, which came with cornbread. I will note I asked for a peach cobbler but the waiter never followed up. The chicken was Barely lukewarm warm, which was interesting because the yams and mac were hot. This is a massive issue because the baked chicken was the main course and cost the most. Also, I got smothered baked chicken, and there was no gravy, and the portion of chicken was a bit small for the price. However, it was still good. The yams were a delight. My mom had pretty much the same issues with chicken. Her sides were mashed potatoes and greens, the meal's highlight. Whoever made the greens needs to be complemented. My sister got the Salmon salad, which she enjoyed. It was a substantial portion. Overall, the experience was very mediocre. The food was flavorful but was not temperature checked and took entirely too long. Other people were complaining near us about the quality of the food temperature as well. I think Ooo Wee has a lot of potential but needs a good runner of the ship to keep morale and food quality up. I would give this first experience 3 out of 5.", "date": "Oct 20, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Went to the 83rd street location on a Saturday at 1pm with a party of 6. We were sat immediately. We ordered dessert for an appetizer, which I recommend. If we hadn't, we would have been too full to try it, and it was worth it. The peach cobbler was hot, and the caramel cake was cold. Both were delicious. I had the pot roast with green beans and creole corn. The pot roast and corn were delicious. The green beans were the best I've ever had. I was surprised by how much I liked them. The meal came with corn bread which tasted a bit like cake. So so good. The portions were plenty, so come hungry. I tasted the Mac and cheese. Hands down the best Mac and cheese I have had at any restaurant. I also tried the Obama sweet tea. It tasted more like fruit punch, and I will order that for myself next time. The service was great. The atmosphere was very nice and comfortable. The bathrooms were clean and private. Will definitely be back.  *no pictures of the desserts because we ate them too quickly.", "date": "Oct 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Good food, service is not the best but not bad, customer service can improve, land l lamb chops are good, the greens remind me of grandmas lol , a place I will continue to order from", "date": "Feb 3, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Awwww man. This place is on to something with regard to Soul Food. Like most, I'm more familiar and comfortable with this establishment's sweet tea/ lemonade. Very delicious by the way. So why not give them a go for food?! Shall we... Upon entering, on a Saturday afternoon during rush time, we were sat immediately and given glasses of water and menus. From the first look at the menu, my friend and I just knew we were about to drop bank lol We ordered the fried green tomatoes, two pot roast muffins and the Hennessy wings appetizers (8 ct). For the entree, I did the fried catfish meal with gravy rice and candied yams. My friend chose the baked chicken with yams, Mac and cheese and greens. Your entree only comes with two sides; she ordered a separate side. She only chose to order the Obama lemonade. Let's get into this review now. Fried green tomatoes - love love love the crispiness, the flavor and the pinch of heat that comes with it. Wasn't a fan of the guacamole sauce to match but it's a cute touch. I do wish it wasn't as salty but what southern spice isn't? The Hennessy wings - boiiiiii this are tender! Sweet but not too much. You taste ever so lightly a smiiiidge of the liquor but you'd have to be looking for it to spot it. Pot roast muffin - wasn't a fan. The meat was lukewarm. The mash potatoes were hard and the muffin tasted sweeter than jiffy mix. Almost as if I were eating a Molly's cupcake. The gravy was the best part but I wish it were more because my muffin wasn't moist enough. Catfish meal - crispy and tender. Perf combo. Seasoning was great and different from the fried green tomatoes so that was a plus. The rice and gravy was good but again needed more gravy and the rice was under cooked. The candied yams were decent. Too many large chunks of potatoes though. My cornbread was ehhh. Felt grainy like it wasn't cooked all the way. My friend said the baked chicken was tender, juicy and flavorable. She would definitely get it again. The mac and cheese was a bit and the greens were alright. All in all, we both paid about $50 including tax and tip. That's not bad... at all. Considering other places are charging A la carte for Everything, this is a 100/100. Even the service made us feel welcomed as if we were in the south. They were quick and attentive. There was always someone within an inch reach to ask for something if you needed it.", "date": "Apr 16, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "All of the sides were amazing. I can't say the same about the fish or desserts. The atmosphere and service was nice. I think we were hearing two different types of music at one point. They have areas where you can take photos which was really cool.", "date": "Dec 21, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Ordered a catering pan of greens. They were decent but they didn't pack them properly and got green juice all over my 1 year old car! Spent a lot of money to get it properly cleaned out as the car smelled awful. I specifically asked them was the container secured before they put it in the car and they assured me it was. Called to let them know what happened, they never called back. Also, be careful eating these if you have high blood pressure. Don't know what's in them but my pressure was high after eating a small portion without any other food accompaniment.", "date": "Feb 8, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "We ordered delivery. Multiple drivers attempted to pick it up. The order was never completed because the restaurant just never made it. We waited 2 hours for nothing and ruined our evening. Absolutely do not recommend.", "date": "Jan 26, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Love the food!! I have had the catfish and the pot roast dinner and loved it all. Can't wait to try more", "date": "Dec 17, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "When I was checking in to be waited on a table, I was asked if the head wrap I had on was due to me being a muslim. This was very offensive to ask and made me assume that I would have to remove it if it was not due to religion. I did not know there was a reason needed to wear a head wrap. Not a scarf that you go to sleep in. Not to mention, their staff was at the register with a scarf on that you sleep in. As a cancer patient I was upset. They really need more training on how to enforce a policy. Still don't understand why wearing a head wrap would matter though.", "date": "Jan 28, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "2.5 hr wait for a  pick up. Nasty attitude they had no consideration for my time and acted like it was my fault for using yelp services", "date": "Feb 5, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "I had no complaints whatsoever for this restaurant. The atmosphere was. Comfortable with friendly staff. The food came quickly and the waitstaff were prompt and receptive. The food came in large servings and was delicious. I enjoyed the fried green tomatoes fried to a crisp with tangy green tomatoes in the center. I ordered the oxtail dinner which was scrumptious. The yams were unbelievably delicious and melted in my mouth. The Obama drink was tasty, thirst quenching and sweet! The restaurant was family orientated, with props for those who want to take pictures. So, dress to impress.", "date": "Jun 17, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "I tried this restaurant when it first opened and thought it was good. I'm happy to report they have not declined on the flavor. Every bite is a little bit of heaven in my mouth.", "date": "Oct 24, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "The food is really good. We had a fun server. It did take a bit long for the food to be prepared. There's still too long of a line on peak times. Eat early and midweek for easier access.", "date": "Apr 19, 2023Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "I just love this place I need to stop coming here before I have a big back... and I'm a hoe for their Hennesy wings so I'm pretty much getting the exact same thing. Every. Single time. Their cornbread is amazing I'm not even a big corn bread eater.", "date": "Jul 23, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "If you are looking for excellent food a casual atmosphere and great service then this is the place to go. The place was quite busy but we were seated quickly, and our server was a s there with waters and menus in no time.The menu boasts a wide range of items from salads to burgers and entrees. Bring your appetite the portions are huge and I saw most customers leave with Togo containers. The food came quickly and looked beautiful on the plates.The Hennessey wings were fantastic, sweet, sticky and with a touch of heat. Recommended.My wife had the turkey burger with a mountain of fries. Delicious, well seasoned and cooked perfectly.My son had the jerk chicken, macaroni and cheese and green beans. He said the Mac and cheese was off the hook.All in all a great experience that we likely repeat.", "date": "Jan 7, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Three words: worth the buzz.*footnote* I sampled the greens and no lie I think they're the best I've had outside of my mom's and grandmother's (and that bar is pretty high)", "date": "Nov 11, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Oooh Wee was Oooh Wee! Delicious from beginning to end. We started with the Pot Roast Cupcakes and the Fried Green Tomatoes (I asked for the spicy ones) both appetizers were pleasantly pleasing. Our server started a little dry at first, but perked up mid to end of meal. The decor was crisp and clean. The purple chairs did not disappoint . For the entree, I had the Hennessy wings, unfortunately I was underwhelmed with them, however, the sides were out of this world! The corn was juicy and well seasoned. The greens were succulent and tender, and the Mac & Cheese was also good. The portion sizes meet the price. The food has so much soul, it gives you the ITIS, you start looking for the nearest place to take a nap, some people pass out at the table  If you are searching for some delicious down home soul food and want to leave saying, \"Oooh Wee!\" Head South to 83rd for some lip smacking goodness", "date": "Jan 3, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "The food here is always great. When you get it. Came for sit down and sat near the back. I see take out orders flying out the door while those of us sitting just drool. We waited over an hour and a half and have yet to receive the main entree. Trying to be patient but this is a sure way to lose customers. I aim to support local businesses in my community but this needs work.", "date": "Jan 28, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Overall, had a good experience. We had the Hennessy wings and fried green tomatoes for appetizers and they were good. I had the catfish, Mac and cheese and yams. All were good except yams could have been sweeter but I have a big sweet tooth. Also had the Obama for a drink and I enjoyed it as well.  This is a new community gem.  Check it out!!", "date": "Jan 17, 2022Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Passed by this restaurant on late afternoon and noticed a long line outside. Decided that I would go on a Saturday as soon as they open for business. Good choice.Ordered jerk salmon with mixes greens, macaroni and cheese, and candied yams. Everything came with jalapeño cornbread. The salmon was cooked well enough that it was juicy without being borderline raw. Greens were nicely seasoned without being underwhelming or \"poor attempt\" gourmet. The macaroni and cheese was not bad, unless you prefer runny mac and cheese. It wasn't dry, just cheesy without being oozy. The candied yams were truth serum. I washed it all down with a glass of cucumber mint lemonade that was refreshing.Service was great. I liked that I got what I ordered without complaint and I was left to my own devices to eat without any further interruptions unless I needed something. The prices are steep, but no pricier than what you'd pay at any brand name restaurant in Chicago. Oooh Wee It Is will get my dollars.", "date": "Oct 8, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "The food is fresh and flavorful. Truly professional service..............................................tThey are updating the other side of restaurant for fine dining. Can't wait", "date": "Jan 9, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Ive been wanting to try this place since Its inception. Tried to make reservations but not able to, wallk-ins only...this started the downward spiral of tomfoolery...get to the restaurant and there's a hand written sign taped to the inside front door \"Cash Only\". WHAT?? Why wasnt this message posted on the website!!! Who carries that much cash on them to eat at these prices??? Not me!! They didnt have an atm on site so you have to take your life in your hands, go across the street to the gas station atm (a bunch of bs). We really really contemplated leaving but since we were there and I had never tried it we braved the wait and stayed. My friend tried to order several main dishes but they were sold out, so she had to settle for her 3rd or 4th choice. Again, we were ready to walk out but ... it took 20 minutes for our order to be taken in the first place, ordered our food and 20 minutes into waiting for the food, the server notifies us 3 of our side dishes are no longer available!!!! Who ever is ordering supplies and food needs to be fired immediately because they are doing a pisse poor job. We pick different sides and WAIT some more. Our appetizer came out the same time as our entree, so now its not an appetizer anymore!!The server gave us plastic utensils...WHAT??? I dont use plastic forks when I'm sitting down eating dishes costing $30...who does that?.We had to ask for real silverware to eat our meals with (so uncouth)...Why do patrons NEED to asked for rolled silverware that should be automatically be given for a sit down experience!!!! SMHMy friends sides came out cold (greens and mac & cheese) so they needed to be rewarmed. She said the lamb chops were tasty. The service was utter garbage. My fried catfish was seasoned and cooked to perfection. The yams were undercooked, so I had to swap it for green beans (which were great). The greens were terrific as well. Seasoned to perfection and tender. Fried green tomatoes were seasoned and have a spicy kick to them, unexpected, but welcomed. Portion size is more than enough. Definitely had leftovers for tomorrow. The food, if you can get what you want, is terrific but going through the BS makes me not want to come back. You have to mentally prepare to deal with waitimes; have several dishes in mind (in case they're out) and not have your mind set on one thing because you will be mad when its not available; bring cash just in case; DONTcome on a SUNDAY!!!! Too many issues to want to come back and thats unfortunate because the food is terrific. The questionable business practices, poor service, and lack of food availability overshadowed the good food (as long as its hot).", "date": "Sep 30, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Food so good makes you wanna slap your mama!!!!!!!! Sooooo delicious!!!  I ordered through Door Dash the other night  for dinner. Ordered a Buffalo wing dinner with double Mac and cheese, Pot Roast with Mac and cheese and string beans and I also ordered a large order of string beans. This was enough food for my three children and myself. The buffalo wings were lightly battered, fried then tossed in buffalo sauce. The buffalo wings were delicious! The wings were a nice size yet not too big. They were cooked perfectly! That Mac and Cheese was slap your grandma good! Cheesed up properly! You could taste the butteriness in the Mac and cheese. The string beans were down home good. They had potatoes in them too! They were flavorful!! Very well seasoned!! My only complaint was the Pot Roast! It was very good too but it would be nice if the meat wasn't shredded. I didn't have one nice hunk of pot roast it was more like shredded beef with carrots and potatoes.I don't care for cornbread and both entrees came with it. I tried it because it looked so soft and buttery ! It was AMAZING!! Buttery, soft and sweet! It was like a piece of cake! Soooo good!!! This place is the bomb! Check them out!!!!!", "date": "Apr 8, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Hands down some of the best food I have ever eaten in my life. Hennessy chicken was so flavorful that when I was done eating my kid kept scrapingthe plate and eating the sauce straight.  The mashed potatoes were the most flavorful mashed potatoes I have ever eaten. Best. Mac and Cheese. Ever! Obama sweet tea- get that. I don't even like peaches and I could not stop eating the peach cobbler. Service was incredible!! Everyone is so friendly. Ayesha sat us quickly and made us feel so welcome. Shae was helpful and so nice! Mark was so personable!! Good parking is so important to me, and the parking lot felt so safe. I cannot wait to be back in Chicago and come back again!", "date": "Oct 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "The food was phenomenal. Everything that I ate was very good. The Hennessy wings and cornbread are a must! The pot roast cupcake was very flavorful and the meat was tender. The fried green tomatoes were good and I really enjoyed the sauce served with it. The portions are very fulfilling. They also have different flavored teas. Feel free to bring your own bottle as they do not serve alcoholic beverages. The food does take some time to come out, so I do not recommend going if you are in a rush (at least on Sunday. I went on a Sunday and it was very busy) They have cute areas to take pictures by. Make sure to book a reservation. I will definitely go here again.", "date": "Jan 1, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Great food, fast service. Dinning area needs a face lift (chairs and tables/booths) ..", "date": "Jan 17, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Great food! Good service. Fine ambience. It is a nice upgrade from the usual suspects I the south side.", "date": "Jan 16, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "Oooh Weeeeee is right--the food here will having you saying that with every bite!! I came here on a Thursday afternoon for lunch with a friend and it wasn't too busy we were able to get seated right away! Trust me you'll need a nap after all this great food. The service was for the most part great. Our server Crystal was fast, efficient, often topped our glasses and check in to ensure we were okay. At times we felt rushed but, we took our time to savor the food. While I didn't order from it, the cereal bar is very cool and unique!  The FOOD WAS AMAZING! We ordered handful of things from the Hennessy wings, fried green tomatoes, mac n cheese, biscuits and shrimp and grits. All was served fresh, with great authentic taste and rich flavor. So so good. My menu highlight was the fried shrimp and grits. Shrimp were fried toperfection the cheese grits mama gravy had bold flavor and great taste. Also the portion sizes were pretty big, again enough to have you needing a nap afterward. I love the food here and I am thrilled to get back. This will be my new shrimp and grits go-to!", "date": "Aug 3, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Oooh Wee It Is", "alias": "oooh-wee-it-is-chicago", "text": "A friend of mine recommended this place because he knows I like ox tails.  I have had them prepared many different ways but never smothered.  I must admit, this is now one of my favorite ways that ox tails are prepared.  The meat was fall-of-the-bone tender and very flavorful.   For the sides I did the rice with gravy and the green beans.  Gravy was perfect and the slow simmering really made the flavor come through.  Green beans were very tasty.  I could probably eat a bowl of just the green beans. The service was great.  From the moment we parked in the parking lot, a very courteous woman welcomed us and escorted us to our table.  The waitress was fast and the food arrived even faster.  A++", "date": "Mar 4, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.5}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "So gooood I loveee them very yummy. I feel like this the best donut place I ever been to since I was a kid.", "date": "Jan 22, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "This O.G. donut shop is classic, charming, and delicious. The only thing you'll find here are no nonsense, no bullshit, perfectly cooked donuts that make you feel good inside and out. If your feeling adventurous is the giant glazed donut bigger than your head.This shop has not fallen prey to the artisan donut trend which is more show than dough. It's just a classic delicious donut made with pride.", "date": "Sep 20, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Although I appreciate the treats I get here periodically, I would pay a premium for better quality ingredients. I  like the big dat for what it is, indulgence. My wife likes the lemon cake doughnuts too. However, dark chocolate or ganache is better for the body and taste buds than the cheap milk chocolate. No shade 'cause this is a good shop but it can be better.", "date": "Jan 23, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Good quality doughnuts at good prices. I kust wish they could be more efficient in their service. I wish they could take medium orders by phone and have them ready to pickup so I wouldn't have to wait in line while having to commute to work.", "date": "Aug 29, 2021Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "One of my favorite places in Chicago to grab donuts. They have perfect flavors and a lot to choose from! It's a small store, but they are connected to a BBQ joint. Black-Owned. The service is kind and fast!", "date": "Jan 31, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Great Donuts too, Only if you can't get to Old Fashion or Dunkin! Laughing Out Loud.....", "date": "Jan 26, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "These were my go-to donut shop in the community for All my meetings!  They had my orders ready on time and correct!", "date": "May 23, 2020Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "NO BIG DEAL, Although you do get a chance to see how they make the donuts or at least shape. I brought a dozen of the glaze donuts and 1/2 dozen jelly roll . They were cheap on the jelly The glaze donuts were very oily .Staff are very nice. But the product itself, I was not at all impressed.....SCM", "date": "Dec 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "I like it's location and the donuts were fun. It is connected to a bbq joint which used to be Leon's back in the day. The staff were happy and pleasant.", "date": "Nov 13, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "The DAT Classic Hoagie Sandwich is Taurus Flavor (RIP)!  There, I said it!  Delicious!!!  Please offer extra meat!", "date": "Jan 15, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "The donuts  are great!!  The recipe hasn't changed over the years, so good and I love them.  I roll on the floor every time I get on out of sheer happiness.  Too good to not go!!", "date": "Dec 16, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Tastiest donuts in the world, they added some really good hoagie and steak sandwiches. The donuts have always made fresh, the old-fashioned way. So good, you can't eat just one, you can't eat just two, and you can't be on a diet when you go and get them.  They have been making the donuts, the same way for years, nothing has changed, and that is a good thing.", "date": "Dec 23, 2022Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "The breakfast sandwiches, coffee, donuts are always a hit. The staff is fast and friendly.", "date": "Dec 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Great donuts and always fresh. Can't say enough about them. They need a bigger establishment", "date": "Sep 26, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "I love this service and the donuts are delicious I give it a billion stars! Yayyyyy Dat Donut", "date": "Aug 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Excellent mom and pop donut shop. Southside staple for decades. Made fresh throughout the day. You can see the baker rolling out the dough and cutting out the donuts. It's pretty cool. My favorites are the buttermilk donuts and the old fashioned cake glaze. Best in the city!", "date": "Oct 31, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Super consistent and always fresh! I have never been let down by Dat Donut!  Service is fast and friendly!", "date": "Oct 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Only two real donut shops on the Southside of Chicago.   This is the first one.  You wont be disappointed.Big Dat deliciousBBQ Next Door", "date": "Oct 19, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Very fresh and delicious pastries.   Friendly and  courteous staff. Service with a smile each and every time I frequent this establishment", "date": "Oct 6, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Very good donuts! The largest long john donuts I've ever had. Went on a Sunday late in the afternoon so many of the popular donuts were sold out. The strawberry glaze was delicious has real strawberry pieces in it. The lemon and coconut absolutely delicious. The two ladies behind the counter were so friendly and helpful. The smoothies were delicious as well. Would definitely go back much earlier to try that big donut and all the other flavor's especially caramel.  Downside nothing to do with the donuts but outside in the parking two homeless women begging for money. They come to you right after you step out of your car. Don't let them stop you from getting these donuts.", "date": "May 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "I've been coming here since I was a little girl for the famous big donut.. however I moved out of the city due to the violence. Today I just so happened to stop by for a donut, noticed they now sell hoagies so decided to give it a try. I am soo happy I did! My hoagie was perfect! Presentation was a plus! They weren't stingy with the meats! Everything was fresh! Had extra oil as I requested. Ms. Antoinette and the other ladies were soo nice and welcoming. I even called them to let them know how good it was, they took time out of  their busy day to answer and still remained polite. I will definitely be back. Thank you", "date": "Aug 20, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Very fresh donuts daily. Good selection.Very friendly counter staff.Will come here again.", "date": "Mar 17, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Everything here is good. Doughnuts  breakfast sandwiches , just delicious and I have never had bad service here. Highly recommend!!", "date": "Mar 16, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "I didn't care for the taste.  No butter or butter flavoring seemed to be used,Just dough and sugar.  More butter really needs to be added.", "date": "Apr 9, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Donuts are fresh and their workers are so polite & kind. It's not a place for you to sit and eat but the atmosphere is friendly.", "date": "Sep 7, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Great place . Good food. Authentic Chicago Cuisine. I like the Apple Fritter. It's a classic", "date": "Apr 19, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Very interesting set up. This donut shop is inside of a building that is another restaurant. It was confusing pulling into parking lot. Once inside you can see the donuts. We tried several different donuts. My favorite was the lemon. It was just like a lemon cake, very moist and super tasty. I also had the double chocolate which did not disappoint either. This would be a great place to stop to grab donuts for the family. Many flavors to choose from.", "date": "Jul 25, 2021", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Big Dat is the best donut I've had its bigger than my head the service is the best but i haven't been able to het enough", "date": "Feb 27, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "I love their donuts and the flavor choices! And it happens to be next to an awesome barbecue joint!! I only go for the donuts because it's the only thing fresh there!  Coffee isn't good quality and I'm not gonna be bold and try anything else!! Donuts are enough for me!!", "date": "Feb 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Dat Donut", "alias": "dat-donut-chicago", "text": "Great doughnuts and some of the best vanilla roast coffee I ever had also the staff is very friendly and the service is very fresh", "date": "Mar 9, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.4}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Brown Sugar does a great job on all my cakes especially couple of cakes were very dear to me. Special thanks to Ms. Shonda!!", "date": "Jan 20, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "NOTE: the website says the place opens at 11, but it opens at 12!' On a chilly Sunday morning in the beginning of December, I came an hour early by accident, and the line was already forming from church goers and pastry enthusiasts.I got: the caramel, carrot cake, German chocolate cake, lemon cake, rainbow sherbet cupcake, red velvet cupcake, caramel cupcake, turtle cheesecake! Tip: This is not a place to do work. There is no seating. You come in, buy, and leave. That's it! This place is close to great savory spots like Lem's Bar-B-Q, which also doesn't have seating. Bring a car if you don't live nearby.The most popular cake is caramel! Vice-President Kamala Harris had the German Chocolate. https://civicengagement.uchicago.edu/news/small-business-spotlight-brown-sugar-bakery-hits-the-sweet-spot-between-homey-and-gourmet#", "date": "Dec 3, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I have been a long-time customer. Back when the strawberry cake had real strawberry specks and cream cheese in the frosting, serve in huge slices in a Styrofoam container.  It was just delicious and addicting. For any special occasion, Brown Sugar would be...my go-to bakery. However,  I'm disappointed with my last order.  I placed an online order for a 4 layer chocolate cake for my daughter's birthday.  Unfortunately,  my husband fell ill... and picking up a cake was the last thing on my mind.  So, plans were postponed, and I had to ask my daughter to pick up her own cake. It was definitely my fault that it was 3 days late. Nevertheless, when she got to the bakery... she was informed the cake was disposed of... since there was no timely pickup (no reminders or calls received). Life happens, and we have to show consumers who patronize our businesses ... some empathy.  Maybe a credit, refund, or something.  Not to just ...suckup the $65 loss.  What a great way to start off the new year!", "date": "Jan 12, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I've heard so many great things about brown sugar bakery. Unfortunately, I was disappointed on my first visit. I went on a Sunday afternoon. There were no other costumers so service was very quick. I had the caramel cake. The caramel frosting was delicious but the cake didn't seem fresh. I ate the frosting and threw away the cake.", "date": "Dec 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I was told about this place and couldn't wait try it. The staff was fun and friendly, the cake was so good !!! I can't wait to come back and try more !", "date": "Feb 17, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Happen to be in this Chicago neighborhood on the same day that the owner annouces she is building a candy factory. In tribute, I stopped by and grabbed some treats.  Owner Stephanie Hart has transformed her new manufacturing facility to expand Brown Sugar Bakery-Chicago  it the ONLY Black woman-owned chocolate manufacturer in the US.Couldn't be happier to celebrate her recipe to success today and partake in some goodies. On this occasion, I stuck to cupcakes so we could try a few versions. Classic Carmel, Red Velvet and Chocolate/Carmel Cupcake. Hands down that carmel is fabulous. 5 out of 5 stars!!! I would rate the vanilla cake 4  out of 5. I felt the cake was drier than I would of expected but still good just not great.  The red velvet cupcake was delicious and very moist. On my next visit will try the Obama cake. There was just too many options so I stuck to cupcakes. Next time will try the pies, bread pudding and slice of cake. This bakery is known for holiday orders so if you want one...order now. Every year that I have lived here they sell out.", "date": "Oct 26, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I was visiting my man in Chi Town and he took me to Brown Sugar Bakery and what a wonderfulexperience! The best butter cookies this Cali gurrl ever had! The cupcake was delicious too but when I visit in a few eeeks I'm definitely trying the Carmel cupcake. Great customer service and very helpful because there's so much many delicious pastries to make a decision- I wanted them all...lol. The owner was very sweet! The ambiance gave me that old school feel and sense of community that I grew up in Los Angeles - felt at home. Very immaculate.  I'll be back in two weeks and looking forward the Carmel cupcake... Anyone visiting from out of state you have to treat yourself to some Brown Sugar. Happy Yelping!", "date": "Oct 30, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "My uncle brought me a piece and I had the chocolate cake...as a person that isn't a chocolate cake fan...it was BUSSIN. The cake was so moist babyyyy. It wasn't overly sweet at all & literally melted in my mouth. Imma have to pull up one day. I give the piece I had a 10/10 and makes me want to try more!", "date": "Jan 12, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Not at all how it used to be. The cakes and cupcakes taste bland and artificial. The crumb on the cake is not moist and soft but dense and dry.  Today I bought three different flavored cupcakes and ending up throwing them all away. I'll stick to grocery store desserts; at least those are cheaper for a low quality treat.", "date": "Feb 18, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Love the cupcakes. Carmel is my favorite but others are great. Only negative was the pineapple/ coconut, it was a little too artificial tasting.", "date": "Jan 28, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Today was my first time coming here. I've heard good things about it for a while and had been wanting to try. We decided to try the famous caramel cake slice and also a strawberry cake slice. Each slice was six dollars.I thought the strawberry cake slice was delicious, the cake was a good texture and I really enjoyed the strawberry frosting flavor. It did taste homemade. It is a little sweet so you can't have tons of it at once, but it's very good.My fiancé preferred the caramel cake slice, it was also very good. The caramel kind of tasted like a buttery caramel and the cake also was a great texture. I would definitely stop by again to try the banana pudding and cobblers.", "date": "Aug 23, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Once you have conquered street parking, get ready for a sweet visit. Nice clean bakery; cupcakes, cake slices and other baked goods tempting you to taste. Friendly associates eagerly awaiting your purchase. Finally decided on buttery caramel slices and tropical pineapple coconut. Moist deliciousness in every bite.", "date": "Apr 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I've been this bakery several times and consider it a staple.  However, if you are going to have an online ordering system, please ensure that it reflects what is available.  I placed an order for a slice of strawberry cheesecake, received a confirmation just to drive 30 minutes and determine that it wasn't available.  I placed the order several hours in advance.  I can understand that items may or may not be available.  I would at least have appreciated receiving a phone call once the order was received to be filled informing me. I show up during my scheduled pick up and the reps are completely unaware of my order.  They then inform me that strawberry cheesecake was unavailable today! They did offer me another option, so thanks for at least doing that.  I opted for a refund.  Pretty disappointing experience. Please do better!", "date": "Nov 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I stopped in to grab a birthday cake. I've been wanting to stop by and get some for a long time. While I remember the cake to not have the white icing on the inside, that seemed new. I wasn't a fan of the white icing and my cake didn't seem as fresh. The cake was still delicious but I'd be completely dishonest if I were to say it met my expectations of my nostalgia from years ago. The actual cake also didn't seem as light as how I remembered, was very thick. I'm optimistic that maybe I just went on a bad day? However I'll always support this bakery. I'll certainly be back. The customer service was friendly. There is street parking and for a whole cake it cost $40. They do have cake by the slice and cupcakes for $5.", "date": "Jun 30, 2022Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "They have delicious Carmel cake. They even made my daughter a birthday cake last minute. I liked the customer service and the pastries are good, I just thought the frosting was way too sweet on the one cake we got. . But it's a business worth investing in. I love them", "date": "Sep 20, 2017Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "This is probably the BEST bakery in Chicago! Their baked goods are always tasty and fresh and the customer service is always great. The employees are always helpful and patient with their patrons. My favorite is the carrot cake cheesecake- it is soooooo good and I am obsessed with it. Their red velvet cheesecake and red velvet cake/cupcakes are delicious as well. This has become my favorite bakery in the city and I always have to visit when I'm in the neighborhood.", "date": "Jan 4, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Have been meaning to try this black owned business for a while but live so far away and their navy pier location closed! Luckily they were doing a pop up for Juneteenth at Nordstrom. All of their cupcakes were so good -- especially the German chocolate cake! I also got a slice of their caramel cake which is their speciality but it was a little too sweet for me. Hopefully they will do more pop ups downtown / on the north side!", "date": "Aug 4, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Two stars because here is a lot of hype about their cakes and the signature brown sugar cake, that might have the potential to improve. It looks good, but it disappointed. The cake was dry, the icing was sticky and sickly sweet. The person waiting on us, was not friendly while not rude, simply uninviting. We got a cupcake and a couple of pieces of cake, it was not worth what we paid and did not even finish eating the cake and threw out the cupcake.", "date": "Dec 4, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "The cupcakes are fantastic. I am not a big cupcake person because they are usually dry and have too much frosting, but these are fantastic. A good friend bought some for my birthday, peach cobbler; German chocolate; turtle; caramel; and salted caramel", "date": "Nov 19, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I've always wanted to come check out Brown Sugar Bakery after seeing them featured on Black People Eats a few times, so when my friend said she wanted to come I was like I'm down. She also works down the street at the hospital, so I was able to meet up with her during her lunch break. She had a slice of caramel cake, and I ordered a chocolate and a red velvet. We both agreed that the cake is a bit sweeter than what we're used to. Everything looked delicious, the slices are very generous and rich, and I ended up giving the red velvet slice to my partner which they appreciate and loved. They normally finish everything in one setting, and this cake definitely wasn't because it's rich. They also provided us with utensils which made it easier for my friend and I to share our slices with one another. There's limited street parking here, and it's definitely first come first serve. It being sweeter than what I'm used to is not a deal breaker, but I would love to see them come out with something either sugar free, less sweet etc for folks who are diabetic like my parents, for example -- it'll allow for more customers to support and see what the hype is all about and also make it more inclusive where anyone can enjoy dessert. I do recommend this place to anyone in the area looking for dessert, they've been around for decades, and you'll have to come see for yourself what the hype is about.", "date": "May 27, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "The Caramel Cupcakes are EVERYTHING & The cheesecake is amazing. They definitely have beautiful cakes", "date": "Jun 18, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I went to Brown Sugar Bakery yesterday 10/18/23 and bought a 4 layer caramel cake on the fly, wanted a 2 layer cake but this is all they had. Pros: the cake was moist and it had decent caramel on it. Cons: The employees were straight and to the point, very direct and not welcoming. But they were young so, I see it. The cake had this terrible white icing on it. I guess to keep the layers together.....terrible. We use to buy cakes from here years ago maybe 10 or more years ago. The caramel icing was thinner sticky and delicious. This caramel was regular. The type you get from any bakery. The back part of the cake with the odd white icing was inedible. I would be okay if that white icing wasn't there. Plus the icing around the sides of the cake wouldn't stay on when you cut it.", "date": "Oct 19, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Very, very impressed with this bakery. Their cakes - whole and per slice - are insanely big but more importantly, very good and moist! I typically don't like caramel, but their caramel cake is astonishingly good. I also can confirm that their very rich turtle cheesecake and banana pudding are excellent. I was able to order a full cake online, and it was ready at the time requested a couple of days later. I definitely plan on coming here for any future cake purchases.", "date": "Apr 18, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Love to support a Black Woman owned bakery that has DELICIOUS sweets! The vanilla and caramel cake is just so good and reasonably priced! The owner is also so nice and there was excellent customer service. Can't wait to go back and try more!", "date": "Feb 23, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Since my review, I was contacted and a reasonable explanation was given, along with assurance's that this incident was not meant in the spirit in which it was received.  I still love Brown Sugar Bakery, they save me every holiday, cause Im not a baker.  The sweet potato pie was chef's kiss.", "date": "Dec 17, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Horrible customer service. I've been coming here for 7 years and the two women that were at the counter today were absolutely horrible. I tried to place an order for my daughters first birthday, and the woman assisting  me was as extremely rude and unprofessional..... She rushed me while placing the order did not care if I followed through with the order or not. Literally will not be coming back again.", "date": "Feb 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I pre-ordered a cake for Thanksgiving and experienced the worst customer service in my life. I called to confirm my order, only to be hung up on a few times. When a lady finally answered the phone, she said they were closed for business and hung up on me. They were in fact not closed as they were posting pics and videos on the Instagram (I called during the business hours shown on their website). When I went to pick up my cake, apparently they told me that the pick up date was incorrect, even though I showed up on the day and time I selected on the online form. They ended up making extra cakes and was able to give me my order but were extremely rude and made me feel like they were doing me a favor even though they messed up. It was the worst experience I've had ordering from a Black-owned business. This will be the last time I order from them and I will also be telling my network to not support their business. They need better customer service. They are very rude people.", "date": "Nov 23, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "Addicted. Why did I ever try the pineapple coconut cake? Dare I even start on the german chocolate cake, and you know caramel is an automatic option for me. My order: a slice of caramel, pineapple coconut, and german chocolate. I try to eat a slice a day but usually don't make it to the third day. The cakes are simply delicious. ‍.", "date": "Feb 6, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "A few weeks ago I stopped in for a slice caramel cake that was of pre-cut and sitting in their refrigerator. I saw the review of their new cake style; crossed my fingers and hoped my experience was better. After letting the cake thaw/come to room temperature, it was fine. I decided to go back Friday 11/16 for a slice of caramel cake. Yeah, I'm not going back. This time I purchased the usual caramel cake and decided to get a slice of lemon cake as well. Checked-in and got a free red velvet cupcake(fat), and while the cupcake was delicious(and not refrigerated), the caramel cake IS NOT GOOD AT ALL(yes I'm yelling!). It has to be stale, and the lemon cake doesn't taste like lemons at all. Possibly vanilla to be honest. Ugh. I let the caramel cake thaw/get to room temperature and decided to eat it but it's HARD! I thought my tastebuds rejected the cake but I soon realized the frosting is stiff! It's not soft or smooth at all. AT ALL! My caramel cake experience is over. I'm good! Real quick: while I was there a few weeks back, I saw them rearranging the cake slices in the refrigerator and noticed one young lady looking at the bottom of the cake packages, so I did that after I tasted the cake and what do you know?: My cake has a date of 11/16. I'm guessing that's the expiration date. It has to be considering the cake taste; *side-eye*. Not cool at all. Bad cake=bad business to me!The employees were pleasant and informative; too bad the cake wasn't as good(yeah I'm bitter about that cake!)", "date": "Nov 17, 2018Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Brown Sugar Bakery", "alias": "brown-sugar-bakery-chicago", "text": "I was craving caramel cake yesterday and found this bakery after searching yelp for \"Caramel Cake.\" I walked in and was greeted by a friendly worker who I shared something in common with. I mentioned it and we laughed. I then checked-in and got a free cupcake! Yay!! German Chocolate to be exact and it was delicious!! It's larger thank your average cupcake too. I remember as I left the bakery thinking I should get another slice of caramel cake but decided against it. I am living in regret as I sampled the cake and it hits the spot!! I am gonna eat the rest tomorrow as I'm preserving the fat girl in me. Real quick: I remember the container she pulled out for the slice of cake and thought that it would be too big for the cake (it was like a large carry out try from a restaurant! ), until I saw what I came for! Yes Lord! The size of the cake and cupcake are larger than you would get anywhere else, and cheaper as well. This will most definitely be my go-to spot when I'm craving dessert goodness! As I was leaving, a lady mentioned how she purchased a whole caramel cake for her friend! If I only had friends like her. You have to check this place out as you will not be disappointed!!", "date": "Jul 29, 2017Previous review", "is_closed": false, "address": "Chicago, IL 60619", "rating": 3.9}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "The food was amazing! The biscuits were great and would be amazing in one of the sandwiches!  During breakfast the service made sure our coffee and water were full and asked if we needed a refill. It was bustling on a Sunday morning!  It wasn't loud though we carried on a conversation at our table and could converse easily.It's a definite must for breakfast.  Might need to go back and try lunch!", "date": "Dec 3, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Gotta tell ya, been trying to come here for a while. The parking is iffy. I came during the week in the morning and was served right away. Gotta say it's very spacious.  HOWEVER, in spite of it hardly being no one there, my guest and i waited almost an hr for food. The server was.phenomenal.  but the wait on the food was to long. That said, it was some of the best catfish I've had in a long time. This was its saving grace. My guest thoroughly enjoyed his meal as well. Biscuit was large and fluffy. The portions were HIGE. Who eats all that food........wow!All in all...outside of the wait, the server and food was very very worth it.", "date": "Oct 7, 2023Updated review", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Gotta tell ya, been trying to come here for a while. The parking is iffy. I came during the week in the morning and was served right away. Gotta say it's very spacious.  HOWEVER, in spite of it hardly being no one there, my guest and i waited almost an hr for food. The server was.phenomenal.  but the wait on the food was to long. That said, it was some of the best catfish I've had in a long time. This was its saving grace. My guest thoroughly enjoyed his meal as well. Biscuit was large and fluffy. The portions were HIGE. Who eats all that food........wow!All in all...outside of the wait, the server and food was very very worth it.", "date": "Sep 29, 2023Previous review", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "the food was hot and tasty and service was as quick as could be expected.Sorry n pics but O smashed as soon as it hot the table.. I had plenty to take homei had a western scramble with grits that were cooked right and nice big fluffy biscuits. and good coffee. I ordered extra bacon which unnecessary because the scramble was loaded with meati made a biscuit bacon scramble for breakfast tomorrow ! wii slow a pic of it nice neighborhood spot in newer clean building.waitress was humping so they may need a few moreEveryone around me said they enjoyed their food too so that's the thing.", "date": "Sep 13, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Pretty nice place. Waffle was great. Skillet was ok but was a little light on the steak. Overall a good experience. Waitress was very nice.", "date": "Feb 7, 2024", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I visited Daleys with a group of around 10 people, as we often do on Saturdays after our group sessions. We waited about 12 minutes to be seated, which was understandable given our large group and the need to set up tables. Once seated, our waitress, an older woman who was soft-spoken, took our drink orders. While she was kind and helpful, she seemed overwhelmed by our group size, as we had to repeat our orders multiple times. I ordered a build-your-own skillet with veggies and egg whites, along with a side of catfish, which I was willing to pay extra for. However, the catfish was not brought with meal, and instead, there was ground beef or turkey in my skillet, which was disappointing as a pescatarian/vegetarian. I did have to wait about about 10 more minutes for them to bring the fish out and sent my other skillet back telling them that I no longer wanted it anymore since it included the meat in it, which I specifically  asked for not to be in it. The issue was promptly resolved, and the catfish was removed from our bill. Unfortunately, I never received the biscuits that were supposed to come with my meal. Overall, while Daleys is a great place to dine, I don't recommend it for large parties unless they have multiple waitstaff available. My first visit was better than this one. I suggest keeping your meal simple to avoid complications, especially if you have dietary restrictions. Despite the issues, the decor is lovely, with portraits of famous African-Americans adorning the walls, and the ambience is inviting. If I return, it will likely be with a smaller group, no more than four people.", "date": "Feb 10, 2024", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "One of my good friends treat me here for a belated birthday brunch. Located on the Southside of Chicago. We were lucky to quickly be seated at a table. The server came over to our table with a pitcher of water. Filled our glasses up with some cold iced water and was ready to take our order. Now this is what I call fast service. I heard this place started off as a small diner across the street. It has now grown and has a spacious dining area. I ordered the spicy Denver Skillet, diced hot links and ham with green peppers, which came with oninons and topped with pepperjack cheese. It had just enough kick of spice to it. Very tasty and well-seasoned with 2 slices of toast. My friend ordered their famous Southside Skillet, homemade turkey sausage, green peppers, onions topped with cheddar cheese and a biscuit. The food, experience, ambience, prices of the food, and great customer service. Will always keep customers coming back for more.", "date": "Aug 10, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Stopped here for breakfast on my way leaving Chicago, and I really enjoyed this place!1. The restaurant was clean, which is always a plus!  It was really spacious, so I wouldn't be too afraid to come on a weekend when breakfast is likely to be busy. Also,  the historical paintings and prints on the walls really set the comfortable, home style vibes for this historically black restaurant. 2. The service is great and intimate. Everyone was super sweet, they were engaging with us like old friends and not just as customers. I can tell this place is use to getting a lot of repeat customers, and I'm sure most of the community is like family to them.3. Food was delicious of course! I was really happy to have my food come out hot and exactly how it wanted it. It came out quick too, which is always a huge plus ! Also, the menu is massive! There were so many great breakfast/brunch options and I wanted to try them all!I definitely will return here on my next visit!", "date": "Jul 14, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Whew, where do I begin? Came here to get breakfast and really wish I hadn't. We entered the restaurant and placed our name on a list. We were told the wait would be about 5 min, which it was. We were seated in a booth and everything pretty much went downhill from there. We all ordered coffee and about 25 min later the waitress dropped off one cup of coffee. We asked where the coffee for the rest of us was, and the waitress replied, oh you ordered coffee too?Are you kidding me?! Strike one! You heard us order coffee and said ok! About 10 more min later the coffee for the rest of the group arrived. We didn't have enough cream so had to ask for more. That also took a long time to come.  Also they don't have any flavored creamers just plain. Our food came out after waiting for quite some time and let me say it was subpar. It wasn't worth paying for. The bacon was drenched in salt. The grits were rubbery and the eggs were not cooked properly. The pancakes were edible but even that I only ate a few bites. We needed more butter for the table, and the waitress finally brought us like 20 small butter packets. Why on earth she thought we needed that many is beyond me!Terrible way to start my first meal of the new year !After a while we asked for a refill on coffee. Should have known better, but the refill took 20 min to come. How does it take that long to refill a cup of coffee?   Did they have to go get the coffee from another establishment?Finally as we were getting ready to leave, a different food runner comes to our table with another tables order. We said oh that's not ours, as it was pretty clear we had just finished our meals and had the check. She goes oh are you sure? Yes, honey I am sure that's not my order! I mean really... What in the world?The pros:The coffee was decent even though it took an eternity to come.The music playing in the background was nice.It was easy to find street parking close to the restaurant.Nice chandeliers for the interior decor Needless to say, I won't return and the food was just gross. Do yourself a favor and skip this place.", "date": "Jan 1, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "When I think about a good Black owned establishment - I think Daley's! Me and my wife went on a Saturday morning and were able to be sat immediately. The food was amazing and the steak skillet was  it was a huge portion also. All of the food we ordered was great! It felt like home and very cozy on the inside. While we ate, 80's and 90's R&B music played and it was great. This is a place I will definitely recommend to family and friends who come to town for a quality Black owned experience.", "date": "Oct 8, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "So, I have eaten here a few times on Saturdays with colleagues from work. This time however, following a minor procedure at the University of Chicago hospital up the street, I was absolutely famished. I did not want to wait for an hour to be seated, and much to my surprise we were seated in a booth right away. Our server (Karen) was a very pleasant woman, very polite, knowledgeable about the menu and prompt with the water and coffee refills! The food was as I recalled - good food, not overly greasy, served all together and it was all still warm. I thoroughly enjoyed my traditional breakfast -- eggs, hashbrowns, pancakes, bacon & sausage -- but my wife raved about chicken and biscuits. This is not located in the safest neighborhood in Chicago, and I certainly would not travel out of my way to dine here, but there is no doubt that I will return to Daley's Restaurant.", "date": "Jun 12, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Historic \"Daley's\"!! Get absolutely ANYTHING on the menu. Everything is ahhhhmazing! Trust me! **that's it. that's the review**", "date": "Jun 14, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "This chicken has a lot of Season salt, my chicken was old. I opened it. It was just the meat wasn't even white. The sweet potatoes definitely out of a can macaroni, so watery. It's not even home made. They said it's made in-house. Yeah, cheese sauce and noodles, horrible cornbread horrible. The greens was good but salty overall. I will not recommend this place. I will never patronize this place. I am so Disappointed i'm opening up my chicken now is definitely left off. I'm so disappointed I spent up at thirty dollars. I give this place a 1/2 a star. I work with not recommend. I should have went to pearl's luella's or soule As recommended", "date": "Jan 5, 2024", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Great place for breakfast. Love the coffee and the service. The ambiance is welcoming", "date": "Dec 22, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "A southside staple. I enjoy meeting friends here for breakfast. ‼DO NOT PARK IN THE LOT BEHIND THE BUILDING‼I was surprised that there was not wait on a Saturday morning during my last visit. I was tickled when I sat down at our booth that there was an employee dozing off at the back table. One of his co-workers came from the kitchen looked at him shook his head and said \"man wake up\". It didn't bother me because it Daley's, it's the southside, I was just happy the man made it to work...he was trying. The coffee was good, the salmon cakes were good, the toast was good (I know it's just toast but eating toast is a treat for me because I don't buy bread), the fried chicken was cooked and seasoned well, the pancakes were great, the eggs were a little cold and too runny, the grits were flavorless and stiff (nothing a little chicken broth and heavy cream won't fix...if anyone reads this). All of which came out timely by the employee who told Mr. Sleepyhead \"man wake-up\". Our server was slow but sweet & personable, kinda reminded me of my great-aunt. The folks at Daley's will make you feel like family. Can't wait to go back and chop it up with friends over a decent meal.", "date": "Mar 26, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Great food service and ambience. An upscale diner w comfort food. It's near where I work and I'm looking forward to coming back and having work meetings here too.", "date": "Sep 5, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "This is the type of spot where they call you honey, where they're genuinely happy to see you, where they play Motown and oldies, and where you feel like you've been thrown into another time. Daley's has a lot of history attached to it, and you can tell from the photos that line its walls. What a treasure to find!I tried the salmon patty breakfast. It was tasty but I'll try something else next time I go. The homemade biscuits though were warm, wonderful and definitely homemade!", "date": "Jul 5, 2022", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I'm sure I reviewed this restaurant before and it's still amazing.  The service is excellent.  The food is delicious. I had the waffles and chicken wings. My friend has a basic breakfast and gave me the hashbrowns. They were delicious. I've never been disappointedI recommend Daly's to anyone traveling to Chicago. Parking a little crazy but worth the efforts.  COVID protocol, mask worn by staff, hand sanitizer on tables. I loved", "date": "Sep 4, 2021Updated review", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I was surprised by the exceptional service. Karen was attentive, spent time explaining the menu item and made great recommendations. The place is the bomb. Beautiful, welcoming and open for great gatherings, conversation and just to network with others in the community. The reason you are probably looking at this review is for the food. The food is delicious, abundant and definitely made with love. My waffle tasted great and the chicken wings were cooked perfect and seasoned well. I struggled with my meat selection as for the first time there were more options than bacon, sausage and chicken. I highly recommend trying this place out. I don't think they fooled me. I'll be back again when I visit Chicago.", "date": "May 16, 2019Previous review", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I really enjoyed the food(chicken sandwich is on point), the service was good just a little slow. The ambience is great. Family oriented.", "date": "Mar 31, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Daley's was my normal weekly place for my Saturday or Sunday brunch.Over the years there have been concerns regarding the service levels have ebbed and flowed nevertheless myself and my friends would still frequent the restaurant.That ended on Sunday when I arrived at Daley's it was a full waiting area of people. No less than 30 people waiting.We were seated within 15/20 minutes in Ms. Barbara's section. We placed our orders after 15 minutes of waiting. Because brunch included my friend that I have not seen since before Covid, we fell into a long conversation and forgot how we were waiting. After more than hour of waiting for our food:One Daley's SkilletOne Turkey Based ScramblerOne Porkchop DinnerThe waitress continually told us that she was checking on the food and letting us know there was no food. At this point my cousin goes to the front and ask what is the issue with our food. The server at the register notified the manager of the concern, at the same time the waitress also notified the manager of the issue as well. The manager comes over to the table and asks AGAIN as if we have not made it clear that we haven't received our food. She goes to the back and suddenly ALL of our food comes out-- my food was not hot--lukewarm at best. The assistant manager came over gave us her word that she would take care of our table-- after calling my cousin by her first name-- so we finished our food. While sitting there the manager June comes to our table excited to notify us that she took care of us-- she took a whopping $10 off the bill. Ten. Dollars. Thats it. Nothing additional. When my friend and cousin went to the register the assistant manager attempts to adjust the bill for a real discount. June LOCKED THE BILL. SHE LOCKED THE BILL TO PREVENT THE OTHER MANAGER FROM GIVING ANY ADDITIONAL DISCOUNTS. At this point June is watching and acting like she did something amazing. I waited until today because I wanted to be sure that I am not reviewing emotionally. The service is not consistent enough for this type of treatment of customers. To give someone a funky $10 after waiting for an hour?!?Disgusting. They had a regular weekly $50+ customer. Now they have the memories. Hopefully this review will discourage others from eating here.", "date": "Oct 18, 2022", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I have driven past Daley's so many times and finally made the decision to stop by for brunch. Wow, am I glad I did! I would not have guessed the space was as huge as it was without entering the restaurant. They have a phenomenal, wide range of breakfast foods served all day (and who doesn't love breakfast food?!) with lunch and dinner options also available. The service was great and quick and the food was so tasty! The scrambler was well seasoned and had a good amount of turkey sausage in it. Everything was well priced, too! I know I will be back for the atmosphere and food. As an avid coffee drinker, I felt the coffee cup sizes could have been a bit bigger and felt bad for our server who had to keep coming back for refills because I drank the cup full in a few sips. But this issue was barely even an issue and not enough to knock it down to four stars!", "date": "Jul 19, 2022", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I am a long time customer of Daley's.... Decades!But, my breakfast today wAs NOT GOOD, at all, I ordered salmon croquets. The Pattie's looked perfect but they WERE NOT salmon. No flavor, AT ALL. Perhaps mackerel???? Idk, but I was VERY disappointed!! I wasted $30 on an inferior breakfast ($5 tip)", "date": "Dec 5, 2022", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I've worked at UChicago for 4 years and HydePark/South Shore combined for 7. I can NOT believe last Friday was my first time here. Absolutely amazing menu with TONS of options. Hearty breakfast choices to sandwiches and lunch plates. Service was also insanely good. Restaurant is very modern and was very clean. Everyone (waitstaff and customers) were really respectful of mask wearing. I felt super safe and very well taken care of. This will definitely go on the list of our \"go to\" work lunch spots and weekend breakfast places.", "date": "Sep 5, 2021", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I had the liver and gravy with rice and eggs. Oh it was fabulous will always come here. That was my first time coming and it was amazing. Experience had so much fun will be back.Classic", "date": "Jul 18, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Great breakfast and lunch menu! Friendly servers. The oldest restaurant in Chicago.Chicken and Waffles was great.", "date": "Apr 23, 2022", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "I really enjoy Daley's breakfast menu! Great options! Generous portions! Has never disappointed! Great staple in the community for many years and the new restaurant brings a millennial feel to a longtime venue. Nice waitstaff with good service. You're bound to run into a friend or even local public service persons at Daley's.", "date": "Jun 30, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "They have great steaks and pancakes. I always go here. Even before they built the new one. Nice atmosphere.", "date": "Jun 20, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "The food was good and the prices were reasonable.  I liked that the establishment was clean.  The staff attitude is what you would to receive when someone is dealing with your food.", "date": "Oct 7, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Daley’s Restaurant", "alias": "daley-s-restaurant-chicago", "text": "Just basic grub,ok for breakfast.Service is attentive,ok if no other options are  available", "date": "Sep 21, 2023", "is_closed": false, "address": "Chicago, IL 60637", "rating": 3.8}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Stopped in to Kusanya Cafe today for the first time and it is INCREDIBLE. The caramel frappe was delicious and the sandwich was great as well. The atmosphere and vibe are really chill and laid back. What a gem! HIGHLY RECOMMENDED", "date": "Aug 1, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Street parking. Customer-made and recycled wood furniture, only one bathroom stall. Service always good, coffee and food even better. Absolutely the best oatmeal you'll find in Chicago. Wonderful community gem, could use later hours of operation. I'd recommend covering the wooden tables with glass.", "date": "Jan 26, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I appreciate this place for being bold enough to be located in such community!! I did a counseling session here, that's how nice it is! I'll be back!;)", "date": "Jan 2, 2015Previous review", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Great coffee.  The food is good and reasonably priced.  My colleague and I go here every week.  We love the staff.  Only complaint is wish they were open later.  Highly recommend!", "date": "Nov 4, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Great Menu!!! Love this place!!! Reasonably priced (actually cheap) healthy alternatives, in an urban area!!!", "date": "Jan 7, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Great neighborhood spot. Inspired me to make my own baked oatmeal for my kids. Great sandwiches with fun names and they're consistently well-made. If they're not the staff usually takes care of you. Haven't been in a while, since I don't work in the area anymore. But planning a trip there real soon to treat the kids!", "date": "Oct 28, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I did not like the seasoning. Even the mild was tooooo hot fit pallet. If you're into hot and spicy then this is the place for you", "date": "Jul 17, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "So I came here once before with my mom. I was looking for a breakfast spot while attending another meeting in the area. I noticed this spot again and my Yelp friend Char had been! So I came back. Same spot, unique to other coffee joints. Loved the fact the mgr had two young black men cooking prepping and working the register.. .YES! Whole nother discussion  which this platform is not for. HOWEVER, loved the fact that he was training them. Noticed how when I walked in, he coached them to \"get to work\" lololol......I commend that gentleman...On to the food and ambiance. I concur the vibe is soooo laid back .....love the afrocentric setup.... eclectic, rustic, worn, pieced, so our culture.....that egg sandwich was FIRE.....lots of good egg sandwiches me....however this has a siracha sauce that lights up the other components of the sandwich....The latte was spot on.......ohhhhh man I love coffee... definitely will be back", "date": "Apr 16, 2021", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Kusanya is a cute, quaint neighborhood coffee shop offering good food with healthy options, prepared to order. The Personable customer service is impeccable! Clean, warm, friendly atmosphere and staff! Love this place!", "date": "Jun 20, 2023", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Kusanya is such an amazing place with vibes that are UNMATCHED. Kusanya is in Englewood, Chicago and is community owned and they mean that. They had flyers for open mic nights, and yoga offered weekly at the cafe and even sold black owned/ community owned products such as hand made soaps for sell at the register.The menu at Kusanya is so CREATIVE from the Chicken Funkadelic Sandwich, The Big Pay Back, Lupe Tabasco, Bernie Mac and even the Tuna Turner (and there were so many more). The staff was pleasant and helpful in explaining both food and drink options and giving me a run down and their favorites. Ultimately, I chose the Lupe Tabasco (a breakfast panini where you could add your own ingredients) I added spinach, cheese, eggs and of course the Tabasco sauce for a kick. Additionally i got cheese grits with butter and an iced coffee. The 'Lupe' named after Chicago rapper Lupe Fiasco (awesome play on words) was AMAZING the egg was freshly cracked, made, and seasoned, the spinach was fresh and delicately place and the Tabasco really added a great kick to the sandwich. I was told by the cashier that people often add more veggies and meat such as ham or sausage. The grits were well made with the perfect cheese, butter grit ratio and had perfect texture. I enjoyed my iced coffee and the price was so reasonable for the size (12 oz for 1.89) I highly recommend Kusanya not only for the amazing food but the community vibes, pics, plants, staff and events are all worth while as well.", "date": "Jan 15, 2020", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This was nice coffee break. It's quite and spacious, I kicked myself for not bringing my laptop but I will next time. The parfait was fresh and flavorful and the latte was delicious better than most chain coffee places. I will be making this my Friday stop in the future.", "date": "Sep 18, 2021", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This spot roasts their own coffee and it's delicious! V friendly staff and the lupe tobasco sandwich as flame. Highly recommend. Love what they do for the community.", "date": "Oct 7, 2021", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This place is a hidden gem. The vibe in the coffee shop is great! The service was everything", "date": "May 1, 2022", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "J Dilla sandwich is life. Lucas tobacco is my second go to and ham Master Jay brings up third.", "date": "Mar 25, 2022", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "From the rustic feel, to the beautiful artwork and pictures displayed on the walls, this is a pretty cool cafe!I ordered the Lupe Tabasco and it was delicious! I usually don't add anything spicy to my breakfast, so I was resistant to try due to the Tabasco sauce that comes on the sandwich. However, the cashier and one of the ladies behind me in line said it was tasty! So I gave the Lupe Tabasco a try and I'm happy I did! I'm glad I tried this place instead of going to Burger King next door! Kusanya had actual real eggs on their sandwich and I was able to add veggies. I will be back!", "date": "Apr 26, 2019", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Rosa J. believes that every community deserves a inclusive, inviting, and \"empowering\" spot to hang out.  Kusanya Cafe is an Englewood represent, located on the southeast corner of Green and 69th. St.  I do have to admit the surroundings are a bit sketchy, even though I don't anticipate immediate danger during the daytime.  The cozy joint is absolutely nice to get coffee and light lunch fare at reasonable prices.  I saw many regulars take advantage of the free wifi and bright sunlight to get work done.  I had the \"Ham Master Jay\" sandwich made-to-order by the friendly young lady at the register.  It was executed impeccably and tasted delicious.  Together the large, 20oz. latte and the sandwich cost less than $10 after tax.  After visiting various coffee shops in the city, Kusanya is one of the most inexpensive places I know.  If you happen to be the area or need to grab a quick bite nearby, Kusanya is an excellent choice.  The nearest El station is the CTA 63rd./Halsted Green Line.  For CTA buses, #8 (Halsted) and #67 (67th./69th./71st.) are in close proximity.", "date": "Feb 17, 2016", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I loved walking into this coffee shop. It's in a good location, easy parking, free Wi-Fi, and great food selection. The cafe space is very open and comfortable and the bar is nicely designed out of reclaimed wood and doors( I think).The staff is great, polite, funny, engaging and offering great service. The food coffee and music are all top notch and if your even think you want the baked oatmeal, do it, don't skimp on the warm cream.Even though I was visiting from out of town, i felt welcome and like I was among friends. I can see why it's called \"Kusanya\" - bring together in Swahili.", "date": "Mar 26, 2018", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I FINALLY made out into this awesome space. Tried before but my timing was off. They weren't open...Well, today was a stumbled-upon kind of day.... So very happy I came! First visit... VERY AWESOME COFFEE! I mean DEEElicious !! They said they roast their own beans in house!Um... Guess I never Submitted first review... So... 2 weeks later I was wanting that delicious roasty flavor... Got it for free! They have a Pay-It-Forward program! Sometimes your drink is in the last person! It's  LOVE! So, I bought a brownie.... Just to taste & give away (diet), but bit they are really special brownies... Wish wish wish I could inhale the Whole gooey thing. DON'T MUST OUT ON KUSANYA quiet spacious clean friendly chill deco good", "date": "Oct 2, 2017", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This is the spot for me whenever I'm in the neighborhood. I had the baked oatmeal with fresh berries and almond milk and it was perfect, along with a latte. Prices are so so extremely reasonable, and the bakery case has yummy items ranging from 90 cents to three bucks. I love the aesthetic here. They have beautiful art pieces and a rustic, hip feel to the general decor. The coffee is roasted and packaged on-site and also sold at the Englewood Whole Foods. Everything is top notch quality with choices of $1 mugs of coffee if you order it to stay. I love the nods to Englewood throughout the cafe, from the outline of the neighborhood sketched on tables, to the coffee sleeves and paper bags. Kusanya also hosts neighborhood events, a fresh foods night market on certain evenings, yoga on weekends, and open mic storytelling. Kusanya is also a non-profit that started on Kickstarter and that stays afloat through community support and grants. If you want to donate check them out online or stop by and ask about it. I look forward to trying their sandwiches! So so good!", "date": "Jul 17, 2017", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Grabbed a sandwich and a cup of tea the other day and I gotta say they offer a lot of breakfast options. The sandwich was with chicken it was good, the bread and the inside tasted fresh. The staff was nice, although we didn't have much time talking.", "date": "Jul 15, 2021", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Stopped in for a half pound of coffee. Was in the area saw the store, heard a lot about it when it came to Englewood. I often purchase the coffee from Whole Foods. Why not get some from the source. Stopped I, got cup of Joe with almond milk and a donut.  Also, go a half pound of the Costa Roxanne coffee for $7.", "date": "Oct 5, 2019", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Ok so I live a few blocks from this cafe and every time I pass by I make a note to check it out. Well, I finally made it and it was well worth the wait. The food is fantastic. I got the special: Rasta Jerk Chicken Wrap and it was great. It's got a well-needed kick. I also got a lemonade and some cookies and they hit the spot. The atmosphere is inviting and the service is fantastic. Stop in, grab a sandwich, and chat with the employees. I will definitely be back to some of the community events they host!", "date": "Aug 28, 2016", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This place deserves all the hype it gets. i've been coming here almost daily since starting work down the street. I always order coffee black and the quality is stupendous. I've started getting the lunch recently and the Big Payback is delicious, not too much and reasonably priced. The staff is always friendly and parking is easy. Ill keep on coming back so long as they keep on being awesome!", "date": "Sep 12, 2018", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Great place! Saw this on a PBS special one night at work so me and my daughter checked it out. I had The Big Payback and my daughter had The Bernie Mac N Cheese. Excellent! She said it was the best thing she ever had which is a big deal for her. This place is a gem and I hope to see more pop up! Will be coming back.", "date": "Jul 6, 2018", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "This place is lovely!  I came in with some coworkers and really enjoyed my iced caramel latte.  The prices are fair, the ambiance is comfy and inviting, and the staff is friendly.  I will certainly be back.", "date": "Mar 17, 2018", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "Non-profit cafe, c'mon y'all, this is pretty cool.Folks told me, yeah, don't go to the South side. I'm from Oakland, and that's what people said about there too. It's kinda surreal here. This business should be supported!French toast is good, cafe au lait a bit burned, soup great, and the Cornel West sandwich pretty boss!The barista said they have music here sometimes.", "date": "Dec 11, 2017", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I love this place. I come in once or twice a day. The quality of their coffee is beyond expectations. The other guys have nothing on them. The ambiance and decor are wonderful. Cozy and inviting with a very friendly staff. This is not a \"fast food\" place. Don't expect speedy service. Expect great service. Go Kusanya!", "date": "Oct 9, 2017Updated review", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I love this place. I come in once or twice a day. The quality of their coffee is beyond expectations. The other guys have nothing on them. The ambiance and decor are wonderful. Cozy and inviting with a very friendly staff. This is not a \"fast food\" place. Don't expect speedy service. Expect great service. Go Kusanya!", "date": "Nov 21, 2015Previous review", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "The latte was almost as good as the service! The ladies were very friendly and helpful. The caramel latte I got was very flavorful and was perfectly crafted. I will be stopping here regularly. So refreshing to have a coffee shop in the area!", "date": "May 10, 2018", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Kusanya Cafe", "alias": "kusanya-cafe-chicago", "text": "I was on a film shoot with my crew on the south side of Chicago and we needed lunch and to setup shop for a little while to capture footage. We found Kusanya Café and it was great.Staff was friendly, had some wifi for us to use, and the food was great. Pro tip: get the Chicken Funkadelic. Really delicious chicken salad, not smothered in mayo, with a little kick.Wish there was one closer to me, I'd go frequently.", "date": "Oct 4, 2017", "is_closed": false, "address": "Chicago, IL 60621", "rating": 4.7}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I was in Chicago and said to myself \"I need an Italian beef\". Was over by university of Chicago and Yelp pointed me in this direction. As I pulled into the parking lot I asked a lady waiting in her car, what I should get. She suggested an Italian beef or the wings. I went with the beef extra wet, light peppers and cheese fries. I ordered cheese in my sandwich, but it was forgotten. The service was good, I even got a strawberry lemonade Sunkist included with my meal. the cashier assured me my choice of meal was the right one. I put some of the cheese fries directly on my sandwich and whew was it delicious. The food was seasoned perfectly, but it was a bit messy. I learned quickly that this was not a meal to eat while driving. It was a huge portion of food for under $15. I guess the neighborhood is supposed to be a bit sketchy, but I'm a Black woman, in a Black neighborhood so I wasn't too concerned, and it was daylight. Overall, the food is good, just go during the day, and pay attention to your surroundings.", "date": "Jul 21, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Southside food options (esp late night) are hit or miss but I've had good experiences + hot food here. I'd just recommend calling them directly since the apps markup their prices real bad.", "date": "Dec 21, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I have to say,  the customer service was EXCELLENT! K.T., I believe their name is, needs to be recognized for exceptional customer service skills.  It was clean and well lit. The food is good as well.  I can see me returning.", "date": "Oct 9, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Absolutely, great tasting food. Fresh and delicious no matter what you get. My number on favorites are the gym shoe and fresh chicken wings.", "date": "May 9, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "The food was great! The person taking my large order over the phone was patient with me. Owner even gave me a free pop.", "date": "Jan 22, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Good make me not well the last time I purchased something. The fries and sauce were tasty. However, the other food my father and I are sent us to the restroom. Additionally, The front office staff at the time, was very rude and required social skills training. I completely understand this part.", "date": "Sep 19, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I got me a large Italian beef combo with the meat packed. The meat was tender with a lot of flavor. I was only able to eat half of it.  I will be going back. I'm not crazy bout the fries but I was not going there for them. Keep up the good work with the quality & quantity of your food.", "date": "Mar 19, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "The good: Generous portions, the food is pretty good, service is fast, there are lots of options, and the staff are super nice to you if you are at least polite to them.  They are also happy to customize orders for you.The bad: this is in a somewhat sketchy part of town.  I mean, the kitchen is behind a huge plexiglass (bulletproof?) screen.  That being said, I've walked here more than once and never had an issue.I certainly haven't tried everything from here, but have had a couple different kinds of sandwiches, fries, pizza puff and chicken nuggets.  I'd rate them from good to less good in that order too.  The food in general has not blown me away, but it's a helluva lot better than chain sandwich shops!  And as a locally-owned place, I gotta support them, so it's really a win-win.Like I said, give it a try, go in hungry, be nice, and these guys will seriously take care of you.", "date": "Aug 19, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "The white door that's the entrance to this spot is makes me feel like I am on set of Candyman. It's a huge projectish white dingy door. Please either paint it or get a new one!!!! It's a small hood restaurant with no seats. The order taker and cook are behind plexiglass. I ordered an Italian Beef extra extra dipped with cheese fries and a cream soda. I was surprised they had cream soda usually places in the hood don't carry cream soda. The guy wrote my order down then told the cook I wanted a combination... I interjected fast. I repeated my order again and he got it right. So double check that order is right. I see in the other reviews they aren't accurate sometimes. I experienced it first hand. Anyway my total was $9.60.. It took like 8 mins. My beef was great!! Nicely dipped like I asked! They had seasoned fries underneath all the cheese. They didn't skimp on the cheese. Now I didn't like that the Italian Beef meat wasn't sliced like at other places (i.e Portillo's) the meat was chopped up. I think that's their way stretching their product. But my meal was ghetto goodness!", "date": "Feb 17, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I only gave three stars... I will start by saying the reason I went here is because I kept seeing people on FB post about how delicious the offerings are here. My hubby ordered the super taco and ended up with a gyro... I ordered the Italian beef with black pepper and mild on fries although they forgot to. So they don't listen well make sure your order is correct. The beef was nothing to write home about. Hubby pita was not crispy either. I did notice they use fresh chicken breast for their tenders maybe I will give them a second try!", "date": "Dec 23, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "the owner does not care about the customer he gives old reheated chicken you can taste it he mistreats his cashiers and forces refunds when customers just want their food corrected I DO NOT RECOMMEND EATING NOR WORKING HERE", "date": "May 15, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Everything I've ever bought from here has been delicious. My favorites as of late is the Italian Beef or the Gym Shoe. They have affordable prices and good size portions. I'd recommend calling ahead to avoid waiting. It's cash only.", "date": "Dec 6, 2018", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "My favorite south side hood spot. The restaurant is close to my house, the staff is what you expect to have at a south side hood spot. The gyros are good, but the gyro sauce taste like ranch dressing, I like ranch, so I don't mind, my husband, hates ranch so he hates the sauce. The chicken is good. The Italian beefs are good also. Still the best gyros are on the West side of Chicago, FACTS!", "date": "Sep 13, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "My first and LAST time purchasing food from here. I sent someone to get me a chicken philly, mind you I'm pregnant and was starving..when I tell you the presentation LOOKED delicious, I was excited to eat it and soon as I took a bite the sandwich was so heavily seasoned, it tasted like pure salt. I tried to take another bite and the whole sandwich was severely over seasoned...to pay $9 just to eat French fries, I definitely won't go in and take any chances hoping the cook doesn't over season my food..", "date": "Sep 16, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "This is a nice spot to go to after hanging out late. They sometimes get a little attitude when you make sure there not messing up your order. They write down your order and they still get it wrong sometimes. Besides that the food is hot & fresh. They give you a good amount of food for your money. \"Italian Beef is a Hit\" ** \"Chicken & Steak Philly is a Hit\".", "date": "Mar 6, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Abdul is the best and there are two main guys that work the late shift who are amazing! The food is always great. I wish the people who came into this place knew how to be courteous and well mannered seeing that you are getting great food. I always try to be respectful to people cooking my food. Thank you guys for being rockstars even while dealing with some difficult individuals!", "date": "May 29, 2018", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Excellent, and they're open all night. Okay, don't expect you familiar sub here. Thid is a little different but fantastic tasting, fresh, and hot/spicy. Very wide ranging menu will have me going again and again. Try it out and don't forget the fries. Reasonably priced at around$6 for combo including \"pop\". Lol. I didn't know what he was asking for. I thought he was asking me if I wanted the sub to pop, like make it extra hot.", "date": "Jun 26, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I have been eating here for years, great Cheese-sticks with mild sauce!! Great prices. Mild freeze yo ass of waiting for the food tho", "date": "Feb 14, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "My man would not leave Chicago until he ate a Gym Shoe!! This place was definitely a big detour from our Hotel on the Magnificent Mile, but the sandwich did not disappoint.  He ordered a king size and it took him the whole evening to finish with a 3 hour nap in between!! He loved it. I thought it was ok... BUT I'm giving 4 lovely stars for pleasing my guy!!", "date": "May 27, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "This is my local spot. I live just down the street and they are always open.I have tried a little bit of their menu but the gym shoe is what I usually get and it's what you should order when coming here.It's a beautiful combination of meats (roast beef, corned beef, and gyro meat) served in a philly sandwich style bread with lettuce tomato mustard and tzatziki sauce. I have only ever ordered the small for 6.99 which comes with fries and a can of pop. The small sandwich I can finish but I definitely need to loosen my belt just a little bit afterwards so I can't even imagine how much food the large is.There is no eating space here, it's just a small indoors walk up counter where you order so plan on getting your meals to go.", "date": "Nov 6, 2015", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "The Gym Shoe.  This sandwich is a true gem of the greasy spoon culinary lexicon.  A perfect fusion of greasy spoon favorites melded into one taste-bud tantalizing treat.  The name suggests a gut blowout, but instead you get a well thought out, perfect blend of Gyro meat, Roast Beef and Corned beef nestled in a wondrously soft and not too heavy roll.  Then, top this baby off with lettuce, tomato, tzaziki sauce and mustard, and you have a sandwich that could only be created by a sandwich visionary.  This is a destination sandwich, folks.  They also pre-ketchup your fries, including some salt and pepper.  At first I wasn't sure about this, as it can lead to some pretty soggy fries.  It seems they actually toss the fries with the ketchup, salt and pepper, and the outcome was fantastic - even after a 20 minutes bikeride before getting to eat.There's no where to sit, and you don't want to hang out front for too long.  Take this sandwich to go!", "date": "Jul 30, 2016", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Good greasy food. I tried a gym shoe here, and it was well worth it. I'm not sure why they even bother calling it a small as it's one of the most filling sandwiches I've ever had. What is the large, a party sub? Reasonably priced. It would be nice to have a few tables to sit down and eat.", "date": "Sep 9, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Food was good but I wanted Gymshoe sandwich. Went at 10;30 pm on a Saturday and they were out of some ingredients for my gymshoe. Ate an Italian beef it was ok, my lady had the pizza puff. She wasn't satisfied", "date": "Mar 23, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I visited this place bc it was close to where I was staying. I had the mozzarella stick which everyone raves about. Overall I thought they were just okay. They have very reasonable food but that's usually the case with the these shops in the area. Yes the area is considered sketchy but no one bothers you. Mind your business and you'll be fine.", "date": "Oct 26, 2015", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Looks a little sketchy from the outside, but don't let that stop you from going in and getting good eats. Really wanted a philly steak sandwich and Millers (down the street was closed) so I tried this hole-in-the-wall. Glad I did, Philly was amazing and I got mozzarella sticks as well. The worker suggested I get mild sauce on my mozz sticks and, surprisingly, it was delicious. Definitely coming back.Worthy of 5 stars considering the kind of food it serves, but due to the neighborhood (& traffic at that intersection, itself) I give it 4. Cash Only :(", "date": "Mar 28, 2015", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I've been here twice and both times were incredible! Give the gymshoe sandwich a try. It's like a gyro on french bread instead of pita with roast beef and corned beef. The Italian beef and wings were really good too. Unless you have the appetite of two people the small sandwiches are sufficient. You can easily feed two with a large. Cash only", "date": "Nov 10, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Ordered here for me and my boyfriend yesterday. We ordered a chicken Philly meal and a gyro meal. I asked for NO CHEESE multiple times when ordering only to get home and there was cheese on my philly. THEN on top of that my boyfriend has been sick (diarrhia and vomiting) since eating the gyro meal. They gave him food poisoning. Not happy. We used to frequent this place, but after yesterday, we will never be back.", "date": "Dec 11, 2017", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "I been coming here for years and i will always come back. They put their heart and soul in this food and you can only find this type on the south side", "date": "Oct 26, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Stopped by after work yesterday to see what all the hype about this Gym Shoe Sandwich was and I found out.  Now normally on a regular and off day, I do not like a plain corned beef sandwich [too salty] nor do I like a plain roast beef sandwich [too bland unless its Arby's], but somehow chop them girls up together with gyro meat and sautéed onions and you got something good going on!!!  They balanced each other out very well and I really liked it.  I would have given it 5 Stars but I told them not to put the tzakini sauce on the sandwich and when I got home I discovered that they did!!", "date": "Oct 28, 2016", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Southtown Sub", "alias": "southtown-sub-chicago", "text": "Fast service ... Delicious Gym Shoe .... good mild sauce (not barbecue sauce) didn't give enough fries though.", "date": "Dec 28, 2018", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.0}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Fantastic service with the friendliest family of staff  Tried them at lollapalooza, got the: Turkey burger bites bomb dot com fried plantains famous turkey monte cristo Sandwich (batter + light sugar with toast, cheese & turkey frie)d Veggie Philly cheese steak Homemade strawberry lemonadeSeriously everything was delicious! Definitely would want to try the monte cristo and PLAINTAINS freshly fried in the shop  likely the best PLAINTAINS I've had in Chicago When grabbing and going, I would recommend ordering on their website ahead of time vs using door dash/GrubHub. Support small businesses", "date": "Aug 8, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I placed an order through Uber for the turkey club with extra mayo and pepper jack cheese combo with chips and strawberry lemonade. The lemonade is not the best. It tastes like there is artificial sugar in it and is not very lemony. It is not natural at all; however, it is packaged like it's made in-house. It very well could be but it's not the best.The sandwich had no tomatoes and very little lettuce, and the lettuce on it was wilted; there was only one piece of bacon and way too much mayo. It tastes TERRIBLE! It is the WORST sandwich I have ever had, and it is very hard to mess up a sandwich. I was only able to eat a quarter of it. I have had better sandwiches from Jason's Deli and probably should have ordered from there. I will never order from this place again. If I could rate it a ZERO, I would. People, save your money and go somewhere else. It is a double thumbs-down for me.", "date": "Jan 23, 2024", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Ordered via Uber Eats. First off, phenomenal customer service. A representative called me to inform me that I couldn't make a substitution (with the Turkey Cristo just FYI) and to ensure of my other requested substitutions, which I genuinely appreciated, because most restaurants don't take the time to resolve minor issues like that.Now the food. The jerk chicken wrap, phenomenal! 10/10. Really flavorful and not really spicy. Had mine with the tomato basil wrap.The salmon salad, I personally couldn't get into the caper dressing, but it is a nice accompaniment if you like capers. I'd try it again with a substitute dressing.The chili was really yummy too, and I don't really like chili.I'll definitely be returning and trying other menu items. Everything was fresh and well prepared, even if it wasn't my personal fave.Definitely a must try place!", "date": "Apr 28, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "This was my first time visiting Mabe's and I'll definitely return. I ordered a Turkey sandwich (I think) it had red onions, spinach, Turkey bacon  and a homemade sauce. It was very tasty. The sandwich was warm and served on toasted bread. The potatoes were tasty too. The customer service was great and made to order. The ambiance is cafe style.", "date": "Aug 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Wow! We HIGHLY recommend this deli! If I could give 10 stars I would. Home made chicken salad is the best! Awesome Buffalo chicken wrap, smoothies are off the chain and the owners are great! Go and eat!!", "date": "Aug 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Thoroughly enjoyed my items from here but let me tell you about that damn salad!  I'm willing to rank it as one of the best in the city after only one try. Twas huge to say the least, chock full of fresh ingredients, crisp, lettuce & that caper dressing was to die for. Seriously the staff should consider bottling the stuff & I'd be first in line! I also tried the jerk turkey sandwich & it was decent. I'd never think to pair jerk with turkey but it was a welcome difference from the often mundane jerk chicken found around the city. The jerk was very reminiscent of true jerk not the five alarm fire people assume is the authentic jerk flavor. The hours will unfortunately hinder me from becoming a regular but if given the opportunity I think think salad should be experienced by everyone.", "date": "Feb 17, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "The BLT is nasty !!! Spinach was on it not lettuce and when you think of BLT it's fresh  tomatoes and lettuce not cook not hot ! You looking for crush not soggy!", "date": "Jan 5, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Service is impeccable! You are greeted with a smile even though they're often busy. The SALMON SALAD is literally to die for! Dave's Buffalo chicken wrap is such a crowd pleaser, my mom and boss always ask for that one when I run to get lunch. While I was waiting for my order, they had some samples. So I tried the chickpea salad sandwich which just so happens to be vegan ... IT IS BETTER THAN THE TUNA SALAD SANDWICH! Like dead serious. I can't wait for them to roll that one out next week. The chili is well seasoned and is better than expected for a fast food chili. It is not your mama's but it'll do for a nice hot side on a gloomy day like today. Strawberry banana smoothie is super good but it is not too sweet so if you are looking for a desert- try something else. It was perfect t for me but might not be up your alley. MY ADVICE: get lunch with your boo or coworker, choose 2 items from the menu and split them. You. Will. Not. Be. Disappointed. It was lovely to see a woman-led kitchen; they were moving like a well oiled machine. They are on door dash as Mabe's Deli! &  I've been 3 times now and never wrote a review so I had to write y'all an essay today.", "date": "Jan 5, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "The best in town! Great sandwiches! Great service!  Immaculate vibes!  You're missing out if you're not going to Mabe's!", "date": "Sep 14, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "The food was tasty and the place clean. The staff was friendly. That's all I require for a to go spot.", "date": "May 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Everything I've tried from here is delicious. I usually get the Double Decker Sandwich but I've also had the Jerk Turkey Panini, 312 Sandwich and chili. Today I tried the salmon salad with Cajun Salmon and... it is everything !!", "date": "Sep 21, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Yummyyyyyy. I asked for a recommendation and got DJ's Turkey panini.  The deli turkey was delicious. The staff was friendly. I'll be going back.", "date": "Jan 27, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "That turkey cristo is the bomb. I just wish they serve it all day and or they was open on Saturday's.....", "date": "Feb 11, 2023", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I ordered a chicken Caesar salad, and it was so good. Also they have excellent customer service.", "date": "Aug 6, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I've always loved this place so my review is long overdue. However, today I went in to get 3 salads and I just wanted to give credit where credit is due. CUSTOMER SERVICE!!! Is TOP TIER here! I've always loved that about them. It's a guy that works there who has been there for a while and he is always such a delight to talk to. So kind, and wants to make sure he gets your order correct every time. I truly admire that about him. He is always so welcoming and because of that I'll always come back to support. I got a salmon salad and 2 spinach salads added salmon. The spinach salad was amazing!!! I've also had the smoothies from there, incredible! I love a good black owned business!!!", "date": "Jun 11, 2021", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I had the Yazzy's Special (Turkey Pastrami and Corn Beef mixed together with Dijon Mustard, swiss cheese, red onions, topped with pickles.)It was soooooo good. Paired with the bbq cherry chips. Odd flavor but it wasn't bad. The cherry is an after taste. Taste nothing like medication, Thank goodness!I'll definitely be back.", "date": "Oct 16, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Thanks so much for your review! We truly appreciate your business! Hope to see you again! ", "date": "Jul 21, 2022", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "This was my first time at Mabe's Deli, and everything was amazing. The staff, the service, I felt welcomed and the sandwich I ordered had great flavors that complimented each other.", "date": "Jul 17, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Excellent triple decker turkey sandwich.  Very tasty!  My colleague had a salad that looked great too.", "date": "Dec 8, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Thanks for supporting us! Glad you enjoyed your meal. ", "date": "Feb 25, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I've been here twice and I'm pleased with their service and food!!!! Delicious smoothies, and super yummy wraps! I got the Mabe's double decker and Mabe's green machine smoothie!!! The smoothie reminds me of a matcha tea , looooovvveeeeee it ! The wrap is so juicy and I love their herb mayo ! I'm so happy that they understand the need for more healthy options in our community! Thank you Mabe's Deli! Everything tastes fresh and made with intent !", "date": "Jul 7, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Thank you for review and supporting us. It means the world. We truly appreciate you! ", "date": "Jan 11, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Wanted soup and sandwiches so stopped by to support black business. Nice clean establishment, kind staff. A little pricey for the amount of meat and lettuce on my The Bina sandwich and the tomato basil soup was watery. My husband got the double decker and broccoli and cheese soup also watery and no broccoli. It wasn't a bad experience ,I would revisit to get a sandwich chip combo. I don't know about the soup.", "date": "Sep 8, 2018", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "From the moment we walked in we were greeted  with nothing but welcome arms... the brownies omg are to die for .... clean eating area bathrooms an free WiFi ... I got the djs jerk turkey panini.. and I'm excited to see what it taste like ... based on the ambiance I'm sure I'll be satisfied .... Keep up the great work", "date": "Aug 4, 2018", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Nice, comfortable scenery. Everything is prepared in front of you. Definitely a great lunch options.", "date": "Aug 2, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I had the pleasure of going there a couple of weeks ago. It was great!! I had the Yazzy it was so good. And aside from the food the customer service was on point. An employee showcasing the food made me want to try it. And to my surprise she was there when I came. Overall great experience.", "date": "Mar 6, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "So glad you had a great experience at our restaurant.  Hope to see you again! ", "date": "Sep 9, 2020", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Excellent food I had the Jerk Chicken Salad and Jerk Chicken Wrap both were delicious. Very professional service and staff. I will definitely be back", "date": "Feb 27, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "Thank you for the review! We appreciate you! ", "date": "Oct 24, 2019", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
{"resturant_name": "Mabe's Deli", "alias": "mabes-deli-chicago", "text": "I've ordered from Mabe's deli, probably, five times.  Each time was a positive experience.  Yesterday, I phoned in my order and Martinique was pleasant, friendly, efficient and humorous.  When I went to pick up my order, we gave each other the \"COVID-elbow bump\".  I just appreciate good service and am in awe of people who can deal with the public and remain pleasant.  My tuna melt was amazing and I'll be ordering it again soon", "date": "Mar 28, 2021", "is_closed": false, "address": "Chicago, IL 60619", "rating": 4.5}
