{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "This is what Chicago pizza is all about, tavern/thin cracker style. I'm not sure how or who chose deep dish to represent Chicago, but they have done everyone a disservice.While visiting Chicago again I had the opportunity to get out of downtown and get the full, proper experience at this beloved institution. It's got a homey vibe compete with sassy attitude that my buddy and I truly enjoyed. We got a build your own as well as the recommended Italian beef and both delivered what the deep dish could never. Tons of textural contrast, from super crispy edges to slight soft but structurally sound middle pieces. Salty, savory, spicy from the toppings but just a hint of sweetness in the sauce. The balance was fantastic that keeps you coming back for one more small slice followed by another small slice... and maybe another small slice of this giant indulgent pie.If you're a fan of soupy casseroles that bore you after one slice, please don't come here. If you want to eat more like what the locals enjoy, with good reason, Vito & Nic's is where it's at. CASH ONLY and they don't deliver.", "date": "Nov 2, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Found this pizza shop while looking for a new thin crust pizza parlor in the Chicago-style thin crust pizza Facebook group. We ordered a large,  pepperoni, sausage and shrimp pizza to go. The crust is thin, crispy and has a crunch bite, almost cracker like. I really enjoyed the texture, but the dough could have used more herbs and spices to give it more flavor. The toppings of tomato. Cheese and the meats listed above were very light. The pizza was cut into the anticipated and expected squares. A definite plus. The restaurant was nondescript and we are able to find parking on the street out front. Definitely a dive with loyal local customers. I enjoyed my pizza, but I also would drive out of the way to visit.", "date": "Dec 3, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Vito & Nick's is a Chicago institution. They've been making pizzas for years and the experience has never wavered. If you want a good pie, look no further.We picked up a pizza after a Sox game and brought it home. After a quick warm up in the oven we dug in - yum! We had a pretty basic sausage but I've always found it to be a great litmus test for a pizza place. V&N's passed with flying colors.If you are looking for a good meal and are in the area, check them out!", "date": "Oct 13, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Incredible pizza That's worth the drive. This was a fantastic meal and a great example of Chicago Tavern style pizza. The price is fair and the service is scrappy and kind. Cash only is a downside but it fits with the low key vibe.", "date": "Feb 20, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Food is good service is good ambiance is a pub lived near by gave it a second chance ! Pricey for me but great thin pizza", "date": "Feb 21, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "I am ashamed to say that it took me decades to eat here. South side born and raised and I finally made it here. I am a pizza connoisseurs. With all that being said..... this has to be the best tavern style pizza I've had. Paper thin with the perfect charred undercarriage,the toppings with a perfect crisp and  the sauce is not too sweet. Over all great. This is a hard and heavy 9.8  I walked in and this place was legit stuck in its time. Family owned and decorated. I fell in love. I'd travel here any day for this pizza. Service was great and attentive. I am already planning my next visit. ***CASH ONLY***", "date": "Feb 7, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Best thin crust pizza in southside. Cracker thin crust but generous with toppings. An old neighborhood type restaurant. No special ornate atmosphere but that Irish pub type feel ( and I'm French ), lol. Simple 50s type tables , can even get Od Style on tap , yuck ! lol. But the pizza is the draw . Natural ingredients . Quality food . Busy all the time in evenings . One of the last of the old neighborhood feel places. Hasn't changed since the 60s and that good cause the food hasn't cheapened or lowered its quality. A heads up, they only take cash, no credit cards or checks or debit cards! The pizza becomes addictive it's so good. Once you try , you're hooked.", "date": "Feb 19, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "There is no pizza better than this --mark my words. I have an unhealthy longing for tavern style pizza after living in LA for 6 years. These Angelenos don't understand and my first request upon returning to Chicago is this delicious pizza.", "date": "Jan 10, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "Top Tier Chicago Pizza!Vito & Nick's has been on our list to try for a while and it did not disappoint! Walking in, one knows this establishment has been in business for 100+ years based on the displayed memorabilia, many accolades, and classic southside chicago feel. While the appetizers were good and very well priced, the pizza stole the show. We got both the cheese and sausage thin crust pizza and it by far exceeded expectations. We all agreed it was in our top 3 best pizzas our beautiful city has to offer. If you have not tried Vito and Nick's yet, make the time to stop! Tip: Restaurant does dine in and carry out; cash only.", "date": "Jul 9, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Vito & Nick's Pizzeria", "alias": "vito-and-nicks-pizzeria-chicago", "text": "The pizza, cheese, and sausage the crust. Oh my God it was delicious. I would recommend this to all my friends.", "date": "Feb 8, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.9}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "I always appreciate that when in town I am able to run to Angie's Sports Bar & Pizzeria where Robbie and his staff take care of my stuffed pizza. First couple of times I had to explain what a vegan pizza was but they have now gotten the hang of it and have even informed me that they are seeing more 'veggie', 'cheese free' orders come in. My go to places in the Chicago area to get my fix of Stuffed (Deep Dish) Pizza!", "date": "Dec 26, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Great friendly service. Good food and drinks they also have a nice outdoor dining space", "date": "Jun 7, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Great place love the chicken wings and the ambience is real good peaceful relaxed service is great. Not that bad lol it's a good place. Good food great service the first time we went to eat there. The owner actually welcome to us and gave us a discount on our food bill and ever since then whenever we get a chance we dine in it's not that far from my home, and I hope he stays open for a very long time", "date": "Nov 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "This place is a neighborhood gem.  I work at a nearby school.  We had a retirement party here and I tried the pizza.  It was delicious. It's in the same class as Vito and Nicks.  What makes Angie's the best is the can do service.  During the retirement party the employees kept track of milt tabs snd provided friendly service.  I returned here on my own for lunch.  I called kind of last minute for a call ahead pizza order.  The owner answered and said no problem.  I arrived and he immediately brought me a coke because I mentioned it in the phone.  The pizza came out right on time.", "date": "Feb 16, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "I have been coming here for a couple of years, and one thing I have learned, that no matter what food I order, it's always consistent, from the pizzas to the burgers, and everything on the menu, is made to perfection, it does take two hands to handle this whopper of the burger, overall, Angies is a place to relax and enjoy with some friends, Angies has a good selection of beers on tap, from domestic to imported, they are always cold, and with their 13 tv's you will never miss a game, Robbie and his great staff, are always attentive on your needs to have an enjoyable visit,  bon appetit.", "date": "Dec 21, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "It's Wednesday and I ordered a pizza on line. The pizza arrived cold because the driver could not find my house which was down the street from the restaurant. I called and spoke to the manager who told me online orders were DoorDash and basically insulted and chastised me for not calling the restaurant. He alleged ALL online orders regarding less the pizza establishment is DoorDash. DoorDash said I had to call the restaurant. I called the restaurant and now he says I ordered through menu. It's late, had a long day at work and I'm tired. I hung up on him and threw that nasty looking sh!t in the garbage", "date": "May 17, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Been so many years because I moved away. Had it again last night and the pizza is soo good, as it always was!", "date": "May 6, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Nothing to rave about They rationalize the food like they were saving  Ingredients here ingredients there decent presentation but not my top 5 nor top 10", "date": "May 12, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Their \"Sophia Loren Pasta\" was so unbelievably out of this world that I nearly wept when I was done. Just the right amounts of everything: cream, tomato, bacon chopped so fine it was like a halo around the pasta. Sauce not too sour and not too sweet. Pasta served al dente, just like I like it! The cook here REALLY understands old world family style Italian cooking. Sometimes it's the little things you do to tweak a recipe that makes it a favorite. Served with nicely toasted grill-marked Italian garlic bread. Went on a Saturday night. Came for the band, which was excellent, but really stayed for the food. ;) Decently priced wine, beer list endless and on-tap specials. Brother had the thin crust pizza. I swiped a slice, next time coming back for sausage & green pepper. Good thing I don't live close to this place otherwise I would probably eaten my way through their menu by now. Vito & Nick's should give it up. They were over & out when they franchised and stopped giving a shit about their customers. Angie's is in touch with reality. They respect their customers. The bartender knocks herself out to serve not only drinks but food and covers the whole room so everybody is happy. At least, I went home happy, and I have not felt that way in a long time, and if a small place like Angie's can crank out that kind of food & service every day, then it's worth the trip. I don't know who the owner is, but buddy, you've got a great thing going there, and seeing as the place was packed to full capacity at 7:00 p.m. on a Saturday night when there are a zillion restaurants from 83rd through Hometown, then that's saying something about the way you run your business. I like drinking and hanging out with the salty of the earth. I WILL be back!", "date": "Oct 6, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Amazing pizza. Amazing service. Amazing staff. The nicest people with the best food ever. We stumbled upon this place but will definitely be back many times.", "date": "Aug 18, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Can't wait to try this place out! I've heard great things from the great food to the great customer service.", "date": "Jan 27, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Service is horrible!!!! Save yourself the trouble this place is not worth your money.", "date": "Feb 14, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "I've been here twice now and the food is ok. I gave them an extra star for the service and their prices are pretty good too. We were seated immediately, and we ordered pretty quickly, too. The waitress gave us options on combos and specials that would help with prices. We ordered a variety of items. Snow crab, king crab, lobster tails, fried fish, & mussels. On a prior visit, I had the fried chicken wings and fried crablegs. I would rate everything a 3.5. But I pushed it to 4. The sauce in my crab bag was kind of bland and just ok. I had nonspicy. I probably should have gotten some spice. But yeah, check them out!", "date": "Jul 19, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Unassuming place with lots of options for some tasty seafood. Don't miss the garlic noodles...but they are GARLIC noodles so be prepared! Good service too.", "date": "Dec 13, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "$250 for dinner and 3 drinks? I mean I guess it okay. The shake special I liked but nothing about the price (before tip) can really be justified. The ambiance is interesting, it's super dark, lights low and the music low. Almost like it's supposed to be romantic but really it's not lol idk. Can't put my finger on it but I wasn't impressed. Staff was nice though. Very.", "date": "Mar 10, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Food was good. The green lipped mussels were too big to eat in one bite and no knives available.Maybe I would try them again but they have a few problems. Styrofoam plates and cheap plastic forks. Doesn't work for me with a $70 bill for 2 people. 1 bottle of wine $5 grocery store purchase for $29. Crazy markup on cheap wine. They really should stock a few bottles of decent wine. If this wasn't a new place, I'd give it a 3*, but I'm hoping they're working out the bugs and will deserve the 5* their food is. One more concern is an automatic 18% tip. It's not a tip anymore it's a surcharge.", "date": "Aug 15, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "We love this place! We had king crab legs, snow crab legs, shrip, corn, potatoes, and their garlic French fries.   Our experience was fantastic! The food tasted fresh, and it was super delicious. We chose lemon butter, medium spicy, and it was the bomb. The drinks were so good too. Over all the the service was awesome. It was our first time, and our waitress was super patient, informative, very helpful, and overall, she made the whole experience very pleasant. Definitely recommend this place and we plan to be back very soon.", "date": "Feb 6, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "It's our first time here today. We've driven past this place many times, and finally got around to trying it. It used to be Buffet City, and I came here with my parents many times growing up. They've kept some of the interior the same, but they've modified it to be more of a seafood boil vibe. Our server was really sweet and friendly. She came to check on us several times throughout despite being the only server around 3pm and watching 5+ tables. I can see why it's so busy because the food is delicious, and the price is not bad. This place gives you the bibs and gloves -- some places will charge you extra for a pair of gloves. She helped us store our cake in the fridge and brought it out after we were done with our meal, which I appreciate. She also gave us a knife, plates and utensils without us asking. We came to celebrate my birthday early, and she even wished me a happy birthday. There's plenty of free parking on premise, and they also allow you to easily make a reservation online through OpenTable which is super convenient. I didn't have to make one, but I find that it was nice being able to walk in and have them expect me and my party. They were really patient with my parents not speaking English and also respectful of their health restrictions needing a boil only. My dad ordered the beginner combo, my mom ordered the seafood shake classic, my partner ordered a gumbo laya, a veggie boil with lemon pepper and mild spicy, and I ordered their pick 2 daily special (1/2 lb shrimp head off, 1 cluster of snow crab legs) with the special blend and medium spicy which really gave it a kick. We also ordered a basket of beignets to share, and they were so delicious -- crispy on the outside and soft on the inside and the powdered sugar was perfect. An order comes with 10, and it was plenty for us to satisfy our cravings. My parents and I both thought the sausage in her bag was salty as is, even though she did a plain boil. She said she'd opt for a pick 2 next time and same with my dad. We all enjoyed our meal. I'd recommend this place to anyone in the area looking for seafood boil, fresh seafood made to order, and at a decent price.", "date": "Aug 1, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "I was near by visiting the beauty supply store, My brother was with me; he loves crab boils, so I went inside and grabbed a menu. I took a look at the menu and noticed they had beignets, I was pretty excited because I had been wanting to try these forever. So I ordered some and my brother ordered his food. I also ordered some seasoned corn on the cobb.He seemed pretty happy with his food but after leaving I noticed, what I ordered was not what I expected. Instead of authentic beignets, like the one's in Louisiana, like I expected; I received what some would call, Chinese donuts. I was pretty bummed but I had already left so there was nothing I could do. My 2nd visitI went in to get the seasoned corn I tried last time because I thought it was good, to my surprise it wasn't what I ordered, It was just regular corn. I was bummed AGAIN. I guess I would say, make sure you are very exact and clear with the person taking your order and try to check your food before leaving the premises.", "date": "Mar 27, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "On my Impromptu trip to Chicago, we had a craving for crab legs. In searching the many reviews and the ones pretty close by, we came across this place. It was on a strip mall and the inside looked like it had a lot of Oriental decorations. Very beautiful place. Colorful.  Dry spacious as well. They also had a full bar inside as well. It wasn't crowded when we first got there but then all the people started coming. The prices were pretty similar to all the other places, but definitely worth it. The food was so good. We ate absolutely everything. The food was full of flavor and was cooked perfectly. My son got calamari and loved it. He ate pretty much all of it along with his fries. One cool thing was that on the kids menu, they had buttered noodles. I thought that was cool because a lot kids love noodles and that made it easier to dine for picky kids. I highly suggest this place when you are in the area. I will definitely be back when I'm in town.", "date": "Sep 6, 2021", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "It's not 5 stars compared to West Loop or top restaurants in big cities but for evergreen park it's 5 stars easily. I don't have to drive far to have a quality meal because of this place. The service was great. The outdoor seating is nice and not too loud. My only recommendation is adding a ribeye or filet mignon to the menu. Skirt steak is a common Latin staple but it is usually too chewy for my liking unless it's super fresh and perfectly cooked. The enchiladas were perfect the rice was great. The house margarita was great. My wife liked her food. Keep up the good work! 100 bucks well spent.", "date": "Sep 4, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Let me start by saying the food is super delicious. I would have given the location 5 stars if the portion size was larger.  Meaning, I shouldn't pay $9 for the Salsa Trio and only get 1 small bowl of chips.  We had so much salsa left and no chips to eat it - without paying for a refill. Back to the rest of the amazing food. You must try the Elote Fritters.  The elotes are shaped in a circle disc and lightly fried and topped with mayo, cotija cheese and tajin. We also ate the Carnita Empanadas, which has Coca-Cola braised pork shoulder. I ate the chicken enchiladas for the main entree.  This has 3 small enchiladas that comes with flavorful rice and beans. Oh... the drinks! I tried the I Love Lucy. It has vodka, lime, strawberry puree and soda.  The ingredients are simple, but the flavor was delicious and powerful. Unidad is a small dining location. There isn't a parking lot or valet, but there's a good amount of street parking; especially weeknights. It's best to make reservations through the website. I would definitely go back, possibly for happy hour and eat tacos.", "date": "Dec 17, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "1st time here and our server Laura was also new. Started with Housemade Guacamole. It was fresh but chips a tad oily. Corn fritters were delightful. Arepas were delicious. I had the beef and chicken. I was disappointed it didn't come with rice n beans but the plantains did suffice. The atmosphere is the selling point. Although tvs on at the bar and surround music throughout it was never too noisy. Fast service and steady flow of patrons. I will be back to try some of the other offerings.", "date": "Jan 27, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Absolutely delicious! I was very impressed Not only is the place beautiful, the food preparation was on point every plate was made with care. And as soon as you walk in they ask you about any allergies. The menus are marked gluten free. And vegan.  I was reading the reviews before I went there and one of the reviews said  eat before you go there, well if you're looking to get full plan on ordering appetizers portions are small.. it'd be a perfect place for a gentleman to take a female on a date Not only well she be impressed with the ambiance. She will not be too full to do any extra activities after a date... Okay so let's get to the food we started off at the guacamole. I swear it might be a little bit over 6 oz. It's not a lot but it was good. Then we ordered the  fundido It was good.  other restaurants and it's never hot enough for the cheese to melt You can't get the chip in there. We then had the elote fritters. Those were phenomenal but you only get two .. I ordered the enchiladas. Not only were they delicious, the presentation of them was beautiful!... Most of the time Mexican restaurants overcrowd their plates and they kind of look sloppy they take their time to prepare the plates. We also had the arepas we picked the mix ed consisting one of delicious beef and the other one had chicken in it but I hate to say it kind of tastes like chicken salad I never had them before. So again, I don't know what they should taste but they were accompanied by the fried plantains. Those were excellent..And I certainly took home the tres leche cake It was a little bit too sweet for me But they did hit the spot This gets to my last part of my review I want to thank kolby He was exceptional. Without a good server, it doesn't matter to me how good the food is. It seems I had a winning night parking could be a little difficult there but also for the summer they have outdoor dining which is a plus ..", "date": "Feb 12, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "This is a Latin restaurant and bar located on 95th St., and Evergreen Park parking is available on the street as there is no designated parking lot. The restaurant is small on the inside and has a large patio for alfresco dining when it's warm outside. The menu selections are all small plates. They offer a happy hour during the week with lots of food and drink options. This restaurant gets five stars for customer service. The hostess and bar maids are amazing. The manager also checks in on food and service received while dining, if you're in the area stop by, you will not be disappointed", "date": "Jan 7, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Went for vday with my mister on a date nice atmosphere very romantic candles ! Service seemed a lil slow but there was only one waitress for the patio which was about 6 tables of people. Food was limited to there vday menu which was very pricey for the size but it was delicious. Waitress gave us complimentary dessert which was brown sugared plaintains with ice cream fire !! Amazing will try again full bar ---but no micheladas at a Latin restaurant? and only craft beers so they get a star taken away", "date": "Feb 21, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "It's a very clean and intimate setting on the inside.  We wanted to sit outside but it was too cold.Once seated, we ordered drinks and noticed how service was severely delayed. We were finally able to order appetizers, and even that was slow to arrive. The Queso Fundido appetizer was delicious! I highly recommend it!I feel like Service would've been so much better if there was more than just one waiter for the entire dining room on a Saturday night! All customers seemed to be waiting for their food! Our reservation was at 7pm. The restaurant closes at 9pm. We didn't even have time to order entrees because everything was delayed (service and food) and we would basically be receiving entrées at the same time they close their doors. So we left and ended up grabbing food in the way home.  Such a disappointing experience.", "date": "May 2, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "My girlfriends and I had an amazing dining experience at Unidad. The atmosphere was very nice and the food was delicious; we started with empanadas, had birria tacos and fish tacos for entrees, and finished with tres leche for dessert.  We received wonderful service from Laura, who made great recommendations, and Omar, the bartender, also made great recommendations and delicious drinks.  i look forward to going back very soon.", "date": "Jan 29, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Laney was amazing The drinks was phenomenal and the food was authentic and has fresh ingredients. It's on our list for a return visit.", "date": "Aug 4, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "The girls and I were at it again! Saturday Night Birthday Shenanigans! What's for dinner? UNIDAD! What's on the menu? Diablo Shrimp and Birria Tacos! You can't go wrong with great conversations and Latin Food. UNIDAD provides the atmosphere and space for both. You have to try the Diablo Shrimp! It's spicy with just enough kick to wake up your taste buds. Even the House Made Churros with ice cream and Dulce de Leche was the perfect dessert dish to cool down the heat of the shrimp! Although the churros were nice and warm:-)Our server was super nice and laughed at my jokes. He showed great customer service and kindness. He helped to make our dinner enjoyable and fun. I recommend making a reservation, especially on weekends, to try this restaurant. This is a great place to dine in Evergreen Park!", "date": "Jan 21, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "yummy food service is slow but worth the wait   would be nice to sit in and have cocktails", "date": "Feb 21, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Oxtails too salty and too tough to chew, served with stale coco bread, which I tossed the dinner. Plantains missing from my order.  Thankfully, I checked my order before leaving because there is a sign posted advising customers to do so due to their \"No Refund\" policy. I expressed to the cashier the plantains was missing, she had an attitude.  Her patience was short on Sunday, November 19, 2023. Then the plantains tasted like it was cooked in old grease.  Overall, the customer service can be more welcoming.  The food is hypertension salty and not tenderized.   The restaurant is set up for takeout only which is totally fine.  The floor was clear of debris.  No riffraff hanging out in or outside.", "date": "Nov 20, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I wanted some turkey tips really bad so I ordered here thru Door Dash. The order took longer than expected and the dasher waited about 20 minutes after arriving for my order. I ordered turkey tips (comes with red beans and rice), mac n cheese and cabbage. The food was pretty good. However the turkey tips were insanely spicy. I couldn't eat more than 5 pieces. I know jerk is hot and I can usually handle it but not here unfortunately.  I'll stuck with turkey tips at barbeque places only. All of the sides were good and I got full from the 3 so it wasn't a total loss.", "date": "Oct 10, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I went here ready to order my food only to find out most of the items aren't sold there anymore or they ran out. Also the cashier was holding a inappropriate personal conversation while on the register, as I was trying to order my food. His response to me came off as sarcastic and as if he's simply didn't want to be at work. I will never give this place my business", "date": "Nov 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Out of rice & bean, out of gravy, out of cabbage, $22 for 3 pieces of chicken, a scoop of Mac n cheese and a scoop of greens. Not at all worth the cost or the wait time. I should have known better when I came in on a Sunday evening and the place was empty. The place used to be packed all the time but I guess others have gotten the same lack luster food and service and have decided to spend their money elsewhere. They also need to spruce up the place. Looks old & worn down & like they haven't mopped in months. Don't waste your time or money!", "date": "Jun 12, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Good! I ordered the jerk catfish-it was flavorful and cooked perfect. The sides were good too, yams, cabbage and Mac-n-cheese.", "date": "Oct 22, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I will not be returning period!! I call myself giving them an opportunity to redeem themselves after receiving food on another occasion that was dry and tasted old. I came as soon as they opened so there really is no excuse. This food was straight garbage turkey tips look like dog scraps tendons in every piece of meat ugh!! Sides- yams way too sweet taste like white sugar mac and cheese mediocre at best. I'm done with them! Never again!!!! A FOOOOOLLLLLLLLLLL!", "date": "Aug 27, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Asked for nearby recommendations and this was one of the options. Love that they have an online ordering system and even lunch specials before 3pm. Luckily I made the cutoff time and didn't have to commit to a dinner entree. I got the jerk chicken lunch special which came with rice & peas with the option of an additional side. I opted for cabbage and got another small side of mac and cheese. The order was ready when I picked it up and it was waiting in, what looked like, a standing heated container. It was pretty warm so that was appreciated.The chicken was good and had flavor but not a lot of spice. I was so hungry, I didn't realize until after the fact that there was a tiny container of sauce. The cabbage was cooked well and tasted okay but the rice & peas were super salty. I ate a couple fork fulls but definitely couldn't eat more. So glad I got the mac because it wasn't bad to not be baked. All in all, not a completely bad meal although I did chuckle quite a bit at the piece of white bread (not coco bread) in the bag. So Chicago, lol", "date": "Oct 17, 2020", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I was tired of cooking and had a taste for jerk chicken.  I'm not sure if the regular cook was having a bad day or a sub was working that day because the Jerk Chicken was seasoned well and the jerk sauce was flavorful but unfortunately my wing dinner was not completely cooked.  You could still see the blood inside the wing when you broke it open no, no, no that's not acceptable. This was disappointing because the red beans and rice were tasty and so were the yams.  But and yes there is yet another but .... the Mac and cheese was bland.....no seasoning and not cheesy and the collard greens were bland, they lacked flavor. There is a mixed bag of reviews on Yelp many love it and many give it a failing grade so maybe they lack consistency on how the food is cooked. I'm going to give them another opportunity to redeem themselves so I will be back to try the jerk tacos and the jerk pizza.  Am I a glutton for punishment only time will tell. Stay tuned for round 2!!! In the meantime stay safe.", "date": "Aug 6, 2020", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I will admit that Uncle Joe's is usually my first choice for Jerk chicken. But the problem for me with Uncle Joe's is finding a parking space. Well, today I drove around the block twice trying to find a parking space, with no luck. So, I decided to give Caribbean Jerk a try.I had my doubts but I was pleasantly surprised. The chicken was fine, the cabbage tasty. The beans and rice were a bit salty but edible. I was disappointed that there was not coco bread, the Wonder bread was no substitute.Overall, a rating of 4. I will try them again with no hesitation.", "date": "Apr 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This has always been my favorite Friday afternoon spot for years coming after work with the guys. Love playing the slots- payouts are awesome, ice cold beers, and watching some golf. The bartenders are always willing to shoot the shit and make you feel like you've known each other forever. The pepperoni pretzel sticks are by far my favorite. Normally an awesome afternoon bar crowd and good music. Never had a bad experience.", "date": "Jan 18, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This place needs to be a must go to on every south siders sports bar list .  Great food, the salads, burgers, blackened shrimp tacos are amazing.  The entire staff is friendly and on their game.   Hopefully you'll be able to check this place out when Nicole, Brittany or Rachel are tending bar.  They do an amazing job not only mixing drinks but making you feel well attended to and they're all super nice.    The owner Joe is a stand up guy to boot! Check it out.", "date": "Jan 12, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "I recently visited The Whistle Sports Bar & Grill on Oaklawn and had quite of an experience. From the moment I walked in, I was impressed with the atmosphere and the friendly staff. The Whistle is a sports lover's paradise, with numerous large screens displaying various sports games, creating an energetic and exciting ambiance. The menu at The Whistle offers a wide range of delicious options for both food and drinks, but I had my eyes on the Mango Habanero wings, the perfect meal for a sports bar. As someone who loves the combination of sweet and spicy flavors, I was excited to try the Mango Habanero Wings. However, I must admit that I didn't quite deliver the mango flavor that I was expecting. The presentation of the wings was appealing, with a generous serving of wings that were cooked to a nice crispiness. The sauce had a bright orange color, with Mango chunks which looked promising. As I took my first bite, I was expecting a burst of sweet and tangy mango flavor, followed by a kick of habanero heat. However, the mango flavor was subtle at best, and the habanero heat dominated the taste profile. Despite the lack of prominent mango flavor, the wings were still tasty. The habanero sauce had a good consistency and clung well to the wings, providing a sticky and flavorful coating. The wings themselves were cooked well, with a nice crispy texture on the outside and juicy meat on the inside. One of the highlights of my visit to The Whistle was the friendly and welcoming staff. They were attentive and made sure that our dining experience was enjoyable. The sports bar atmosphere was lively and fun. The Whistle also has a great outdoor patio area, but it was too late into the night for us to try it out. I highly recommend The Whistle Sports Bar & Grill on Oaklawn. The food was delicious and the atmosphere was energetic and welcoming.", "date": "Feb 18, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "THEY DONT APOLOGIZE FOR ANYTHING, ITS ALL YOUR FAULT!!!!!The service sucks.There is no ambiance.The food is far below the average gastro pub.Asked for a table to be cleaned off because it was clearly filthy, the bartender told me I could just sit somewhere else.I've been here before and dealt with the ignorant service but yesterday 11-29-23 I went with my mom and the disrespect was too much that we simply said thank you and left (not that it mattered to them one bit)Honestly just take the drive and get out of the suburbs and head to the city.", "date": "Nov 30, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Hmmm okay this isn't a spot I'm gonna travel across state lines to go to, let's be real, but if I'm in the neighborhood, I'm going. The drinks were pretty good, I had the Casamigos margarita in the travel cup, I would've preferred if it was stronger, but it was yummy and I love a freebie. I had the lunch sized nachos, delicious and a nice portion. Order. Them. I tried the fried shrimp, but I would skip getting them dipped in their sauces, they were too salty for my liking, and I would get them on the side. The service was great, our server at the bar was nice and very attentive, she would get a 5/5 for me.", "date": "Oct 27, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Great food and great service. The staff is nice and attentive. The food is pretty good for bar food. Plenty of tvs to watch the games. The drinks have a pretty good pour to them.", "date": "Feb 5, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Quality sports bar/restaurant in Oak Lawn, right on the main strip of 95th street. They have a lot of space, basically 2 full rooms, with plenty of TVs and tables and bar seating. We came here for the NFL opener and did not disappoint. Though if you're going to have a group for a big sports event, be sure to get there early to get a table. They have a great craft beer list for a sports bar, I had one I'd never had before. And the food list is above average for the type of place. I got the fried bologna sandwich (which you rarely see) and it was reasonably priced and big portion and tasty. We also got loaded fries and chips and salsa apps for the table, also very good. Despite the crowd our servers came around a good amount and service wasn't slow. Idk if there's a parking lot in back but i just parked on 95th no problem. I'd definitely be down to watch another game here.", "date": "Sep 14, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Delicious food! Service could have been a bit quicker but it was a crowded night. Overall, had a wonderful time!", "date": "Feb 21, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This place was fully packed! Lots of TVs for sports fans and very lively atmosphere. Got Hot wings and Mango Habanero which were both spicy and delicious big peices for a fair price. The Veggie pizza was absolutely delicious but careful it does come out fresh and HOT!!! We both burned our tongues a little lol The service was quick a friendly they made certain we were heard. Definitely a cool spot to check out.", "date": "Sep 11, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Yummy food and drinks! Went here last night with my husband and toddler. I had a Valentine's drink. Was delicious. Ordered 2.Hubby had an IPA on draft. We ordered food but I forgot to take pics (except for the pic of my drink).I had the buffalo chicken wrap w/Cajun fries. Yum! Also added honey mustard. So good.Hubby had nachos and they were delicious too.Baby girl just ordered fries and orange slices lol", "date": "Feb 14, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "BEST FOOD JOINT! Try the Sicilian steak and egg sandwich you won't regret it ‍ I try to get this breakfast Sandwich every week! It's delicious and the seasoning is never lacking (which you'd be surprised how even just salt and pepper is lacking in a to of places now a days) anyways 10/10", "date": "Jan 28, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Don't sleep on the breakfast subs. They're served all day, which is nice, as I love breakfast for dinner.", "date": "Feb 12, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Maybe as a transplant I don't know Italian beef well enough, but I found my Italian beef here to be less flavorful than other places I've been to. It could very well be that it was less fatty than other ones I'm used to? I'm not sure, but I wasn't as impressed as I thought I'd be. Still great - don't get me wrong. I feel like I need to come back here and also try other things! The staff were friendly and rang us up quickly even though there were a decent amount of people in this little place.", "date": "Sep 21, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "This is my \"go to\" Italian Beef place -- no other.  I even buy it by the pound for parties.  Beats all others!", "date": "Feb 15, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Best beef in Chicago.  I even buy pounds of it for parties.  Everyone loves it.  My favorite is beef and sausage combo with cheese fries.", "date": "Jun 8, 2021Previous review", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Hungry for a Italian beef or combo? If on the southwest side, you have to go to Tony's. First time I've had the chance to experience this legendary place . A bit pricey ( combo meal was $16.07) but well worth it. Fries were fantastically seasoned with something. It wasn't Old Bay, and it wasn't regular sea salt . I could've made a meal alone on that. The combo I ordered dry with sweet. Honestly think I may get 3 meals out of it, it's so huge. Quick service for the combo, I was in and out in 6 minutes despite the restaurant having a line. Better served for Carey out however it does have about 6-8 barstools for dine in", "date": "Oct 7, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Can't go wrong here. Attention to quality and taste. Great value and awesome service.", "date": "Jan 20, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Excellent beef sandwich's  owner real nice guy, Highly Recommended!Pizza is just as delicious!", "date": "Dec 1, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "This is a literal hole-in-the-wall restaurant where you can get authentic Italian beef. The beef is well seasoned and incredibly juicy. The prices are very affordable.", "date": "Oct 16, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Food was very tasty and very reasonably priced. The shakes were as much as the sandwiches so maybe skip that part! Service was fast. It seems to be a carry out place so ambiance is a moot point.", "date": "Dec 28, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "I always appreciate that when in town I am able to run to Angie's Sports Bar & Pizzeria where Robbie and his staff take care of my stuffed pizza. First couple of times I had to explain what a vegan pizza was but they have now gotten the hang of it and have even informed me that they are seeing more 'veggie', 'cheese free' orders come in. My go to places in the Chicago area to get my fix of Stuffed (Deep Dish) Pizza!", "date": "Dec 26, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Great friendly service. Good food and drinks they also have a nice outdoor dining space", "date": "Jun 7, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Great place love the chicken wings and the ambience is real good peaceful relaxed service is great. Not that bad lol it's a good place. Good food great service the first time we went to eat there. The owner actually welcome to us and gave us a discount on our food bill and ever since then whenever we get a chance we dine in it's not that far from my home, and I hope he stays open for a very long time", "date": "Nov 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "This place is a neighborhood gem.  I work at a nearby school.  We had a retirement party here and I tried the pizza.  It was delicious. It's in the same class as Vito and Nicks.  What makes Angie's the best is the can do service.  During the retirement party the employees kept track of milt tabs snd provided friendly service.  I returned here on my own for lunch.  I called kind of last minute for a call ahead pizza order.  The owner answered and said no problem.  I arrived and he immediately brought me a coke because I mentioned it in the phone.  The pizza came out right on time.", "date": "Feb 16, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "I have been coming here for a couple of years, and one thing I have learned, that no matter what food I order, it's always consistent, from the pizzas to the burgers, and everything on the menu, is made to perfection, it does take two hands to handle this whopper of the burger, overall, Angies is a place to relax and enjoy with some friends, Angies has a good selection of beers on tap, from domestic to imported, they are always cold, and with their 13 tv's you will never miss a game, Robbie and his great staff, are always attentive on your needs to have an enjoyable visit,  bon appetit.", "date": "Dec 21, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "It's Wednesday and I ordered a pizza on line. The pizza arrived cold because the driver could not find my house which was down the street from the restaurant. I called and spoke to the manager who told me online orders were DoorDash and basically insulted and chastised me for not calling the restaurant. He alleged ALL online orders regarding less the pizza establishment is DoorDash. DoorDash said I had to call the restaurant. I called the restaurant and now he says I ordered through menu. It's late, had a long day at work and I'm tired. I hung up on him and threw that nasty looking sh!t in the garbage", "date": "May 17, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Been so many years because I moved away. Had it again last night and the pizza is soo good, as it always was!", "date": "May 6, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Nothing to rave about They rationalize the food like they were saving  Ingredients here ingredients there decent presentation but not my top 5 nor top 10", "date": "May 12, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Their \"Sophia Loren Pasta\" was so unbelievably out of this world that I nearly wept when I was done. Just the right amounts of everything: cream, tomato, bacon chopped so fine it was like a halo around the pasta. Sauce not too sour and not too sweet. Pasta served al dente, just like I like it! The cook here REALLY understands old world family style Italian cooking. Sometimes it's the little things you do to tweak a recipe that makes it a favorite. Served with nicely toasted grill-marked Italian garlic bread. Went on a Saturday night. Came for the band, which was excellent, but really stayed for the food. ;) Decently priced wine, beer list endless and on-tap specials. Brother had the thin crust pizza. I swiped a slice, next time coming back for sausage & green pepper. Good thing I don't live close to this place otherwise I would probably eaten my way through their menu by now. Vito & Nick's should give it up. They were over & out when they franchised and stopped giving a shit about their customers. Angie's is in touch with reality. They respect their customers. The bartender knocks herself out to serve not only drinks but food and covers the whole room so everybody is happy. At least, I went home happy, and I have not felt that way in a long time, and if a small place like Angie's can crank out that kind of food & service every day, then it's worth the trip. I don't know who the owner is, but buddy, you've got a great thing going there, and seeing as the place was packed to full capacity at 7:00 p.m. on a Saturday night when there are a zillion restaurants from 83rd through Hometown, then that's saying something about the way you run your business. I like drinking and hanging out with the salty of the earth. I WILL be back!", "date": "Oct 6, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Angie's Sports Bar & Pizzeria", "alias": "angies-sports-bar-and-pizzeria-chicago-2", "text": "Amazing pizza. Amazing service. Amazing staff. The nicest people with the best food ever. We stumbled upon this place but will definitely be back many times.", "date": "Aug 18, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 4.0}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Can't wait to try this place out! I've heard great things from the great food to the great customer service.", "date": "Jan 27, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Service is horrible!!!! Save yourself the trouble this place is not worth your money.", "date": "Feb 14, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "I've been here twice now and the food is ok. I gave them an extra star for the service and their prices are pretty good too. We were seated immediately, and we ordered pretty quickly, too. The waitress gave us options on combos and specials that would help with prices. We ordered a variety of items. Snow crab, king crab, lobster tails, fried fish, & mussels. On a prior visit, I had the fried chicken wings and fried crablegs. I would rate everything a 3.5. But I pushed it to 4. The sauce in my crab bag was kind of bland and just ok. I had nonspicy. I probably should have gotten some spice. But yeah, check them out!", "date": "Jul 19, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Unassuming place with lots of options for some tasty seafood. Don't miss the garlic noodles...but they are GARLIC noodles so be prepared! Good service too.", "date": "Dec 13, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "$250 for dinner and 3 drinks? I mean I guess it okay. The shake special I liked but nothing about the price (before tip) can really be justified. The ambiance is interesting, it's super dark, lights low and the music low. Almost like it's supposed to be romantic but really it's not lol idk. Can't put my finger on it but I wasn't impressed. Staff was nice though. Very.", "date": "Mar 10, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "Food was good. The green lipped mussels were too big to eat in one bite and no knives available.Maybe I would try them again but they have a few problems. Styrofoam plates and cheap plastic forks. Doesn't work for me with a $70 bill for 2 people. 1 bottle of wine $5 grocery store purchase for $29. Crazy markup on cheap wine. They really should stock a few bottles of decent wine. If this wasn't a new place, I'd give it a 3*, but I'm hoping they're working out the bugs and will deserve the 5* their food is. One more concern is an automatic 18% tip. It's not a tip anymore it's a surcharge.", "date": "Aug 15, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "We love this place! We had king crab legs, snow crab legs, shrip, corn, potatoes, and their garlic French fries.   Our experience was fantastic! The food tasted fresh, and it was super delicious. We chose lemon butter, medium spicy, and it was the bomb. The drinks were so good too. Over all the the service was awesome. It was our first time, and our waitress was super patient, informative, very helpful, and overall, she made the whole experience very pleasant. Definitely recommend this place and we plan to be back very soon.", "date": "Feb 6, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "It's our first time here today. We've driven past this place many times, and finally got around to trying it. It used to be Buffet City, and I came here with my parents many times growing up. They've kept some of the interior the same, but they've modified it to be more of a seafood boil vibe. Our server was really sweet and friendly. She came to check on us several times throughout despite being the only server around 3pm and watching 5+ tables. I can see why it's so busy because the food is delicious, and the price is not bad. This place gives you the bibs and gloves -- some places will charge you extra for a pair of gloves. She helped us store our cake in the fridge and brought it out after we were done with our meal, which I appreciate. She also gave us a knife, plates and utensils without us asking. We came to celebrate my birthday early, and she even wished me a happy birthday. There's plenty of free parking on premise, and they also allow you to easily make a reservation online through OpenTable which is super convenient. I didn't have to make one, but I find that it was nice being able to walk in and have them expect me and my party. They were really patient with my parents not speaking English and also respectful of their health restrictions needing a boil only. My dad ordered the beginner combo, my mom ordered the seafood shake classic, my partner ordered a gumbo laya, a veggie boil with lemon pepper and mild spicy, and I ordered their pick 2 daily special (1/2 lb shrimp head off, 1 cluster of snow crab legs) with the special blend and medium spicy which really gave it a kick. We also ordered a basket of beignets to share, and they were so delicious -- crispy on the outside and soft on the inside and the powdered sugar was perfect. An order comes with 10, and it was plenty for us to satisfy our cravings. My parents and I both thought the sausage in her bag was salty as is, even though she did a plain boil. She said she'd opt for a pick 2 next time and same with my dad. We all enjoyed our meal. I'd recommend this place to anyone in the area looking for seafood boil, fresh seafood made to order, and at a decent price.", "date": "Aug 1, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "I was near by visiting the beauty supply store, My brother was with me; he loves crab boils, so I went inside and grabbed a menu. I took a look at the menu and noticed they had beignets, I was pretty excited because I had been wanting to try these forever. So I ordered some and my brother ordered his food. I also ordered some seasoned corn on the cobb.He seemed pretty happy with his food but after leaving I noticed, what I ordered was not what I expected. Instead of authentic beignets, like the one's in Louisiana, like I expected; I received what some would call, Chinese donuts. I was pretty bummed but I had already left so there was nothing I could do. My 2nd visitI went in to get the seasoned corn I tried last time because I thought it was good, to my surprise it wasn't what I ordered, It was just regular corn. I was bummed AGAIN. I guess I would say, make sure you are very exact and clear with the person taking your order and try to check your food before leaving the premises.", "date": "Mar 27, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Crab King Cajun Boil & Bar", "alias": "crab-king-cajun-boil-and-bar-oak-lawn", "text": "On my Impromptu trip to Chicago, we had a craving for crab legs. In searching the many reviews and the ones pretty close by, we came across this place. It was on a strip mall and the inside looked like it had a lot of Oriental decorations. Very beautiful place. Colorful.  Dry spacious as well. They also had a full bar inside as well. It wasn't crowded when we first got there but then all the people started coming. The prices were pretty similar to all the other places, but definitely worth it. The food was so good. We ate absolutely everything. The food was full of flavor and was cooked perfectly. My son got calamari and loved it. He ate pretty much all of it along with his fries. One cool thing was that on the kids menu, they had buttered noodles. I thought that was cool because a lot kids love noodles and that made it easier to dine for picky kids. I highly suggest this place when you are in the area. I will definitely be back when I'm in town.", "date": "Sep 6, 2021", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "It's not 5 stars compared to West Loop or top restaurants in big cities but for evergreen park it's 5 stars easily. I don't have to drive far to have a quality meal because of this place. The service was great. The outdoor seating is nice and not too loud. My only recommendation is adding a ribeye or filet mignon to the menu. Skirt steak is a common Latin staple but it is usually too chewy for my liking unless it's super fresh and perfectly cooked. The enchiladas were perfect the rice was great. The house margarita was great. My wife liked her food. Keep up the good work! 100 bucks well spent.", "date": "Sep 4, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Let me start by saying the food is super delicious. I would have given the location 5 stars if the portion size was larger.  Meaning, I shouldn't pay $9 for the Salsa Trio and only get 1 small bowl of chips.  We had so much salsa left and no chips to eat it - without paying for a refill. Back to the rest of the amazing food. You must try the Elote Fritters.  The elotes are shaped in a circle disc and lightly fried and topped with mayo, cotija cheese and tajin. We also ate the Carnita Empanadas, which has Coca-Cola braised pork shoulder. I ate the chicken enchiladas for the main entree.  This has 3 small enchiladas that comes with flavorful rice and beans. Oh... the drinks! I tried the I Love Lucy. It has vodka, lime, strawberry puree and soda.  The ingredients are simple, but the flavor was delicious and powerful. Unidad is a small dining location. There isn't a parking lot or valet, but there's a good amount of street parking; especially weeknights. It's best to make reservations through the website. I would definitely go back, possibly for happy hour and eat tacos.", "date": "Dec 17, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "1st time here and our server Laura was also new. Started with Housemade Guacamole. It was fresh but chips a tad oily. Corn fritters were delightful. Arepas were delicious. I had the beef and chicken. I was disappointed it didn't come with rice n beans but the plantains did suffice. The atmosphere is the selling point. Although tvs on at the bar and surround music throughout it was never too noisy. Fast service and steady flow of patrons. I will be back to try some of the other offerings.", "date": "Jan 27, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Absolutely delicious! I was very impressed Not only is the place beautiful, the food preparation was on point every plate was made with care. And as soon as you walk in they ask you about any allergies. The menus are marked gluten free. And vegan.  I was reading the reviews before I went there and one of the reviews said  eat before you go there, well if you're looking to get full plan on ordering appetizers portions are small.. it'd be a perfect place for a gentleman to take a female on a date Not only well she be impressed with the ambiance. She will not be too full to do any extra activities after a date... Okay so let's get to the food we started off at the guacamole. I swear it might be a little bit over 6 oz. It's not a lot but it was good. Then we ordered the  fundido It was good.  other restaurants and it's never hot enough for the cheese to melt You can't get the chip in there. We then had the elote fritters. Those were phenomenal but you only get two .. I ordered the enchiladas. Not only were they delicious, the presentation of them was beautiful!... Most of the time Mexican restaurants overcrowd their plates and they kind of look sloppy they take their time to prepare the plates. We also had the arepas we picked the mix ed consisting one of delicious beef and the other one had chicken in it but I hate to say it kind of tastes like chicken salad I never had them before. So again, I don't know what they should taste but they were accompanied by the fried plantains. Those were excellent..And I certainly took home the tres leche cake It was a little bit too sweet for me But they did hit the spot This gets to my last part of my review I want to thank kolby He was exceptional. Without a good server, it doesn't matter to me how good the food is. It seems I had a winning night parking could be a little difficult there but also for the summer they have outdoor dining which is a plus ..", "date": "Feb 12, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "This is a Latin restaurant and bar located on 95th St., and Evergreen Park parking is available on the street as there is no designated parking lot. The restaurant is small on the inside and has a large patio for alfresco dining when it's warm outside. The menu selections are all small plates. They offer a happy hour during the week with lots of food and drink options. This restaurant gets five stars for customer service. The hostess and bar maids are amazing. The manager also checks in on food and service received while dining, if you're in the area stop by, you will not be disappointed", "date": "Jan 7, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Went for vday with my mister on a date nice atmosphere very romantic candles ! Service seemed a lil slow but there was only one waitress for the patio which was about 6 tables of people. Food was limited to there vday menu which was very pricey for the size but it was delicious. Waitress gave us complimentary dessert which was brown sugared plaintains with ice cream fire !! Amazing will try again full bar ---but no micheladas at a Latin restaurant? and only craft beers so they get a star taken away", "date": "Feb 21, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "It's a very clean and intimate setting on the inside.  We wanted to sit outside but it was too cold.Once seated, we ordered drinks and noticed how service was severely delayed. We were finally able to order appetizers, and even that was slow to arrive. The Queso Fundido appetizer was delicious! I highly recommend it!I feel like Service would've been so much better if there was more than just one waiter for the entire dining room on a Saturday night! All customers seemed to be waiting for their food! Our reservation was at 7pm. The restaurant closes at 9pm. We didn't even have time to order entrees because everything was delayed (service and food) and we would basically be receiving entrées at the same time they close their doors. So we left and ended up grabbing food in the way home.  Such a disappointing experience.", "date": "May 2, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "My girlfriends and I had an amazing dining experience at Unidad. The atmosphere was very nice and the food was delicious; we started with empanadas, had birria tacos and fish tacos for entrees, and finished with tres leche for dessert.  We received wonderful service from Laura, who made great recommendations, and Omar, the bartender, also made great recommendations and delicious drinks.  i look forward to going back very soon.", "date": "Jan 29, 2024", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "Laney was amazing The drinks was phenomenal and the food was authentic and has fresh ingredients. It's on our list for a return visit.", "date": "Aug 4, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "UNIDAD", "alias": "unidad-evergreen-park", "text": "The girls and I were at it again! Saturday Night Birthday Shenanigans! What's for dinner? UNIDAD! What's on the menu? Diablo Shrimp and Birria Tacos! You can't go wrong with great conversations and Latin Food. UNIDAD provides the atmosphere and space for both. You have to try the Diablo Shrimp! It's spicy with just enough kick to wake up your taste buds. Even the House Made Churros with ice cream and Dulce de Leche was the perfect dessert dish to cool down the heat of the shrimp! Although the churros were nice and warm:-)Our server was super nice and laughed at my jokes. He showed great customer service and kindness. He helped to make our dinner enjoyable and fun. I recommend making a reservation, especially on weekends, to try this restaurant. This is a great place to dine in Evergreen Park!", "date": "Jan 21, 2023", "is_closed": false, "address": "Evergreen Park, IL 60805", "rating": 4.4}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "yummy food service is slow but worth the wait   would be nice to sit in and have cocktails", "date": "Feb 21, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Oxtails too salty and too tough to chew, served with stale coco bread, which I tossed the dinner. Plantains missing from my order.  Thankfully, I checked my order before leaving because there is a sign posted advising customers to do so due to their \"No Refund\" policy. I expressed to the cashier the plantains was missing, she had an attitude.  Her patience was short on Sunday, November 19, 2023. Then the plantains tasted like it was cooked in old grease.  Overall, the customer service can be more welcoming.  The food is hypertension salty and not tenderized.   The restaurant is set up for takeout only which is totally fine.  The floor was clear of debris.  No riffraff hanging out in or outside.", "date": "Nov 20, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I wanted some turkey tips really bad so I ordered here thru Door Dash. The order took longer than expected and the dasher waited about 20 minutes after arriving for my order. I ordered turkey tips (comes with red beans and rice), mac n cheese and cabbage. The food was pretty good. However the turkey tips were insanely spicy. I couldn't eat more than 5 pieces. I know jerk is hot and I can usually handle it but not here unfortunately.  I'll stuck with turkey tips at barbeque places only. All of the sides were good and I got full from the 3 so it wasn't a total loss.", "date": "Oct 10, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I went here ready to order my food only to find out most of the items aren't sold there anymore or they ran out. Also the cashier was holding a inappropriate personal conversation while on the register, as I was trying to order my food. His response to me came off as sarcastic and as if he's simply didn't want to be at work. I will never give this place my business", "date": "Nov 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Out of rice & bean, out of gravy, out of cabbage, $22 for 3 pieces of chicken, a scoop of Mac n cheese and a scoop of greens. Not at all worth the cost or the wait time. I should have known better when I came in on a Sunday evening and the place was empty. The place used to be packed all the time but I guess others have gotten the same lack luster food and service and have decided to spend their money elsewhere. They also need to spruce up the place. Looks old & worn down & like they haven't mopped in months. Don't waste your time or money!", "date": "Jun 12, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Good! I ordered the jerk catfish-it was flavorful and cooked perfect. The sides were good too, yams, cabbage and Mac-n-cheese.", "date": "Oct 22, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I will not be returning period!! I call myself giving them an opportunity to redeem themselves after receiving food on another occasion that was dry and tasted old. I came as soon as they opened so there really is no excuse. This food was straight garbage turkey tips look like dog scraps tendons in every piece of meat ugh!! Sides- yams way too sweet taste like white sugar mac and cheese mediocre at best. I'm done with them! Never again!!!! A FOOOOOLLLLLLLLLLL!", "date": "Aug 27, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "Asked for nearby recommendations and this was one of the options. Love that they have an online ordering system and even lunch specials before 3pm. Luckily I made the cutoff time and didn't have to commit to a dinner entree. I got the jerk chicken lunch special which came with rice & peas with the option of an additional side. I opted for cabbage and got another small side of mac and cheese. The order was ready when I picked it up and it was waiting in, what looked like, a standing heated container. It was pretty warm so that was appreciated.The chicken was good and had flavor but not a lot of spice. I was so hungry, I didn't realize until after the fact that there was a tiny container of sauce. The cabbage was cooked well and tasted okay but the rice & peas were super salty. I ate a couple fork fulls but definitely couldn't eat more. So glad I got the mac because it wasn't bad to not be baked. All in all, not a completely bad meal although I did chuckle quite a bit at the piece of white bread (not coco bread) in the bag. So Chicago, lol", "date": "Oct 17, 2020", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I was tired of cooking and had a taste for jerk chicken.  I'm not sure if the regular cook was having a bad day or a sub was working that day because the Jerk Chicken was seasoned well and the jerk sauce was flavorful but unfortunately my wing dinner was not completely cooked.  You could still see the blood inside the wing when you broke it open no, no, no that's not acceptable. This was disappointing because the red beans and rice were tasty and so were the yams.  But and yes there is yet another but .... the Mac and cheese was bland.....no seasoning and not cheesy and the collard greens were bland, they lacked flavor. There is a mixed bag of reviews on Yelp many love it and many give it a failing grade so maybe they lack consistency on how the food is cooked. I'm going to give them another opportunity to redeem themselves so I will be back to try the jerk tacos and the jerk pizza.  Am I a glutton for punishment only time will tell. Stay tuned for round 2!!! In the meantime stay safe.", "date": "Aug 6, 2020", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "Caribbean Jerk Palace", "alias": "caribbean-jerk-palace-chicago", "text": "I will admit that Uncle Joe's is usually my first choice for Jerk chicken. But the problem for me with Uncle Joe's is finding a parking space. Well, today I drove around the block twice trying to find a parking space, with no luck. So, I decided to give Caribbean Jerk a try.I had my doubts but I was pleasantly surprised. The chicken was fine, the cabbage tasty. The beans and rice were a bit salty but edible. I was disappointed that there was not coco bread, the Wonder bread was no substitute.Overall, a rating of 4. I will try them again with no hesitation.", "date": "Apr 1, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.5}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This has always been my favorite Friday afternoon spot for years coming after work with the guys. Love playing the slots- payouts are awesome, ice cold beers, and watching some golf. The bartenders are always willing to shoot the shit and make you feel like you've known each other forever. The pepperoni pretzel sticks are by far my favorite. Normally an awesome afternoon bar crowd and good music. Never had a bad experience.", "date": "Jan 18, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This place needs to be a must go to on every south siders sports bar list .  Great food, the salads, burgers, blackened shrimp tacos are amazing.  The entire staff is friendly and on their game.   Hopefully you'll be able to check this place out when Nicole, Brittany or Rachel are tending bar.  They do an amazing job not only mixing drinks but making you feel well attended to and they're all super nice.    The owner Joe is a stand up guy to boot! Check it out.", "date": "Jan 12, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "I recently visited The Whistle Sports Bar & Grill on Oaklawn and had quite of an experience. From the moment I walked in, I was impressed with the atmosphere and the friendly staff. The Whistle is a sports lover's paradise, with numerous large screens displaying various sports games, creating an energetic and exciting ambiance. The menu at The Whistle offers a wide range of delicious options for both food and drinks, but I had my eyes on the Mango Habanero wings, the perfect meal for a sports bar. As someone who loves the combination of sweet and spicy flavors, I was excited to try the Mango Habanero Wings. However, I must admit that I didn't quite deliver the mango flavor that I was expecting. The presentation of the wings was appealing, with a generous serving of wings that were cooked to a nice crispiness. The sauce had a bright orange color, with Mango chunks which looked promising. As I took my first bite, I was expecting a burst of sweet and tangy mango flavor, followed by a kick of habanero heat. However, the mango flavor was subtle at best, and the habanero heat dominated the taste profile. Despite the lack of prominent mango flavor, the wings were still tasty. The habanero sauce had a good consistency and clung well to the wings, providing a sticky and flavorful coating. The wings themselves were cooked well, with a nice crispy texture on the outside and juicy meat on the inside. One of the highlights of my visit to The Whistle was the friendly and welcoming staff. They were attentive and made sure that our dining experience was enjoyable. The sports bar atmosphere was lively and fun. The Whistle also has a great outdoor patio area, but it was too late into the night for us to try it out. I highly recommend The Whistle Sports Bar & Grill on Oaklawn. The food was delicious and the atmosphere was energetic and welcoming.", "date": "Feb 18, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "THEY DONT APOLOGIZE FOR ANYTHING, ITS ALL YOUR FAULT!!!!!The service sucks.There is no ambiance.The food is far below the average gastro pub.Asked for a table to be cleaned off because it was clearly filthy, the bartender told me I could just sit somewhere else.I've been here before and dealt with the ignorant service but yesterday 11-29-23 I went with my mom and the disrespect was too much that we simply said thank you and left (not that it mattered to them one bit)Honestly just take the drive and get out of the suburbs and head to the city.", "date": "Nov 30, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Hmmm okay this isn't a spot I'm gonna travel across state lines to go to, let's be real, but if I'm in the neighborhood, I'm going. The drinks were pretty good, I had the Casamigos margarita in the travel cup, I would've preferred if it was stronger, but it was yummy and I love a freebie. I had the lunch sized nachos, delicious and a nice portion. Order. Them. I tried the fried shrimp, but I would skip getting them dipped in their sauces, they were too salty for my liking, and I would get them on the side. The service was great, our server at the bar was nice and very attentive, she would get a 5/5 for me.", "date": "Oct 27, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Great food and great service. The staff is nice and attentive. The food is pretty good for bar food. Plenty of tvs to watch the games. The drinks have a pretty good pour to them.", "date": "Feb 5, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Quality sports bar/restaurant in Oak Lawn, right on the main strip of 95th street. They have a lot of space, basically 2 full rooms, with plenty of TVs and tables and bar seating. We came here for the NFL opener and did not disappoint. Though if you're going to have a group for a big sports event, be sure to get there early to get a table. They have a great craft beer list for a sports bar, I had one I'd never had before. And the food list is above average for the type of place. I got the fried bologna sandwich (which you rarely see) and it was reasonably priced and big portion and tasty. We also got loaded fries and chips and salsa apps for the table, also very good. Despite the crowd our servers came around a good amount and service wasn't slow. Idk if there's a parking lot in back but i just parked on 95th no problem. I'd definitely be down to watch another game here.", "date": "Sep 14, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Delicious food! Service could have been a bit quicker but it was a crowded night. Overall, had a wonderful time!", "date": "Feb 21, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "This place was fully packed! Lots of TVs for sports fans and very lively atmosphere. Got Hot wings and Mango Habanero which were both spicy and delicious big peices for a fair price. The Veggie pizza was absolutely delicious but careful it does come out fresh and HOT!!! We both burned our tongues a little lol The service was quick a friendly they made certain we were heard. Definitely a cool spot to check out.", "date": "Sep 11, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "The Whistle Sports Bar & Grill", "alias": "the-whistle-sports-bar-and-grill-oak-lawn", "text": "Yummy food and drinks! Went here last night with my husband and toddler. I had a Valentine's drink. Was delicious. Ordered 2.Hubby had an IPA on draft. We ordered food but I forgot to take pics (except for the pic of my drink).I had the buffalo chicken wrap w/Cajun fries. Yum! Also added honey mustard. So good.Hubby had nachos and they were delicious too.Baby girl just ordered fries and orange slices lol", "date": "Feb 14, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.0}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "BEST FOOD JOINT! Try the Sicilian steak and egg sandwich you won't regret it ‍ I try to get this breakfast Sandwich every week! It's delicious and the seasoning is never lacking (which you'd be surprised how even just salt and pepper is lacking in a to of places now a days) anyways 10/10", "date": "Jan 28, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Don't sleep on the breakfast subs. They're served all day, which is nice, as I love breakfast for dinner.", "date": "Feb 12, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Maybe as a transplant I don't know Italian beef well enough, but I found my Italian beef here to be less flavorful than other places I've been to. It could very well be that it was less fatty than other ones I'm used to? I'm not sure, but I wasn't as impressed as I thought I'd be. Still great - don't get me wrong. I feel like I need to come back here and also try other things! The staff were friendly and rang us up quickly even though there were a decent amount of people in this little place.", "date": "Sep 21, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "This is my \"go to\" Italian Beef place -- no other.  I even buy it by the pound for parties.  Beats all others!", "date": "Feb 15, 2024Updated review", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Best beef in Chicago.  I even buy pounds of it for parties.  Everyone loves it.  My favorite is beef and sausage combo with cheese fries.", "date": "Jun 8, 2021Previous review", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Hungry for a Italian beef or combo? If on the southwest side, you have to go to Tony's. First time I've had the chance to experience this legendary place . A bit pricey ( combo meal was $16.07) but well worth it. Fries were fantastically seasoned with something. It wasn't Old Bay, and it wasn't regular sea salt . I could've made a meal alone on that. The combo I ordered dry with sweet. Honestly think I may get 3 meals out of it, it's so huge. Quick service for the combo, I was in and out in 6 minutes despite the restaurant having a line. Better served for Carey out however it does have about 6-8 barstools for dine in", "date": "Oct 7, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Can't go wrong here. Attention to quality and taste. Great value and awesome service.", "date": "Jan 20, 2024", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Excellent beef sandwich's  owner real nice guy, Highly Recommended!Pizza is just as delicious!", "date": "Dec 1, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "This is a literal hole-in-the-wall restaurant where you can get authentic Italian beef. The beef is well seasoned and incredibly juicy. The prices are very affordable.", "date": "Oct 16, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Tony's Italian Beef", "alias": "tonys-italian-beef-chicago", "text": "Food was very tasty and very reasonably priced. The shakes were as much as the sandwiches so maybe skip that part! Service was fast. It seems to be a carry out place so ambiance is a moot point.", "date": "Dec 28, 2023", "is_closed": false, "address": "Chicago, IL 60629", "rating": 4.5}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "picked up fry the coop and was amazing! great customer service .. mild has a perfect little kick to It. Love the chicken and cheese! Will definitely be ordering from here again!", "date": "Jan 14, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Have only had Nashville chicken sandwich and seasoned fries. Both are so good. Nice how you can choose spice level for any type of chickenService is great! Only get take out but pretty quick. Employees are so nice. Ambiance is nothing special.", "date": "Jan 23, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "I feel like I reviewed this place before, but I don't mind doing Jr again, lol.  I love a spicy sandwich, and this is one place where you can get one.  They have heat levels, so you don't have to fear struggling through it, lol.The fries can be a hir or miss.  Your best bet is getting the seasoned fries and dipping them in the cheese sauce (making myself hungry just thinking about this, lol.The service is pretty straightforward since it operates similar to a chain restaurant.  Fortunately, it isn't like they are just shooting the breeze. They take your order, and they are putting in the work to get your order to you timely.", "date": "Dec 8, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Hot spot love this for any day pub like atmosphere and chicken is always fresh and fries are addicting always recommend this spot", "date": "Feb 21, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "burgers are nice and juicy, fries can be to salty, seasoned fries had a bit to much salt for those who don't like salt. service was OKAY, waiting times wasn't long. Ranch is NOT FREE. The coop sauce wasn't bad. The bathrooms were slightly confusing do the fact that it said \" We Don't Care\". overall the reasturant was well.", "date": "Feb 18, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Service was much to be desired. The chicken sandwich was good but nothing special. The fries were particularly awful and over cooked. Probably wouldn't come back as I'm more of a service guy and while the lady taking the order wasn't mean, you could barely hear her and it just felt painful and awkward.", "date": "Feb 6, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "I've been to this place many times and I've come to the conclusion that you should NOT get takeout. Food quality goes way down. I spent $17 on a sandwich and fries. Fries were dried out and they gave me fry scraps it seemed. On a different occasion I got the tenders for takeout and they were dry. The oven/heater that they store their food dries it out. My dine in experience is 5 stars but giving 3 stars because if you can't offer quality take out, don't offer it.", "date": "Dec 22, 2023Updated review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Diamond, thank you so much for the review.  It is true, our food is 10 times better for dine-in vs take out.  Fried Chicken and French Fries are always better when it fresh out of the fryer.  We always recommend dining in but would never deny a customer who requests an order togo.  Please consider updating your review, these reviews really hurt our small business.  There is a lot of ppl that have their lively hood relying on our small business.  Thanks for the consideration.  We are grateful for your support! ", "date": "Oct 21, 2021Previous review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Look. If I never tried their dry a** chicken tenders, this would be a five star review! I tried the tenders twice and both times were a fail. But their chicken sandwhichesssss?! Hands down they have the best chicken sandwiches I've ever tasted! But these tenders almost made me give them 3 stars! Go for the sandwiches and make sure you carefully choose the level of heat bc it gets SPICY.", "date": "Feb 19, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Fry the Coop", "alias": "fry-the-coop-oak-lawn", "text": "Pre-pandemic, Fry the Coop was a favorite local-ish place to go when nursing a hankering for hot chicken. I hadn't been to this location but when I was down on the south side anyway I thought this would be a nice treat since I haven't been there in over three years, since before the pandemic began. It's still good but there have been some changes.Prices have increased, of course. That's an overall given. But surprisingly, there are no sides included with your meal. I suppose this shouldn't really be a surprise since most fast-food type places don't include a side with your meal, but FtC did used to include fries with your chicken, I'm pretty sure. On the other hand, if you go to other fast food places it's cheaper. So with the cost of the chicken PLUS the cost of any side (fries were $4!), it gets a bit steep pretty quickly.But luckily it's still really good. They have six heat levels here, and from past experience I know that the third level is plenty for me. It's spicy and can leave your lips tingling, but also you can taste a bit of sweetness too. Fries are good; they may be homemade?This location has outdoor seating as well for those warmer months. There's also a small parking lot which maybe could get hard to park when it's busier, since there are other businesses here as well, but it's possible you could park on the side street along here too.", "date": "Feb 12, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "A true south side staple known for their sweet sauce.I'm no stranger to Palermo's. Love their food. They're great for parties as well. Their roast beef, pasta, salad, and everything is delicious. Only downside is they have Pepsi products and I prefer Coke. Other than that, Palermo's will remain a favorite. This place is so good my family has us get par baked or frozen pizza to travel with.", "date": "Jan 22, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "We're happy you enjoy our food, Tiffany! Knowing our roast beef, pasta, salad, and pizzas are popular at your parties is wonderful. We note your preference for Coke over Pepsi and will consider this. It's touching to learn our pizzas accompany your family's travels. We look forward to serving you again soon.Palermo's 95th Italian Cuisine ", "date": "Dec 11, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "Stepping into Palermo's on 95th is like being transported to a lively Italian family gathering, bustling with warmth and joy. The ambiance immediately wraps you in nostalgia, reminiscent of old-world Italian charm. However, amidst the lively atmosphere, a couple of notable aspects affected the overall experience.The noise level, while expected in a busy and vibrant restaurant, was a bit overwhelming. Conversations merged into a symphony of voices, making it challenging to engage in quiet conversation. Additionally, the mini spotlights directly over the tables slightly inhibited the ambiance, casting a stark light that detracted from the cozy, inviting feel one would expect in such a setting.On a bustling Friday night, patience is a virtue, but unfortunately, the service was slower than anticipated. While the staff was friendly, the delays were quite noticeable, impacting the overall dining experience.Now, onto the culinary highlights! The pizza was a standout, boasting a perfect crust and the sweetest sauce I've encountered on the South Side. Each bite was a testament to Palermo's dedication to authentic flavors and quality ingredients. The pasta options were seemingly endless and bursting with robust, authentic Italian flavors. It was evident that each dish was crafted with care and expertise.The menu truly offers a tantalizing array of options for pasta lovers, ensuring that every preference and craving is met with flavorful satisfaction. From classic favorites to unique combinations, the variety was impressive, and the flavors were undeniably delicious.Despite the minor setbacks in ambiance and service, the culinary offerings at Palermo's on 95th are where this establishment truly shines. The flavors evoke memories of Italy, delivering an authentic taste that is sure to satisfy any Italian cuisine enthusiast. If you're willing to overlook the noise and exercise patience during peak times, Palermo's offerings are well worth the visit for a taste of genuine Italian comfort food.", "date": "Oct 26, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "It's ok.Make sure you order the pizza with no sauce though. Otherwise you'll be like...wtf is this. \"Is there sugar and peach juice in here?!?\" Then somebody at the next table will psay, \"There sure is bud!\" All excitedly. And then you will want to just give him this weird look and say, \"excuse me, was I talking to you?\"If this happens, just get up and leave. If you don't want this to happen, then order no sauce, bring it home, peel back the cheese flaps, add your own sauce, close the cheese flaps. In doing this, you will achieve a much better pizza than Palermo's could offer on their own.", "date": "Jul 28, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "We sincerely apologize for the disappointing experience, Randy. It's disheartening that our sauce fell short of your expectations, and we value your unique recommendation for enhancement. We're constantly seeking to improve our dishes. We look forward to the opportunity to impress you in the future.Palermo's 95th Italian Cuisine ", "date": "Sep 4, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "The food was 3 the pasta was over cooked the marina or red sauce with clams was the worst I ever had.  I do not know what spice they put it was not pairedWell the taste was so bad I did. Not eat it.  The pasta with beans was delicious,  the grilled calamari's weee accompaniment with bell orange papers and black   olives this is a new for me to have grilled calamari but not bad the eggplant Parmasan was ok but once again the spaghetti was well done not Al dente the marinara was 2 thumbs down.We also had spaghetti with a huge meat ball.The portions were very generous The service was great at the very beginning but we had to hunt for our server to get our check we came with a child and I think the service should be quicker because children can only sit still for short periods  of timeThe ambiance was so loud that you could not hear the music playing on the back ground the tables are way to close together I was elbow to elbow with the next people sitting The ambiance was way too busy I did like the fact they sat us with out reservations Our service was very accommodating and very friendly", "date": "Jan 14, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "We're grateful you had a chance to dine with us, Gina! You can always count on us for excellent service. We do want to apologize for the overcooked pasta you were served. This definitely isn't like us, and we'll be sure to get things right next time around. Come back again soon to give us another chance to wow you!Palermo's 95th Italian Cuisine ", "date": "Jan 23, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "This has been one of our go to places over the years living in Chicago. After five years living in Tennessee, we made a point of eating here during this visit. It was a pleasure to see that absolutely nothing had changed. I ordered my usual, Cioppino. Theirs is definitely the best this side of San Francisco's Fisherman's Wharf.  My wife ordered the Veal Picante, which was very tender and delicious. As always the service was on point. Our visit brought back a lot of great dining memories.", "date": "Nov 5, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "We're honored to be your go-to Italian restaurant in Chicago, John! It sounds like our cioppino always hits the spot. Looking forward to seeing you around again!Palermo's 95th Italian Cuisine ", "date": "Jul 22, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Palermo's 95th", "alias": "palermos-95th-oak-lawn-2", "text": "Palermo's is my favorite Pizza in Chicago!  I drove down from the Glen Ellyn area just to get this pizza.  I would totally give the pizza 5 plus stars.  The sauce is delicious!  That is what makes it unique.  The service the day I was there was pretty bad.  It took forever for the server to come over and when she did and took our drink order it took quite a while to get the drinks.  (10 minutes).  The ambiance makes you feel like you are in an old Italian restaurant.  If you are in the Chicago area, this is a must do!", "date": "Feb 8, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 3.5}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "My favorite Mexican restaurant in Oak Lawn for take-out. Traditional Mexican food with a slight twist. 4.5 stars for delicious flavors and relatively reasonable price. This is saying a lot for a Texan who has tasted almost a million tacos in every major city in Texas. My favorites include the fried shrimp taco and the Carne Asada burrito. I also love the SPECIAL guacamole which includes bacon bits. And I cannot get enough of the spicy green sauce. Wish this place were open earlier and later for those that work early AM shifts and late-night because it's so delicious. Though the prices are reasonable, I think that you could find cheaper tacos elsewhere for the same taste. I also don't love that I'm caught playing phone tag when my team is ordering out for dinner.", "date": "Aug 8, 2019", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "If you're a vegetarian this is not the restaurant for you. They apparently don't know that chicken is not vegetarian. I ordered enchiladas de pollo and a separate order of enchiladas de QUESO. It was a to go order so it could not be corrected by sending it back to the kitchen. When I called to advise them of their mistake they gave a lame excuse that it was the morning shifts mistake. Its frustrating that they didn't know better than to blame someone else rather than to apologize and be try to make it right. The service and quality of the food has declined over the years", "date": "Feb 4, 2024", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "Auténtica cocina mexicana, muy limpio, servicial me encanto lo recomiendo muy autentico.", "date": "Mar 23, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "Very disappointed with their version of jibaritos. Real jibaritos are made with beef steak and top with cheddar cheese and lettuce and tomatoes. If you can't have it right please take it out of your menu.", "date": "Aug 28, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "The customer service is AAA! The food is cooked with fresh ingredients. The location is great to meet family and friends.", "date": "Mar 12, 2023", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "They have an absolutely fresh and delicious vegetarian torta. I am happy that I stopped by to eat here.", "date": "Sep 23, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "Ordered for delivery yesterday steak and ground beef burrito dinners and chicken tacos. I was not expecting the green burrito shell. The burritos were average I could have used more condiments especially cheese but overall it was average.  The chicken tacos were tough and flavorless I would not order those again. The red and green sauce provided was different but tasty, the sauces added some much needed flavor to the food. I probably would not order from here again there are better options in the area.", "date": "Apr 18, 2020", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "Don't recommend this place, the last time I came here I got food poisoning, its not worth your time", "date": "Nov 24, 2022", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "This is my first time going to the place , the food was ok.m\"But I don't think I will be going back there again. I ordered nachos without  peppers,beans,  and sour cream and guacamole on the side, the young lady told me they can't put the Guacamole and sour cream on the side so I asked her can they  not put guacamole on it  at all she said yes but they can't hold the sour cream so I told her if they can't hold the sour cream can they only put a very little on it she said ok. Got home  nachos was full of sour cream and peppers. I don't like hot stuff so therefore I couldn't enjoy my food. That was$12 WASTED!!", "date": "Aug 13, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Q Sazon Mexican Restaurant", "alias": "q-sazon-mexican-restaurant-chicago", "text": "We went in to order takeout.  The woman at the front register was wearing a mask, but not over her nose.  Placed order and waited 15 minutes for the food.  When we got home we discovered one of the everything burritos had only lettuce and tomato.  No beans, cheese, avocado, or sour cream. Strike one.  One of the Asada burritos contained a piece of bone the size of your fingernail.  Strike two.  The fish tacos were tiny and had sparse toppings, but were tasty.  Overpriced at $3.99 for their tiny size.  Strike three.", "date": "Apr 9, 2021", "is_closed": false, "address": "Chicago, IL 60652", "rating": 3.6}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "The pad see ewe is delicious and flavorful!What I like most about this restaurant is that you can choose your level of spicy (mild, medium, hot). Even with medium, my meal had a good kick. If you haven't visited this restaurant yet, i highly recommend to visit. Will be visiting soon :)", "date": "Jul 23, 2022", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "If I could give it 0 stars I would, I had bought a Tom yum soup, it was all the way watered down, it was disgusting. I went back and asked for my money back the guy was mad and threw the money on the counter. So service was horrible. There was no one at the restaurant either so the vibe was pretty boring/dead.", "date": "Jan 29, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "Simple not fancy, functional and clean. The food is excellent, today I will have Boating Noodle soup, with beef, medium heat but with a side of hot sauce I can add.  If you've not been here before, be warned the hot food is really hot. Move up the spice levels slowly.I had steamed shu mai, before the soup, be aware this soup is a meal or plan on sharing.I used to work near here, first time I've been in since about a year before COVID started.Today all was very very good.Friendly staff, I'll be back again as soon as I can, unfortunately I live about 1.25 hours south of here, that's with no traffic.I certainly like this place and will drive up here again.Boating Noodle Soup with beef. Medium and I can feel the heat, I lived in Thailand for two years, everywhere else I order food hot, their hot elsewhere is not even medium here. Really great tasting, broth is very beefy. Ingredients are very fresh food tastes great.", "date": "Jun 28, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "The food is outstanding! Authentic Thai! Best in the area and I don't go anywhere else! I also bring all my friends and out of town ones here too! Not much from the street side, but you won't be disappointed with what's on the inside!", "date": "Feb 10, 2023Updated review", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "Excellent Thai food! We had the chicken satay, tender and tasty and the peanut sauce was outstanding. The crab Rangoon was awesome! Perfect little pillows of yummyness! Beef salad, Lao beef...perfect and more lettuce than I have had from anywhere else, the balance of favors was great. Next the Basil Chicken (ground), full of flavor and the heat was perfect! Cap it off with huge very reasonably priced Singha Thai beer and it was perfect! The owners were super nice and personable, our waiter was a family member Zig and he was hilarious and had extensive knowledge of the food and flavor combinations. Must try! Small cozy place and you're close to your neighbors but you can make new friends! Can't wait to try some more new dishes!", "date": "Jan 26, 2016Previous review", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "The #Hubski and I wanted to enjoy a simple Friday date night.  We absolutely LOVE this place but we always order takeout, so we chose to dine in today and man..we were NOT disappointed Hubby had orange chicken and he loved his meal.  The chicken is cooked very well, only breast prices and only super light breading If any.  There were even pegs of mandarins in the meal Now as for me, I got the veggie green curry (mild-medium spice level) over soft pad Thai noodles and honestly, it was the BEST green curry I have ever had.  The amount of coconut  milk used was perfect, making the dish Creamy and rich and it was loaded with veggies, pea pods, carrots  broccoli  mushrooms  bell pepper  basil .  Super great meal and just a simple homey atmosphere", "date": "Jun 11, 2021", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "Hole in the wall alert  When I tell you this place is the bomb.com, you need to try it.Whenever I want take out this is my place to go! Beware this place is super spicy so ask for the sauce on the side.I ordered the shrimp pad Thai 9/10. First time ordering the sap sap wings and omg I can never go back. They are soooo delicious 10/10.The spring rolls were pretty generic nothing crazy.The wait is always pretty long but definitely worth it.", "date": "Feb 20, 2022Updated review", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "Im New to the area and one night decided to give this place a try. The food was delicious. My fav were the spicy egg rolls, could have then forever.Got the chicken pad Thai (medium spice), next time I will try extra spicy. The proportions were big and tasty! The curry rice was to die for for. It was my favorite thing I ordered.I'll pass on the orange chicken, too dry. I will try this place again!", "date": "Sep 2, 2021Previous review", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "So authentic and fresh - this is a must if you have a desire to taste true Thai that has not been domesticated.  The ingredients sometimes change based in freshness and availability but that is what I love - the willingness to mix it up for the best result.  A bit of warning the egg rolls can be slight fully addictive so if you don't share well, order more.", "date": "Feb 7, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "Spicy Thai Lao", "alias": "spicy-thai-lao-burbank", "text": "I used to love this place! Haven't had it in over a year and half. I usually order the Thai chicken wings and green curry with chicken. Ordered it today and was very disappointed. The chicken made my whole car smell and they didn't even put any sauce on it. They gave me a side of Louisiana hot sauce with plain fried chicken wings that were from the freezer. The green curry had no flavor or chicken either. It was just a bunch of vegetables and curry sauce. I definitely will not be coming back!", "date": "Sep 30, 2022", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.2}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "Much better than I expected. I'll definitely go back. However, I will probably order more than the 1/4 meal bc there wasn't enough meat and the wing I got was a bit dried out. Delicious but maybe order more than you need so if you get a dry piece here or there it won't matter. Truly delicious. I told my son about it and he went. He also thought the place was a win.", "date": "Nov 27, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "Ok, the first time We came here the Business!!!!!!!!! This go round, HIGHLY PISSED OFF!!!! Chicken Burnt!!!!!! Side's Mid, and the downside is today was a terrible day to travel from the south suburbs all the way to the city to get good quality food! We spent our hard earned money and gas to get this!!!!  it was poor quality just like the weather today, and that's what they came up with.", "date": "Jan 19, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "One of the best jerk place I'm been too. Great customer service. I order from there all the time and my food be ready when I get there", "date": "Jan 30, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "Stopped in and it didn't disappoint. Jerk Chicken Dinner was filling and delicious. Will comeback and try other items.", "date": "Jan 24, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "Never had Jamaican food before.. let me tell u about this jerk chicken..I will be coming back not spicy but just right", "date": "Jun 5, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "My first time coming further west on the 9 for Jerk Chicken and I'm definitely coming back. I had The jerk chicken dinner with side of Mac and sweet potatoes. When I tell you that I scraped every morsel of food off the black tray...I was well pleased with everything.They're in my top 3 for jerk on the south west side of Chicago.", "date": "May 22, 2022", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "This a place I go to all the time for jerk chicken. the chicken is good but today was a BAD EXPERIENCE!! Today I went around 2:30ish ordered a 1/4 white with cabbage and Mac and cheese and a 1/2 white dinner with Mac and cheese, cabbage and I SPECIFICALLY SAID NO BEANS AND RICE WITH THE CHICKEN and a side of yams. The young man repeated my order and said ok I will not put rice and beans in your dinner. I get home and I had rice and beans on my plate very upset because I DO NOT EAT BEANS AT ALL, then it was a string of hair in my food. The young lady back there turning the chicken over did not have a hair net on. I tired calling several times and the phone rings and goes to voicemail. And of course the voicemail is full. I'm really disappointed with the service today.", "date": "Oct 19, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "The salmon was so good! Soft and flakes right off a fork! I liked all the sides except the string beans because they tasted like canned beans with no flavor. The rice under the salmon is a little too wet for me but still tasty! Not too spicy but a good amount of kick.", "date": "Mar 22, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "We were in the area and craving jerk food, so we came here. The girl working the counter was very friendly. The restaurant was clean. They do share a parking lot with other businesses.I ordered that jerk chicken dark dinner. It came with red beans and rice and I chose macaroni and cheese and mashed potatoes. My dinner was $12. I thought it was definitely worth the price and the food was pretty good. My only complaint was there was a lot of small bones in the chicken and kind of hard to eat at times. Portions were big on the side dishes.My fiancé enjoyed his curry chicken dinner. His was $15 and he chose cabbage and plantains.", "date": "Jan 8, 2022", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "St Bess Jerk", "alias": "st-bess-jerk-burbank", "text": "I kept driving past this place, and the wife and I finally got to try it. We've been to Jamaica a few times. Tried the jerk chicken dinner with a side of plantains and string beans. Rice is already included. The food was very authentic, and the owner was very nice. I'm going back to try the oxtail and the other sides. If you're in a hurry, order ahead. It's a long wait, but the food is fresh and definitely worth it.", "date": "Aug 16, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.9}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "Los Magueyes in Burbank is an absolute culinary gem! Stepping into this vibrant establishment, the atmosphere exudes warmth and welcoming vibes, setting the stage for an unforgettable dining experience. The ambiance is a seamless blend of coziness and liveliness, making it the perfect venue for any occasion. Whether you're catching up with friends, indulging in a romantic dinner, or commemorating a special event, Los Magueyes provides an impeccable backdrop. The menu itself is a celebration of authentic Mexican flavors, each dish a testament to culinary excellence. Our recent order left us absolutely delighted! I opted for the Carne al Carbon, and it was a true carnivore's dream. Grilled to perfection, the meat was tender, juicy, and a burst of authentic Mexican flavors. The accompaniments of fries, rice, beans, and avocado took the dish to an entirely new level. The fries were impeccably crispy and golden, offering a delightful contrast to the succulent carne. The rice, flawlessly fluffy and perfectly seasoned, added a comforting touch to the entire meal. The beans, rich and savory, served as a classic Mexican staple that harmonized with the entire dish. The attention to detail in presentation and the use of fresh, high-quality ingredients truly set Los Magueyes apart. From the first enticing bite to the very last, the experience was an authentic and mouthwatering journey. If you appreciate grilled goodness and crave the distinct flair of Mexican cuisine, the Carne al Carbon is an absolute must-try! Los Magueyes is undeniably a culinary gem, and we eagerly anticipate returning for another round of exquisite Mexican cuisine and unforgettable moments. Highly recommended for anyone seeking an exceptional dining experience with fantastic vibes and ambiance!", "date": "Feb 10, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "We've been coming to this restaurant for a while now because we really like it but with every visit it just gets worse and worse.As always we got the complimentary ceviche tostadas. We got them on one plate and ended up using paper towels because we didn't get separate plates. I got the octopus and it was hard and chewy. And my husband got a half tray of prawns which was served on a smaller plate than usual and was literally maybe 7 pieces (and cost much more than my octopus with rice and salad). On top of that the food was served on chipped plates. Also for a place that serves so many different drinks in different glasses, it's ridiculous I got my horchata in a disposable cup.And if that wasn't enough, we had our daughter with us and we got a high chair that was sticky and dirty.We enjoyed live music and our server was very nice. So that's why it's 2 stars. I don't think we'll be coming back though.", "date": "Feb 6, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "I stopped by Los Magueyes with a friend before going to a soccer game about 10 minutes away. In my opinion, the best thing about this Restaurant was their service. You were greeted walking in and thanked walking out. The server was also very friendly and attentive. The food wasn't bad, it was pretty good. They even made a special adjustment to the paella I ordered. Unfortunately, I didn't get to try any of their drinks, but they looked amazing! (My friend was still recovering from a concussion and I didn't want to drink when she couldn't). If I do return to Los Magueyes, I will definitely take a sip and update my review. A few things I didn't care for:1. No prices on the menu. Everything was subject to change. 2. The food was kind of pricey, but they do give a lot of it. 3. The welcome ceviche was already sitting out on the table when we arrived. 4. There was a fishy smell when entering the restaurant. Granted they do serve seafood. There wasn't anything too special about the decor. They have TVs and plenty of space and tables for large gatherings. The ambiance however was still rocking because of the live mariachi band going up to different tables", "date": "Aug 3, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "Authentic Mexican Seafood restaurant.  The seafood was fresh and service was amazing. We went here on a Saturday evening around 4 pm. I ordered the Red Snapper it was fresh but I thought it lacked seasoning.  The seafood pasta was rich and well seasoned. My sister ordered some fried shrimp which they don't typically cook fried, but they made them for her and disappointedly the shrimp was over cooked.  The tacos were tasty. We ordered side dishes of their refried beans and rice and it was OK.Now the pineapple frozen margaritas tasted delicious but were weak on the alcohol.  The tequila shot was on point. They have a full bar and a huge menu which was overwhelming.  I think they're trying to do too much and they should consider eliminating some items off the menu.  The music was loud and sometimes you had to talk loudly to hear each other.  The decor was interesting and they should probably consider updating the space.  This place was crowded so-they have a following. Dinner for 4 was about $225.00 and that's without tax and tip. This was more like a family neighborhood restaurant and I'm not likely to return.", "date": "May 21, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "The food is good but super over priced! Just for two people( we got the steak fajitas meals) and two pina coladas we spent $180! Keep in mind you have to tip so it was maybe a total 225$You could go to el veneno and spend way less!", "date": "Feb 5, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "Decent place. Quick service. Nice waitress. Pretty pricey but it's good food I liked it a lot. They have a live band that plays which is fun.", "date": "Oct 11, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "I would highly recommend this place, especially if you love crab legs if you love food. I would recommend this place. This is my go to place when I want seafood and it's my go to place when I want to feel special.", "date": "Jan 19, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "We've been here several times the last few years and the food is ALWAYS fire! I feel like you definitely can't get a bad meal here! Flavor is always on point and the portions are huge. I always have enough for lunch the next day. Went to pick up an order today and service was fast and friendly. We did order ahead of the dinner rush though. I had the steak and shrimp fajitas - 10/10. My daughter had the chicken flautas and she enjoyed them. We got horchatas and they weren't overly sweet. People might complain about the prices being high but it's high quality food and the steak is ALWAYS great. Other places it can be a hit or miss with steak but not here IMO. I think the prices are perfect for the quality and quantity of food you receive (dine in or pick up). 1000/10, we will definitely be back!", "date": "Feb 11, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "Excelente comida y el servicio muy bueno Faby es muy hamable y atenta y la comida super rica", "date": "Jan 8, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Los Magueyes", "alias": "los-magueyes-burbank", "text": "Presentation of drink was beautiful but the fruit wasn't fresh and it looked rotten. I also ordered the Shrimp cocktail and they do not devein the shrimp. Not deveining the Shrimp is lazy and doesn't look presentable. Go to La Valentina for a better price and presentation.", "date": "May 27, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 3.2}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Nice hidden spot with plenty of lighting and comfortable seating. The service was friendly and attentive. You can sit down and they'll bring a menu and food to your table. I had the gringa birria that was really tasty. Lots of flavor even without the included broth which is delicious. Overall a definite place to check out.", "date": "Feb 7, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "This has the best Quesa-Birrias every I got it without the cheese, but they were so tender and amazing. Whatever is in the dripping sauce it is the perfect amount of spicy and makes the Birrias so much better and juicy. The horchata was by far the best I have had. It tasted like cinnamon ice coffee. I would highly recommend this place and come here again! I am giving a four due to me only have one thing from there and did not get a chance to see how the service was as this was a takeout order!", "date": "Nov 13, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Very yummy queda-birria.  It is basically a quesadilla with shredded marinated in sauces that you dip in consomé, a delicious meaty flavored broth.  It's definitely a messy meal and a little greasy, but so flavorful and yummy.  My boyfriend got the gringa birria which is basically the same thing but with flour tortillas rather than corn.  We were both super impressed.  The restaurant is small, but quite a bit of seating.  Staff is very friendly and quick.  The virgin pina colada was so delicious and as a non-alcohol drinker, it was nice to have nonalcoholic options.  I really loved everything.", "date": "Feb 7, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "The birria tacos were perfect! Well seasoned. The perfect consommé... the chicken tacos were a bit dry. The salsas are delish. Because the birria was so good, I would give them another try.", "date": "Feb 19, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Man without a doubt this is the best food i had in my stay in chicago, i could write paragraphs on it. To start it's a small corner restaurant that's a bit hidden but all the locals know about it because it's \"the spot\", this is my GO-TO spot for chicago, i drove 40 minutes out my  way just to have some takito-holic. The staff is phenomenal, seriously they're super friendly give you suggestions and easy to get along with. Bathrooms are clean, tables are clean and everything about this spot is just amazing. The tacos are phenomenal, you can't find a better spot in the city. The alcoholic mangoneado was so smooth you couldn't tell how strong it was until you're spinning! This was amazing though! I definitely suggest trying this restaurant if you're in chicago even as far as going out of your way for it!", "date": "Oct 25, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "We loved our meals!! You need to get your tacos and burritos with a cheese wrap because it's super cheesy. We took a gallon of pozole home for the kids because it was so yummy. Thank you very much for a great experience with awesome service.", "date": "Feb 2, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Great food and great customer service. I came in during my hour lunch break, 5 min from the job. Greeted immediately as I was a walk in expecting to sit down and have my lunch, and was the only person sitting down. Everyone else ordered Togo. Def recommend and will bring friends next time.", "date": "Jan 9, 2024", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Cute 'lil taco joint in a strip mall. No parking problems. Very clean inside. Seems to be a family operation, sweet young lady at the front counter, couple of middle agers in back cooking. Order at counter and food is bussed to the table when ready. I chose the steak burrito, it was ready in a few minutes, and was reliably good. I tried the salsa verde and the salsa rojo, hard to decide which one I preferred. Both were zingy, the green more so than the red. I'll probably stop in again when in the area to sample some of their other offerings!", "date": "Apr 16, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Food: DELICIOUS!! We ordered the 1) birria bowl 2) steak nachos 3) steak tacos 4) gringa de birria and 5) steak burrito. Everything was nicely seasoned. I've had better steak nachos, but overall, tasty. The birria bowl was HUGE! They should offer a birria CUP. I got through maybe half of it. Down side, they forgot to pack condiments like onion and cilantro for my to-go order. Customer service: they were super busy on a Sunday night. Thankfully we ordered via DoorDash pickup. They forgot to pack condiments and hot sauce, why I docked points. The front desk person was too busy on the phone taking orders to fully help us when we got there. No biggie- just wish we had the condiments go elevate the consomé. Great looking restaurant! Next time, we'll def eat in and try their drinks!", "date": "Jan 8, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Takito - Holic", "alias": "takito-holic-burbank", "text": "Great location for some Birria tacos. Full of flavor and the broth was a great combination. Friendly staff. I want to come back and try the taco-holic tacos.", "date": "Jan 15, 2023", "is_closed": false, "address": "Burbank, IL 60459", "rating": 4.0}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Visited Cork and bean yesterday on a rainy afternoon and got a decaf iced vanilla latte with 1/2 oat, 1/2 almond and cold foam + cinnamon on top Coffee was amazingly rich and the cold foam was super creamy and dense (exactly how I like it)!!! Will go back to try other menu items", "date": "Sep 12, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Former owner of Jack Desmond's next place. Frequented Desmond's when myself and my colleagues rebuilt the train crossing. Cork & Bean is cool. Servers breakfast, lunch and I believe dinner. Also cocktails. On 95th St and summer outdoor seating.This place is family owned, local, and cool. Go over get coffee and some breakfast. Most important meal of the day.", "date": "Jan 7, 2024Updated review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "I work in the neighborhood. This place can be summarized in a word: Charming. The family that runs it is welcoming and hospitable. They know their business and are good at it.The breakfast menu is good and in this era of ridiculous inflation their prices are reasonable and the food is good. I will be back. Go in and see for yourself.", "date": "Apr 22, 2023Previous review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "food was okay. nothing special.service was slow/poor. unfriendly. inattentive.had to ask for a refill on coffee. ambiance was great.", "date": "Nov 30, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "It's a cute place, I liked it. Though when I entered I was asked by someone rather brusquely if I was there for takeout or eating in, and then a few moments later asked the same by another person. I wouldn't have thought it was wait-to-be-seated sort of place so I must confess I was a little confused by this.However, I was just there to get a cup of something warm to drink. Not coffee, since I don't drink that; I had expected to get a chai latte but they had some specials for fall, one of which was an apple cider chai, so I chose that one. It was really quite good and blended two of my favorite coffeehouse drink (chai) with my favorite fall drink (warm apple cider).They have a nice outdoor space, one in the back and one in the front as well. The back space looked like its a bit larger. They also have a video gaming (gambling) area, though I don't know if they are video poker or what. And for some reason I didn't realize that the \"cork\" in Cork & Bean meant that they're also a wine bar (I was clued in by the sign near the door that mentioned sangria).They have a lot of events going on here (you can find current upcoming events on their Facebook page), and I thought that was pretty cool. If you're into The Bachelor, they're showing The Golden Bachelor every week, and they host trivia and book clubs and the like as well. The one thing that surprised me was the prices--I know prices fluctuate, but it was $7.50 for my drink with tip. I guess maybe I should have asked the price since I don't think it was listed on the fall specials menu. But at least it was good. I parked on the street, but I thought I saw parking in the back--though I'm not sure if that was open for everyone or employees only.", "date": "Oct 12, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Love this spot!! So cute and cozy, lots of food and drink options. Very reasonably priced. I have a gluten allergy and I love their breakfast sandwiches on gluten free toast.", "date": "Feb 17, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "I love Cork and Bean. They have a great menu of snacks and small plates and a wide variety of alcoholic and non alcoholic beverages if you don't like coffee. It's always cozy there and the seasonal decor especially above the mantle of the fireplace is my favorite to look at. The servers and staff are friendly and helpful. It's a great place to go and hang out with friends.", "date": "Feb 15, 2024", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Highly impressed. This coffee/cocktail bar is adorable. The decor and ~vibe~ was a 10/10. I cannot praise them enough and their food and coffee was up to par as well. All I can say is definitely try it for yourself.", "date": "Aug 25, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Tried this location on a whim for a quick bite to eat & was pleasantly surprised. I'd describe it has a vintage - ish, style café that serves wine. It's self seating / limited space café, but it works if you want to stop by & work while eating. We tried the Berry Banana Bowl which was tasty, fresh & light. My mom also the Avocado toast, which she enjoyed but I didn't care for it too much. Nonetheless, a nice little spot - quick & fulfilling, and reasonably priced. I would return!", "date": "May 14, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Cork & Bean", "alias": "cork-and-bean-oak-lawn", "text": "Teas & hot beverages are pretty goodFood wise I love their coffee cafe, flatbreads and sandwiches! Great place to study or to meet with friends.", "date": "Nov 18, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.2}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "We were trying to kill some time in the area waiting for a phone to be fixed and decided to drop by this place, and im a little upset i never realized this was here before!We had a taro smoothie and a matcha tea based drink and we both absolutely loved our drinks! The drinks were not too sweet, clumpy, or any of the other usual deterrents that may cause a drink to not be so good. They were simply perfect.The place was also very artsy and pleasant. It's a great place to grab some bubble tea and sit down there to enjoy it! Now that i found this place, i will be absolutely keep coming back! I encourage anyone looking for something new to also give it a try!", "date": "Feb 12, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Being for the bay area, I know what good Boba taste like (haha). This place had lots of good reviews and an extensive menu, so I know I had to check it out. I got their jasmine milk tea with Boba and my brother got their strawberry milk tea with Boba as well. Their milk teas are really yummy and not too Sweet which I love. The Boba itself was a little too chewy and not my favorite. Overall it wasn't too bad and I would go back to try other drink options as well.", "date": "Sep 19, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "They have a lot of options here and everything sounds pretty good. We came here in the afternoon and wanted something refreshing. The inside was really cute and friendly staff. I got the Flamingo with lychee jelly, which includes grapefruit, passion fruit lemon, and honey. It was really good and I really liked how they put lemon slices in it. They made the drinks pretty quickly too.", "date": "Sep 6, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "I was in the area for my graduation and was craving boba. I didn't want to go downtown Chicago just to feed my craving and Tea Yard popped up. I drove over from Midway and ordered their milk tea for myself and the strawberry green tea for my husband. When that first sip touched my lips I knew I had picked the right place. I absolutely loved my milk tea and wanted to turn around and get another but knew I would be back in the area a few days later. I thank you for having an amazing milk tea that soothes the soul.", "date": "May 9, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Tea yard remains an excellent option for Boba drinks in the Oak Lawn area. I wish they had non-dairy options though. You can't go wrong with the classic brown sugar boba drink or almond flavor. I'm a huge fan. Decor is nice too. If you are overwhelmed by the many options get a milk tea with brown sugar and tapioca boba.", "date": "Sep 12, 2022Updated review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Probably the only thing Oak Lawn didn't have was Boba Drinks and this place delivers. Everything is adorable in a chibi anime style. They have an impressive array of Pocky Stick flavors, some I've never seen. The Boba teas are done right. No half softened boba at the bottom or any of that. It's as good as a place in Chinatown. I will definitely be back here again soon! The only thing it has going against it is it's easy to miss. The black sign is more mysterious than inviting and doesn't fit the vibe of the place. I drove by it three times before finally spotting it wedged between other buildings.", "date": "May 30, 2019Previous review", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Decent boba place in Oaklawn, a suburb of Chicago. It was my first time here, and we originally tried to go to another boba place that was listed in Orland Park but it did not exist. My husband warned me that it would not be the same as the boba I get in Los Angeles and it wasn't. I got the Lavender milk tea - which was a little different than I'm used to.  My boba was chewy and good, but drink itself was just okay. I did get 75% sweet, so maybe that's why? My hubby got the red date honey milk tea, which was hot and had an interesting taste as well. Slightly mediciny?Overall it was an okay place as we both needed a caffeine fix after flying the red eye from Los Angeles.", "date": "Dec 27, 2021", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Some of the best tasting milk tea I've ever had. Wish I had a photo but I drank the whole thing way too fast and was sad when I finished it. I had the brown sugar milk tea (not the plain milk drink, the one with actual tea) and it was so perfect. Sweet but not TOO sweet. The tapioca itself was good, too! My only regret was getting the smaller size. Wish I lived closer so I could come by often!Also, the staff was so kind and answered all my questions about recommendations. Loved them!", "date": "Sep 26, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "BEST BOBA IN CHICAGO !! We love this place. Service, drinks, and environment all 10/10.There are claw machines to play while you wait for your order to be ready! We had a great time and won some plushies! 10/10 recommend for yummy boba and a fun time.", "date": "Aug 11, 2023", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
{"resturant_name": "Tea Yard", "alias": "tea-yard-oak-lawn-3", "text": "Cute packaging and tapioca is yummy. I got the strawberry milk tea with tapioca but the strawberry milk taste like plain milk, no flavor to it at all. Really disappointed because they had good reviews", "date": "Apr 30, 2022", "is_closed": false, "address": "Oak Lawn, IL 60453", "rating": 4.5}
